pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// bl602_demo_at_text_000A.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 230A04B4: Register Eq_2 __adddf3(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_9156 a1Out)
// Called from:
//      pa_adapt
//      rfc_init
//      rf_pri_get_vco_freq_cw
//      rf_pri_get_vco_idac_cw
//      tpc_get_vif_tx_power_vs_rate
//      rf_set_channel
//      parse_value
//      ecvtbuf
//      floor
//      __ieee754_pow
//      __ieee754_sqrt
//      rint
//      scalbn
//      __floatundisf
Eq_2 __adddf3(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_9156 & a1Out)
{
	int32 a4_200;
	Eq_568388 s3_284 = a1 >> 0x14 & 0x07FF;
	Eq_568388 a4_100 = a3 >> 0x14 & 0x07FF;
	ui32 a0_33 = (a3 & 0x000FFFFF) << 0x03;
	Eq_568388 a3_217 = s3_284 - a4_100;
	Eq_2 s1_17 = __csrrs(frm, fp + -32);
	Eq_2 t1_106 = a0 << 0x03;
	Eq_568388 s2_111 = a1 >> 0x1F;
	Eq_2 a1_107 = a0 >> 0x1D | (a1 & 0x000FFFFF) << 0x03;
	Eq_2 a5_183 = a2 >> 0x1D | a0_33;
	Eq_2 a7_184 = a2 << 0x03;
	Eq_568388 a6_124 = a3_217;
	if (a1 >> 0x1F == a3 >> 0x1F)
	{
		if (a3_217 > 0x00)
		{
			if (a4_100 == 0x00)
			{
				if ((a5_183 | a2 << 0x03) == 0x00)
					goto l230A0538;
				a3_217 = (word32) a3_217.u0 - 1;
				if (a3_217 == ~0x00)
				{
					a7_184 = (a2 << 0x03) + (a0 << 0x03);
					a5_183 = a1_107 + a5_183 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
					goto l230A0564;
				}
				if (a3_217 == 0x07FF)
				{
l230A0574:
					a7_184 = a1_107 | a0 << 0x03;
					a5_183.u0 = 0;
					if (a7_184 == 0x00)
						goto l230A0F54;
					if (a1_107 << 0x09 >= 0x00)
					{
l230A05B8:
						a5_183 = a1_107;
						a7_184 = a0 << 0x03;
						s3_284.u0 = 0;
						goto l230A05BC;
					}
					a5_183 = a1_107;
					a7_184 = a0 << 0x03;
					s3_284.u0 = 0;
l230A06C4:
					if ((a7_184 & 7) == 0x00)
					{
						if (s3_284 == 0x00 || (a4_100 & 1) == 0x00)
							goto l230A0F54;
						goto l230A06D8;
					}
					goto l230A08E0;
				}
l230A05CC:
				Eq_569054 a3_534;
				ui32 a7_519;
				if (a3_217 <= 56)
				{
					if (a3_217 <= 31)
					{
						int32 s0_536 = 32 - a3_217;
						a7_519 = a5_183 << s0_536 | (a2 << 0x03) >> a3_217 | (word32) ((a2 << 0x03) << s0_536 != 0x00);
						a3_534 = a5_183 >> a3_217;
						goto l230A0600;
					}
					uint32 a4_523 = a5_183 >> (word32) a3_217 - 32;
					int32 s0_524 = 0;
					if (a3_217 != 32)
						s0_524 = a5_183 << 64 - a3_217;
					a7_519 = a4_523 | (word32) ((s0_524 | a2 << 0x03) != 0x00);
				}
				else
					a7_519 = (word32) ((a5_183 | a2 << 0x03) != 0x00);
				a3_534.u0 = 0;
l230A0600:
				a7_184 = a7_519 + (a0 << 0x03);
				a5_183 = a3_534 + a1_107 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
				a6_124 = s3_284;
				goto l230A0614;
			}
			if (s3_284 != 0x07FF)
			{
				a5_183 |= 0x00800000;
				goto l230A05CC;
			}
l230A059C:
			a7_184 = a1_107 | a0 << 0x03;
			if (a7_184 != 0x00)
			{
				if (a1_107 << 0x09 >= 0x00)
				{
					a6_124.u0 = 0x07FF;
					goto l230A05B8;
				}
				a5_183 = a1_107;
				a7_184 = a0 << 0x03;
l230A0E84:
				a6_124.u0 = 0x07FF;
				goto l230A08A0;
			}
			goto l230A0E38;
		}
		if (a3_217 != 0x00)
		{
			Eq_568388 a3_418;
			a6_124 = a4_100 - s3_284;
			if (s3_284 == 0x00)
			{
				if ((a1_107 | a0 << 0x03) == 0x00)
				{
					if (a6_124 != 0x07FF)
					{
l230A0DD0:
						if (a6_124 != 0x00)
							goto l230A08A0;
						goto l230A0DD4;
					}
					goto l230A06AC;
				}
				a3_418 = (word32) a6_124 - 1;
				if (a6_124 == ~0x00)
				{
					Eq_2 t1_481 = (a0 << 0x03) + (a2 << 0x03);
					a5_183 = a1_107 + a5_183 + CONVERT(t1_481 <u a2 << 0x03, bool, word32);
					a7_184 = t1_481;
l230A0564:
					a6_124.u0 = 1;
l230A0614:
					if (a5_183 << 0x08 < 0x00)
					{
						a6_124 = (word32) a6_124.u0 + 1;
						if (a6_124 != 0x07FF)
						{
							uint32 a0_700 = a5_183 & ~0x00800000;
							a7_184 = a0_700 << 0x1F | (a7_184 >> 0x01 | a7_184 & 1);
							a5_183 = a0_700 >> 0x01;
							goto l230A08A0;
						}
						if (s1_17 != 0x00)
						{
							if (s1_17 == 3)
							{
								if (a1 >> 0x1F == 0x00)
									goto l230A0920;
l230A0E50:
								goto l230A08DC;
							}
							if (s1_17 != 2)
								goto l230A0E50;
							if (a1 >> 0x1F == 0x00)
							{
l230A08DC:
								a6_124.u0 = 0x07FE;
								s3_284.u0 = 0;
								a5_183.u0 = -1;
								a7_184.u0 = -1;
								a4_100.u0 = 5;
l230A08E0:
								Eq_2 a1_817;
								a4_100 |= 1;
								if (s1_17 != 2)
								{
									if (s1_17 != 3)
									{
										if (s1_17 != 0x00)
											goto l230A0908;
										a1_817 = (byte) a7_184.u0 + 4;
										if ((a7_184 & 0x0F) == 4)
										{
l230A0908:
											if (s3_284 != 0x00)
											{
l230A06D8:
												a4_100 |= 2;
												goto l230A0F54;
											}
											goto l230A0F54;
										}
l230A0EE0:
										a5_183 = (byte) a5_183.u0 + (word32) (a1_817 < a7_184);
										a7_184 = a1_817;
										goto l230A0908;
									}
									if (s2_111 != 0x00)
										goto l230A0908;
								}
								else if (s2_111 == 0x00)
									goto l230A0908;
								a1_817 = (byte) a7_184.u0 + 8;
								goto l230A0EE0;
							}
						}
						goto l230A0920;
					}
					goto l230A0DD0;
				}
				if (a6_124 == 0x07FF)
				{
l230A06AC:
					if ((a5_183 | a2 << 0x03) != 0x00)
					{
						a4_100 = (word32) ((a5_183 & 0x00400000) < 1) << 0x04;
						goto l230A06C4;
					}
					goto l230A0E8C;
				}
l230A0708:
				Eq_569243 a3_450;
				ui32 t1_435;
				if (a3_418 <= 56)
				{
					if (a3_418 <= 31)
					{
						int32 a0_452 = 32 - a3_418;
						t1_435 = a1_107 << a0_452 | (a0 << 0x03) >> a3_418 | (word32) ((a0 << 0x03) << a0_452 != 0x00);
						a3_450 = a1_107 >> a3_418;
						goto l230A073C;
					}
					uint32 a2_439 = a1_107 >> (word32) a3_418 - 32;
					int32 a0_440 = 0;
					if (a3_418 != 32)
						a0_440 = a1_107 << 64 - a3_418;
					t1_435 = a2_439 | (word32) ((a0_440 | a0 << 0x03) != 0x00);
				}
				else
					t1_435 = (word32) ((a1_107 | a0 << 0x03) != 0x00);
				a3_450.u0 = 0;
l230A073C:
				Eq_2 t1_466 = t1_435 + (a2 << 0x03);
				a5_183 = a3_450 + a5_183 + CONVERT(t1_466 <u a2 << 0x03, bool, word32);
				a7_184 = t1_466;
				a6_124 = a4_100;
				goto l230A0614;
			}
			if (a4_100 != 0x07FF)
			{
				a1_107 |= 0x00800000;
				a3_418 = a6_124;
				goto l230A0708;
			}
			if ((a5_183 | a2 << 0x03) == 0x00)
			{
				a7_184.u0 = 0;
l230A0E38:
				a6_124.u0 = 0x07FF;
				goto l230A0E3C;
			}
l230A0770:
			a6_124.u0 = 0x07FF;
			a4_200 = (a2 >> 0x1D | a0_33) << 0x09;
			s3_284.u0 = 0;
			goto l230A0AA8;
		}
		a6_124 = (word32) s3_284.u0 + 1;
		if (((word32) s3_284.u0 + 1 & 0x07FE) != 0x00)
		{
			if (s3_284 == -0x07FE)
			{
				if (s1_17 != 0x00)
				{
					if (s1_17 == 3)
					{
						if (a1 >> 0x1F != 0x00)
							goto l230A08CC;
					}
					else if (s1_17 != 2 || a1 >> 0x1F == 0x00)
						goto l230A08CC;
				}
				a6_124.u0 = 0x07FF;
l230A0920:
				a5_183.u0 = 0;
				a7_184.u0 = 0;
				a4_100.u0 = 5;
				goto l230A0F54;
			}
			uint32 a7_352 = (a0 << 0x03) + (a2 << 0x03);
			word32 t1_355 = a1_107 + a5_183 + CONVERT(a7_352 <u a0 << 0x03, bool, word32);
			a7_184 = t1_355 << 0x1F | a7_352 >> 0x01;
			a5_183 = t1_355 >> 0x01;
l230A08A0:
			s3_284.u0 = 0;
			goto l230A0AAC;
		}
		ui32 a3_360 = a1_107 | a0 << 0x03;
		if (s3_284 == 0x00)
		{
			if (a3_360 != 0x00)
			{
				if ((a5_183 | a2 << 0x03) == 0x00)
					goto l230A0BA4;
				a7_184 = (a2 << 0x03) + (a0 << 0x03);
				a1_107 = a1_107 + a5_183 + CONVERT(a7_184 <u a0 << 0x03, bool, word32);
				if (a1_107 << 0x08 < 0x00)
				{
					a5_183 = a1_107 & ~0x00800000;
					a4_100.u0 = 0;
					a6_124.u0 = 1;
					goto l230A06C4;
				}
l230A0DD8:
				t1_106 = a7_184;
l230A0BA4:
				a7_184 = t1_106 | a1_107;
				if (a7_184 != 0x00)
				{
					uint32 s3_596 = (a1_107 << 0x01) + (t1_106 >> 0x1F);
					Eq_568640 a5_597 = t1_106 << 0x01;
					a4_100.u0 = 0;
					if ((a5_597 & 7) != 0x00)
					{
						if (s1_17 != 2)
						{
							if (s1_17 != 3)
							{
								a4_100.u0 = 1;
								if (s1_17 == 0x00 && (a5_597 & 0x0F) != 4)
									s3_596 += (word32) (a5_597 < -4) ^ 1;
							}
							else
							{
								a4_100 = s2_111;
								if (s2_111 == 0x00)
								{
									s3_596 += (word32) (a5_597 < -8) ^ 1;
									a4_100.u0 = 1;
								}
							}
						}
						else
						{
							a4_100.u0 = 1;
							if (s2_111 != 0x00)
							{
								s3_596 += (word32) (a5_597 < -8) ^ 1;
								a4_100 = s2_111;
							}
						}
					}
					s3_284 = (s3_596 >> 0x18 ^ 1) & 1;
					a5_183 = a1_107;
					a7_184 = t1_106;
					a6_124.u0 = 0;
					goto l230A06C4;
				}
				a6_124.u0 = 0;
l230A0E3C:
				a5_183.u0 = 0;
				a4_100.u0 = 0;
				goto l230A0F54;
			}
l230A0DD4:
			a1_107 = a5_183;
			goto l230A0DD8;
		}
		Eq_568388 a6_362;
		if (s3_284 == 0x07FF)
		{
			if (a3_360 != 0x00)
			{
				a6_362 = (word32) ((a1_107 & 0x00400000) < 1) << 0x04;
				if (a4_100 != s3_284)
					goto l230A085C;
			}
			else
			{
				if (a4_100 != s3_284)
					goto l230A0E84;
				a6_362.u0 = 0;
			}
		}
		else
		{
			a6_362.u0 = 0;
			if (a4_100 != 0x07FF)
				goto l230A0858;
		}
		if ((a5_183 | a2 << 0x03) == 0x00)
		{
			if (a3_360 == 0x00)
				goto l230A086C;
l230A0864:
			a5_183 = a1_107;
			a7_184 = a0 << 0x03;
l230A086C:
			a4_100 = a6_362;
l230A0EC4:
			s3_284.u0 = 0;
			a6_124.u0 = 0x07FF;
			goto l230A06C4;
		}
		if (a5_183 << 0x09 >= 0x00)
			a6_362.u0 = 16;
l230A0858:
		if (a3_360 == 0x00)
			goto l230A086C;
l230A085C:
		if ((a5_183 | a2 << 0x03) == 0x00)
			goto l230A0864;
		a4_100 = a6_362;
l230A0F48:
		s2_111.u0 = 0;
		a5_183.u0 = 0x00400000;
		a7_184.u0 = 0;
		a6_124.u0 = 0x07FF;
l230A0F54:
		if (a5_183 << 0x08 >= 0x00)
		{
l230A0F74:
			Eq_2 a7_938 = a5_183 << 0x1D | a7_184 >> 0x03;
			Eq_568698 a5_939 = a5_183 >> 0x03;
			if (a6_124 == 0x07FF)
			{
				a7_938 |= a5_939;
				a5_939.u0 = 0;
				if (a7_938 != 0x00)
				{
					a5_939.u0 = 0x00080000;
					a7_938.u0 = 0;
					s2_111.u0 = 0;
				}
			}
			Eq_9156 a1_962 = (word32) (word20) a5_939 | (a6_124 & 0x07FF) << 0x14 | s2_111 << 0x1F;
			if (a4_100 != 0x00)
				__csrrs(fflags, ra);
			a1Out = a1_962;
			return a7_938;
		}
		a6_124 = (word32) a6_124.u0 + 1;
		if (a6_124 != 0x07FF)
		{
			a5_183 &= ~0x00800000;
			goto l230A0F74;
		}
		a7_184.u0 = 0;
		if (s1_17 != 0x00)
		{
			if (s1_17 == 3)
			{
				if (s2_111 == 0x00)
					goto l230A0F24;
			}
			else if (s1_17 == 2 && s2_111 != 0x00)
				goto l230A0F24;
			a7_184.u0 = -1;
			a6_124.u0 = 0x07FE;
		}
l230A0F24:
		a4_100 |= 5;
		a5_183 = a7_184;
		goto l230A0F74;
	}
	Eq_2 s4_282;
	Eq_2 s0_279;
	if (a3_217 > 0x00)
	{
		if (a4_100 == 0x00)
		{
			if ((a5_183 | a2 << 0x03) == 0x00)
			{
l230A0538:
				if (a3_217 != 0x07FF)
				{
					a5_183 = a1_107;
					a7_184 = a0 << 0x03;
					goto l230A08A0;
				}
				goto l230A0574;
			}
			a3_217 = (word32) a3_217 - 1;
			if (a3_217 == ~0x00)
			{
				a7_184 = (a0 << 0x03) - (a2 << 0x03);
				a5_183 = a1_107 - a5_183 - (word32) (a0 << 0x03 < a7_184);
				goto l230A0968;
			}
			if (a3_217 == 0x07FF)
				goto l230A0574;
		}
		else
		{
			if (s3_284 == 0x07FF)
				goto l230A059C;
			a5_183 |= 0x00800000;
		}
		Eq_568495 a3_239;
		ui32 a7_224;
		if (a3_217 <= 56)
		{
			if (a3_217 <= 31)
			{
				int32 s0_241 = 32 - a3_217;
				a7_224 = a5_183 << s0_241 | (a2 << 0x03) >> a3_217 | (word32) ((a2 << 0x03) << s0_241 != 0x00);
				a3_239 = a5_183 >> a3_217;
				goto l230A09AC;
			}
			uint32 a4_228 = a5_183 >> (word32) a3_217 - 32;
			int32 s0_229 = 0;
			if (a3_217 != 32)
				s0_229 = a5_183 << 64 - a3_217;
			a7_224 = a4_228 | (word32) ((s0_229 | a2 << 0x03) != 0x00);
		}
		else
			a7_224 = (word32) ((a5_183 | a2 << 0x03) != 0x00);
		a3_239.u0 = 0;
l230A09AC:
		a7_184 = (a0 << 0x03) - a7_224;
		a5_183 = a1_107 - a3_239 - (word32) (a0 << 0x03 < a7_184);
		a6_124 = s3_284;
		goto l230A09C0;
	}
	if (a3_217 != 0x00)
	{
		Eq_568388 s0_128;
		a6_124 = a4_100 - s3_284;
		if (s3_284 == 0x00)
		{
			if ((a1_107 | a0 << 0x03) == 0x00)
			{
				s2_111 = a3 >> 0x1F;
				if (a6_124 != 0x07FF)
					goto l230A0DD0;
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					a4_100.u0 = 0;
					if (a5_183 << 0x09 < 0x00)
						goto l230A06C4;
					goto l230A05BC;
				}
l230A0E8C:
				a7_184.u0 = 0;
				goto l230A0E3C;
			}
			s0_128 = (word32) a6_124.u0 - 1;
			if (a6_124 == ~0x00)
			{
				Eq_2 t1_202 = (a2 << 0x03) - (a0 << 0x03);
				a5_183 = a5_183 - a1_107 - (word32) (a2 << 0x03 < t1_202);
				s2_111 = a3 >> 0x1F;
				a7_184 = t1_202;
l230A0968:
				a6_124.u0 = 1;
				goto l230A09C0;
			}
			if (a6_124 == 0x07FF)
			{
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					a4_200 = a5_183 << 0x09;
					s2_111 = a3 >> 0x1F;
l230A0AA8:
					if (a4_200 < 0x00)
					{
l230A0AAC:
						a4_100.u0 = 0;
						goto l230A06C4;
					}
l230A05BC:
					a4_100.u0 = 16;
					goto l230A06C4;
				}
				goto l230A0EA0;
			}
		}
		else
		{
			if (a4_100 == 0x07FF)
			{
				if ((a5_183 | a2 << 0x03) != 0x00)
				{
					s2_111 = a3 >> 0x1F;
					goto l230A0770;
				}
				a6_124.u0 = 0x07FF;
l230A0EA0:
				a7_184.u0 = 0;
				s2_111 = a3 >> 0x1F;
				goto l230A0E3C;
			}
			a1_107 |= 0x00800000;
			s0_128 = a6_124;
		}
		Eq_569010 a3_159;
		ui32 t1_144;
		if (s0_128 <= 56)
		{
			if (s0_128 <= 31)
			{
				int32 a0_161 = 32 - s0_128;
				t1_144 = a1_107 << a0_161 | (a0 << 0x03) >> s0_128 | (word32) ((a0 << 0x03) << a0_161 != 0x00);
				a3_159 = a1_107 >> s0_128;
				goto l230A0B14;
			}
			uint32 a2_148 = a1_107 >> (word32) s0_128 - 32;
			int32 a0_149 = 0;
			if (s0_128 != 32)
				a0_149 = a1_107 << 64 - s0_128;
			t1_144 = a2_148 | (word32) ((a0_149 | a0 << 0x03) != 0x00);
		}
		else
			t1_144 = (word32) ((a1_107 | a0 << 0x03) != 0x00);
		a3_159.u0 = 0;
l230A0B14:
		Eq_2 t1_175 = (a2 << 0x03) - t1_144;
		a5_183 = a5_183 - a3_159 - (word32) (a2 << 0x03 < t1_175);
		a7_184 = t1_175;
		a6_124 = a4_100;
		s2_111 = a3 >> 0x1F;
l230A09C0:
		if (a5_183 << 0x08 >= 0x00)
			goto l230A0DD0;
		s0_279 = a5_183 & 0x007FFFFF;
		s4_282 = a7_184;
		s3_284 = a6_124;
l230A0CF8:
		Eq_2 a0_291;
		if (s0_279 != 0x00)
		{
			word32 a4_1935;
			word32 a5_1936;
			a0_291 = __clzsi2(s0_279, out a4_1935, out a5_1936);
		}
		else
		{
			word32 a4_1933;
			word32 a5_1934;
			a0_291 = (word32) __clzsi2(s4_282, out a4_1933, out a5_1934) + 32;
		}
		uint32 s0_301;
		Eq_568388 a6_297 = (word32) a0_291 - 8;
		if (a6_297 <= 31)
		{
			s0_301 = s4_282 >> 32 - a6_297 | s0_279 << a6_297;
			a7_184 = s4_282 << a6_297;
		}
		else
		{
			s0_301 = s4_282 << (word32) a0_291 - 40;
			a7_184.u0 = 0;
		}
		if (a6_297 < s3_284)
		{
			a6_124 = s3_284 - a6_297;
			a5_183 = s0_301 & ~0x00800000;
			goto l230A0DD0;
		}
		int32 a6_319 = a6_297 - s3_284;
		if (a6_319 <= -30)
		{
			int32 a2_338 = 32 - (a6_319 + 1);
			t1_106 = s0_301 << a2_338 | a7_184 >> a6_319 + 1 | (word32) (a7_184 << a2_338 != 0x00);
			a1_107 = s0_301 >> a6_319 + 1;
			goto l230A0BA4;
		}
		uint32 a6_324 = s0_301 >> a6_319 + -31;
		int32 a4_325 = 0;
		if (a6_319 != -31)
			a4_325 = s0_301 << 64 - (a6_319 + 1);
		t1_106 = a6_324 | (word32) ((a7_184 | a4_325) != 0x00);
l230A0C58:
		a1_107.u0 = 0;
		goto l230A0BA4;
	}
	if (((word32) s3_284.u0 + 1 & 0x07FE) != 0x00)
	{
		s4_282 = (a0 << 0x03) - (a2 << 0x03);
		s0_279 = a1_107 - a5_183 - (word32) (a0 << 0x03 < s4_282);
		if (s0_279 << 0x08 < 0x00)
		{
			s4_282 = (a2 << 0x03) - (a0 << 0x03);
			s0_279 = a5_183 - a1_107 - (word32) (a2 << 0x03 < s4_282);
			s2_111 = a3 >> 0x1F;
			goto l230A0CF8;
		}
		t1_106 = s4_282 | s0_279;
		if (t1_106 != 0x00)
			goto l230A0CF8;
		goto l230A0C50;
	}
	ui32 a0_55 = a1_107 | a0 << 0x03;
	ui32 a2_56 = a5_183 | a2 << 0x03;
	if (s3_284 == 0x00)
	{
		if (a0_55 == 0x00)
		{
			if (a2_56 == 0x00)
			{
				s2_111 = (word32) (s1_17 < -3);
				a1_107.u0 = 0;
				t1_106.u0 = 0;
				goto l230A0BA4;
			}
			a1_107 = a5_183;
			t1_106 = a2 << 0x03;
l230A0C40:
			s2_111 = a3 >> 0x1F;
			goto l230A0BA4;
		}
		if (a2_56 == 0x00)
			goto l230A0BA4;
		Eq_2 a3_101 = (a0 << 0x03) - (a2 << 0x03);
		Eq_2 a4_104 = a1_107 - a5_183 - (word32) (a0 << 0x03 < a3_101);
		if (a4_104 << 0x08 < 0x00)
		{
			t1_106 = (a2 << 0x03) - (a0 << 0x03);
			a1_107 = a5_183 - a1_107 - (word32) (a2 << 0x03 < t1_106);
			goto l230A0C40;
		}
		t1_106 = a3_101 | a4_104;
		if (t1_106 != 0x00)
		{
			a1_107 = a4_104;
			t1_106 = a3_101;
			goto l230A0BA4;
		}
l230A0C50:
		s2_111 = (word32) (s1_17 < -3);
		goto l230A0C58;
	}
	if (s3_284 == 0x07FF)
	{
		if (a0_55 != 0x00)
		{
			ui32 a3_63 = (word32) ((a1_107 & 0x00400000) < 1);
			if (a4_100 != s3_284)
			{
				a4_100 = a3_63 << 0x04;
				goto l230A0F40;
			}
			a4_100 = a3_63 << 0x04;
l230A0C90:
			if (a2_56 != 0x00 && a5_183 << 0x09 >= 0x00)
				a4_100.u0 = 16;
			goto l230A0CA0;
		}
		if (a4_100 != s3_284)
		{
			a4_100.u0 = 0;
l230A0CA4:
			s2_111 = a3 >> 0x1F;
			if (a2_56 == 0x00)
			{
				a7_184.u0 = 0;
				s2_111.u0 = 0;
				a5_183.u0 = 0x00400000;
				a6_124.u0 = 0x07FF;
				a4_100.u0 = 16;
				goto l230A0F54;
			}
			goto l230A0EC0;
		}
	}
	else if (a4_100 != 0x07FF)
	{
		a4_100.u0 = 0;
l230A0CA0:
		if (a0_55 == 0x00)
			goto l230A0CA4;
l230A0F40:
		if (a2_56 != 0x00)
			goto l230A0F48;
		a5_183 = a1_107;
		a7_184 = a0 << 0x03;
l230A0EC0:
		goto l230A0EC4;
	}
	a4_100.u0 = 0;
	goto l230A0C90;
}

