pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A1004: Register Eq_2 __divdf3(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_8767 s0Out, Register out ptr32 s1Out, Register out Eq_8769 a0Out, Register out Eq_8770 a1Out, Register out Eq_8770 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_8774 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      pa_input
//      rf_set_channel
//      ecvtbuf
//      TSEN_Get_Temp
//      pow
//      __ieee754_pow
//      __ieee754_sqrt
Eq_2 __divdf3(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_8767 & s0Out, ptr32 & s1Out, union Eq_8769 & a0Out, union Eq_8770 & a1Out, union Eq_8770 & a3Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_8774 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	int32 s1_149;
	Eq_2 s3_205;
	int32 s6_184;
	int32 s8_159;
	Eq_2 s2_33 = __csrrs(frm, fp + -48);
	int32 a6_37 = a1 >> 0x14 & 0x07FF;
	Eq_2 s7_197 = (word32) (word20) a1;
	if (a6_37 != 0x00)
	{
		if (a6_37 == 0x07FF)
		{
			if ((s7_197 | a0) != 0x00)
			{
				s3_205 = a0;
				s6_184 = 0x07FF;
				s8_159 = 3;
				s1_149 = 16;
				if (s7_197 << 0x0C >= 0x00)
				{
l230A1110:
					int32 a0_110;
					int32 a4_111;
					int32 a6_98 = a3 >> 0x14 & 0x07FF;
					Eq_2 a5_104 = a2;
					Eq_2 s0_105 = (word32) (word20) a3;
					if (a6_98 != 0x00)
					{
						if (a6_98 == 0x07FF)
						{
							if ((s0_105 | a2) != 0x00)
							{
								a0_110 = 0x07FF;
								if (s0_105 << 0x0C >= 0x00)
								{
									a4_111 = 3;
									s1_149 = 16;
								}
								else
									a4_111 = 3;
							}
							else
							{
								s0_105.u0 = 0;
								a5_104.u0 = 0;
								a0_110 = 0x07FF;
								a4_111 = 2;
							}
l230A1154:
							Eq_569460 a3_166 = s8_159 << 0x02 | a4_111;
							ui32 a2_182 = a1 >> 0x1F ^ a3 >> 0x1F;
							int32 a6_192 = s6_184 - a0_110;
							if (a3_166 <= -0x0F)
							{
								<anonymous> * a3_1043 = g_a230CB3F8[((word32) a3_166.u1 - 1) * 0x04] + 588035064;
								Eq_8767 s0_1057;
								Eq_8774 s5_1058;
								ptr32 s9_1059;
								Eq_2 ra_1060;
								ptr32 s1_1061;
								ptr32 s2_1062;
								ptr32 s3_1063;
								ptr32 s6_1065;
								ptr32 s7_1066;
								Eq_8769 a0_1068;
								Eq_8770 a3_1070;
								ptr32 frm_1071;
								Eq_8770 a1_1073;
								ptr32 fflags_1084;
								a3_1043();
								s0Out = s0_1057;
								s1Out = s1_1061;
								a0Out = a0_1068;
								a1Out = a1_1073;
								a3Out = a3_1070;
								s2Out = s2_1062;
								s3Out = s3_1063;
								s5Out = s5_1058;
								s6Out = s6_1065;
								s7Out = s7_1066;
								s9Out = s9_1059;
								fflagsOut = fflags_1084;
								frmOut = frm_1071;
								return ra_1060;
							}
							Eq_569456 a3_217;
							if (s0_105 >= s7_197 && (s7_197 != s0_105 || s3_205 < a5_104))
							{
								a6_192 += -1;
								a3_217.u0 = 0;
							}
							else
							{
								a3_217 = s3_205 << 0x1F;
								s7_197 >>= 0x01;
								s3_205 = s7_197 << 0x1F | s3_205 >> 0x01;
							}
							uint32 a0_233 = a5_104 >> 0x18 | s0_105 << 0x08;
							uint32 t1_237 = s7_197 >> (a0_233 >> 0x10);
							word32 t4_239 = (word32) (word16) a0_233;
							Eq_569456 a1_240 = a5_104 << 0x08;
							uint32 a7_245 = t1_237;
							uint32 a4_246 = t4_239 + t1_237;
							uint32 a5_248 = s3_205 >> 0x10 | (s7_197 & a0_233 >> 0x10) << 0x10;
							if (a5_248 < a4_246)
							{
								a5_248 += a0_233;
								a7_245 = t1_237 + -1;
								if (a5_248 >= a0_233 && a5_248 < a4_246)
								{
									a7_245 = t1_237 + -2;
									a5_248 += a0_233;
								}
							}
							uint32 a5_255 = a5_248 - a4_246;
							uint32 t3_257 = a5_255 >> (a0_233 >> 0x10);
							uint32 s3_262 = t3_257;
							uint32 t1_264 = (word32) (word16) a0_233 + t3_257;
							uint32 a4_266 = (word32) (word16) s3_205 | (a5_255 & a0_233 >> 0x10) << 0x10;
							if (a4_266 < t1_264)
							{
								a4_266 += a0_233;
								s3_262 = t3_257 + -1;
								if (a4_266 >= a0_233 && a4_266 < t1_264)
								{
									s3_262 = t3_257 + -2;
									a4_266 += a0_233;
								}
							}
							uint32 s3_276 = a7_245 << 0x10 | s3_262;
							uint32 s0_289 = (s3_276 >> 0x10) + (a1_240 & 0xFFFF);
							uint32 a5_288 = (a1_240 & 0xFFFF) + (s3_276 & 0xFFFF);
							uint32 a4_285 = a4_266 - t1_264;
							uint32 t1_293 = (a5_288 >> 0x10) + (((a1_240 >> 0x10) + (s3_276 & 0xFFFF)) + s0_289);
							uint32 t0_294 = (s3_276 >> 0x10) + (a1_240 >> 0x10);
							if (t1_293 < s0_289)
								t0_294 += 0x00010000;
							uint32 s0_309;
							uint32 t0_301 = (t1_293 >> 0x10) + t0_294;
							Eq_569456 a7_306 = ((t1_293 & 0xFFFF) << 0x10) + (a5_288 & 0xFFFF);
							if (a4_285 >= t0_301)
							{
								s0_309 = s3_276;
								if (a4_285 != t0_301 || a3_217 >= a7_306)
								{
l230A13D8:
									Eq_569456 a7_349 = a3_217 - a7_306;
									uint32 a4_355 = a4_285 - t0_301 - (word32) (a3_217 < a7_349);
									Eq_569695 a5_356 = -1;
									if (a0_233 == a4_355)
									{
l230A1514:
										Eq_8769 a5_629;
										int32 a4_507;
										Eq_8769 a0_655;
										int32 a1_506 = a6_192 + 0x03FF;
										if (a1_506 > 0x00)
										{
											if ((a5_356 & 7) == 0x00)
											{
l230A15DC:
												if (s0_309 << 0x07 < 0x00)
												{
													s0_309 &= ~0x01000000;
													a1_506 = a6_192 + 0x0400;
												}
												if (a1_506 <= 0x07FE)
												{
													a5_629 = s0_309 << 0x1D | a5_356 >> 0x03;
													a0_655 = s0_309 >> 0x03;
													a4_507 = a1_506;
													goto l230A1610;
												}
												if (s2_33 != 2)
												{
													if (s2_33 != 3)
													{
														if (s2_33 != 0x00)
														{
l230A1684:
															a5_629.u0 = -1;
															a4_507 = 0x07FE;
l230A168C:
															s1_149 |= 5;
															a0_655 = a5_629;
															goto l230A1610;
														}
													}
													else if (a2_182 != 0x00)
														goto l230A1684;
												}
												else if (a2_182 == 0x00)
													goto l230A1684;
												a5_629.u0 = 0;
												a4_507 = 0x07FF;
												goto l230A168C;
											}
											Eq_569695 a4_737;
											s1_149 |= 1;
											if (s2_33 != 2)
											{
												if (s2_33 != 3)
												{
													if (s2_33 != 0x00 || (a5_356 & 0x0F) == 4)
														goto l230A15DC;
													a4_737 = (word32) a5_356 + 4;
l230A154C:
													s0_309 += (word32) (a4_737 < a5_356);
													a5_356 = a4_737;
													goto l230A15DC;
												}
												if (a2_182 != 0x00)
													goto l230A15DC;
											}
											else if (a2_182 == 0x00)
												goto l230A15DC;
											a4_737 = (word32) a5_356 + 8;
											goto l230A154C;
										}
										a4_507 = 1;
										if (a1_506 != 0x00)
										{
l230A1720:
											int32 a0_622 = 1 - a1_506;
											if (a0_622 <= 56)
											{
												uint32 a5_674;
												Eq_569949 a0_675;
												if (a0_622 <= 31)
												{
													int32 a6_676 = a6_192 + 0x041E;
													a5_674 = s0_309 << a6_676 | a5_356 >> a0_622 | (word32) (a5_356 << a6_676 != 0x00);
													a0_675 = s0_309 >> a0_622;
												}
												else
												{
													uint32 a3_661 = s0_309 >> -31 - a1_506;
													int32 a1_662 = 0;
													if (a0_622 != 32)
														a1_662 = s0_309 << a6_192 + 0x043E;
													a5_674 = a3_661 | (word32) ((a1_662 | a5_356) != 0x00);
													a0_675.u0 = 0;
												}
												if ((a5_674 & 7) == 0x00)
												{
l230A17DC:
													if (a0_675 << 0x08 < 0x00)
													{
														s1_149 |= 1;
														a0_655.u0 = 0;
														a5_629.u0 = 0;
														if (a4_507 == 0x00)
														{
															a4_507 = 1;
															goto l230A1610;
														}
													}
													else
													{
														a5_629 = a0_675 << 0x1D | a5_674 >> 0x03;
														a0_655 = a0_675 >> 0x03;
														if (a4_507 == 0x00)
															goto l230A1610;
														a4_507 = s1_149 & 1;
														if (a4_507 == 0x00)
														{
l230A1610:
															Eq_8770 a3_816 = (word32) (word20) a0_655 | (a4_507 & 0x07FF) << 0x14 | a2_182 << 0x1F;
															if (s1_149 != 0x00)
																__csrrs(fflags, ra);
															s0Out = s0;
															s1Out = s1;
															a0Out = a5_629;
															a1Out = a3_816;
															a3Out = a3_816;
															s2Out = s2;
															s3Out = s3;
															s5Out = s5;
															s6Out = s6;
															s7Out = s7;
															s9Out = s9;
															fflagsOut = fflags;
															frmOut = frm;
															return ra;
														}
														a4_507 = 0;
													}
													s1_149 |= 2;
													goto l230A1610;
												}
												uint32 a3_696;
												s1_149 |= 1;
												if (s2_33 != 2)
												{
													if (s2_33 != 3)
													{
														if (s2_33 != 0x00 || (a5_674 & 0x0F) == 4)
															goto l230A17DC;
														a3_696 = a5_674 + 4;
l230A1788:
														a0_675 = (word32) a0_675 + (word32) (a3_696 < a5_674);
														a5_674 = a3_696;
														goto l230A17DC;
													}
													if (a2_182 != 0x00)
														goto l230A17DC;
												}
												else if (a2_182 == 0x00)
													goto l230A17DC;
												a3_696 = a5_674 + 8;
												goto l230A1788;
											}
											a5_629 = a5_356 | s0_309;
											if (a5_629 == 0x00)
											{
l230A185C:
												s1_149 |= 2;
												a0_655.u0 = 0;
												a4_507 = 0;
												goto l230A1610;
											}
											Eq_570054 a5_640;
											s1_149 |= 1;
											if (s2_33 != 2)
											{
												if (s2_33 != 3)
												{
													a5_640.u0 = 5;
													if (s2_33 == 0x00)
														goto l230A1858;
												}
												else
												{
													a5_640.u0 = 9;
													if (a2_182 == 0x00)
														goto l230A1858;
												}
											}
											else
											{
												a5_640.u0 = 9;
												if (a2_182 != 0x00)
													goto l230A1858;
											}
											a5_640.u0 = 1;
l230A1858:
											a5_629 = a5_640 >> 0x03;
											goto l230A185C;
										}
										uint32 a4_522 = s0_309;
										if ((a5_356 & 7) == 0x00)
										{
l230A1714:
											a4_507 = (a4_522 >> 0x18 ^ 1) & 1;
											goto l230A1720;
										}
										word32 a4_603;
										s1_149 |= 1;
										if (s2_33 != 2)
										{
											if (s2_33 != 3)
											{
												a4_522 = s0_309;
												if (s2_33 != 0x00 || (a5_356 & 0x0F) == 4)
													goto l230A1714;
												a4_603 = (word32) (a5_356 < -4);
l230A16F0:
												a4_522 = (a4_603 ^ 1) + s0_309;
												goto l230A1714;
											}
											a4_522 = s0_309;
											if (a2_182 != 0x00)
												goto l230A1714;
										}
										else
										{
											a4_522 = s0_309;
											if (a2_182 == 0x00)
												goto l230A1714;
										}
										a4_603 = (word32) (a5_356 < -8);
										goto l230A16F0;
									}
									uint32 t0_364 = a4_355 >> (a0_233 >> 0x10);
									uint32 a3_367 = t0_364;
									uint32 t1_374 = t4_239 + t0_364;
									uint32 a4_376 = a7_349 >> 0x10 | (a4_355 & a0_233 >> 0x10) << 0x10;
									if (a4_376 < t1_374)
									{
										a4_376 += a0_233;
										a3_367 = t0_364 + -1;
										if (a4_376 >= a0_233 && a4_376 < t1_374)
										{
											a3_367 = t0_364 + -2;
											a4_376 += a0_233;
										}
									}
									uint32 a4_383 = a4_376 - t1_374;
									uint32 t1_385 = a4_383 >> (a0_233 >> 0x10);
									uint32 t4_391 = t4_239 + t1_385;
									uint32 a4_393 = (word32) (word16) a7_349 | (a4_383 & a0_233 >> 0x10) << 0x10;
									uint32 a5_394 = t1_385;
									if (a4_393 < t4_391)
									{
										a4_393 += a0_233;
										a5_394 = t1_385 + -1;
										if (a4_393 >= a0_233 && a4_393 < t4_391)
										{
											a5_394 = t1_385 + -2;
											a4_393 += a0_233;
										}
									}
									Eq_569695 a3_404 = a3_367 << 0x10 | a5_394;
									word32 a5_406 = (word32) (word16) a3_404;
									uint32 t3_419 = (a3_404 >> 0x10) + (a1_240 & 0xFFFF);
									uint32 t5_415 = a5_406 + (a1_240 & 0xFFFF);
									uint32 a4_418 = a4_393 - t4_391;
									uint32 t4_427 = (a1_240 >> 0x10) + (a3_404 >> 0x10);
									uint32 a5_431 = (t5_415 >> 0x10) + (((a1_240 >> 0x10) + a5_406) + t3_419);
									if (a5_431 < t3_419)
										t4_427 += 0x00010000;
									uint32 t1_443 = (a5_431 >> 0x10) + t4_427;
									Eq_569456 a7_444 = ((a5_431 & 0xFFFF) << 0x10) + (t5_415 & 0xFFFF);
									if (a4_418 >= t1_443)
									{
										if (a4_418 != t1_443)
											goto l230A18A8;
										a5_356 = a3_404;
										if (a7_444 == 0x00)
											goto l230A1514;
									}
									uint32 a4_452 = a0_233 + a4_418;
									a5_356 = (word32) a3_404.u1 - 1;
									if (a4_452 < a0_233)
									{
l230A1508:
										if (a4_452 != t1_443)
											goto l230A1510;
										goto l230A150C;
									}
									if (a4_452 < t1_443)
									{
l230A14F0:
										a5_356 = (word32) a3_404.u1 - 2;
										a4_452 += (word32) (a1_240 << 0x01 < a1_240) + a0_233;
										a1_240 <<= 0x01;
										goto l230A1508;
									}
									if (a4_452 == t1_443)
									{
										if (a1_240 >= a7_444)
										{
l230A150C:
											if (a1_240 == a7_444)
												goto l230A1514;
l230A1510:
											a5_356 |= 1;
											goto l230A1514;
										}
										goto l230A14F0;
									}
									a3_404 = (word32) a3_404.u1 - 1;
l230A18A8:
									a5_356 = a3_404;
									goto l230A1510;
								}
							}
							a3_217 += a1_240;
							a4_285 += (word32) (a3_217 < a1_240) + a0_233;
							s0_309 = s3_276 + -1;
							if ((a0_233 < a4_285 || a0_233 == a4_285 && a3_217 >= a1_240) && (a4_285 < t0_301 || t0_301 == a4_285 && a3_217 < a7_306))
							{
								a3_217 += a1_240;
								s0_309 = s3_276 + -2;
								a4_285 += (word32) (a3_217 < a1_240) + a0_233;
							}
							goto l230A13D8;
						}
						s0_105 = a2 >> 0x1D | s0_105 << 0x03 | 0x00800000;
						a5_104 = a2 << 0x03;
						a0_110 = a6_98 + -0x03FF;
					}
					else
					{
						if ((s0_105 | a2) == 0x00)
						{
							s0_105.u0 = 0;
							a5_104.u0 = 0;
							a0_110 = 0;
							a4_111 = 1;
							goto l230A1154;
						}
						Eq_2 a0_116;
						if (s0_105 != 0x00)
						{
							word32 a5_2011;
							word32 a4_2010;
							a0_116 = __clzsi2(s0_105, out a4_2010, out a5_2011);
						}
						else
						{
							word32 a4_2008;
							word32 a5_2009;
							a0_116 = (word32) __clzsi2(a2, out a4_2008, out a5_2009) + 32;
						}
						int32 a3_122 = (word32) a0_116 - 11;
						if (a3_122 <= 28)
						{
							word32 a5_129 = (word32) a0_116 - 8;
							s0_105 = a2 >> 29 - a3_122 | s0_105 << a5_129;
							a5_104 = a2 << a5_129;
						}
						else
						{
							s0_105 = a2 << (word32) a0_116 - 40;
							a5_104.u0 = 0;
						}
						a0_110 = -1011 - a0_116;
					}
					a4_111 = 0;
					goto l230A1154;
				}
			}
			else
			{
				s7_197.u0 = 0;
				s3_205.u0 = 0;
				s6_184 = 0x07FF;
				s8_159 = 2;
			}
l230A1084:
			s1_149 = 0;
			goto l230A1110;
		}
		s7_197 = a0 >> 0x1D | s7_197 << 0x03 | 0x00800000;
		s3_205 = a0 << 0x03;
		s6_184 = a6_37 + -0x03FF;
	}
	else
	{
		if ((s7_197 | a0) == 0x00)
		{
			s7_197.u0 = 0;
			s3_205.u0 = 0;
			s6_184 = 0;
			s8_159 = 1;
			goto l230A1084;
		}
		Eq_2 a0_48;
		if (s7_197 != 0x00)
		{
			word32 a4_2006;
			word32 a5_2007;
			a0_48 = __clzsi2(s7_197, out a4_2006, out a5_2007);
		}
		else
		{
			word32 a5_2005;
			word32 a4_2004;
			a0_48 = (word32) __clzsi2(a0, out a4_2004, out a5_2005) + 32;
		}
		int32 a3_54 = (word32) a0_48 - 11;
		if (a3_54 <= 28)
		{
			word32 s3_61 = (word32) a0_48 - 8;
			s7_197 = a0 >> 29 - a3_54 | s7_197 << s3_61;
			s3_205 = a0 << s3_61;
		}
		else
		{
			s7_197 = a0 << (word32) a0_48 - 40;
			s3_205.u0 = 0;
		}
		s6_184 = -1011 - a0_48;
	}
	s8_159 = 0;
	goto l230A1084;
}

