pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A18B0: Register Eq_2 __eqdf2(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out Eq_337969 a4Out, Register out Eq_2 a5Out)
// Called from:
//      print_number
//      ecvtbuf
//      flt
//      pow
Eq_2 __eqdf2(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, union Eq_337969 & a4Out, union Eq_2 & a5Out)
{
	__csrrs(frm, fp);
	Eq_337969 a4_11 = a1 >> 0x14 & 0x07FF;
	Eq_337969 a7_20 = a3 >> 0x14 & 0x07FF;
	if (a4_11 == 0x07FF)
	{
		if ((a1 & 0x000FFFFF | a0) != 0x00)
			goto l230A194C;
		if (a7_20 != a4_11)
			goto l230A1970;
	}
	else if (a7_20 != 0x07FF)
		goto l230A1908;
	if ((a3 & 0x000FFFFF | a2) == 0x00)
	{
l230A1908:
		if (a4_11 == a7_20 && ((a1 & 0x000FFFFF) == (a3 & 0x000FFFFF) && a2 == a0))
		{
			if (a1 >> 0x1F == a3 >> 0x1F)
			{
				a1Out.u0 = <invalid>;
				a4Out = a4_11;
				a5Out.u0 = <invalid>;
				return 0;
			}
			if (a4_11 == 0x00)
			{
				a1Out.u0 = <invalid>;
				a4Out = a4_11;
				a5Out.u0 = <invalid>;
				return (word32) ((a1 & 0x000FFFFF | a2) != 0x00);
			}
		}
		goto l230A1974;
	}
	if (a4_11 != 0x07FF || (a1 & 0x000FFFFF | a0) == 0x00)
		goto l230A1968;
l230A194C:
	a4_11 = (a1 & 0x000FFFFF) << 0x0C;
	if (a4_11 >= 0x00)
		goto l230A192C;
	a4_11.u0 = 0x07FF;
	if (a7_20 != 0x07FF || (a3 & 0x000FFFFF | a2) == 0x00)
	{
l230A1974:
		a1Out.u0 = <invalid>;
		a4Out = a4_11;
		a5Out.u0 = <invalid>;
		return 1;
	}
l230A1968:
	a4_11 = (a3 & 0x000FFFFF) << 0x0C;
	if (a4_11 < 0x00)
		goto l230A1970;
l230A192C:
	__csrrs(fflags, 0x10);
l230A1970:
	goto l230A1974;
}

// 230A1978: Register Eq_2 __gedf2(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out Eq_338101 a4Out, Register out Eq_338102 a5Out)
// Called from:
//      print_number
//      ecvtbuf
//      floor
//      __ieee754_pow
Eq_2 __gedf2(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, union Eq_338101 & a4Out, union Eq_338102 & a5Out)
{
	int32 a0_33;
	__csrrs(frm, fp);
	Eq_338101 a6_11 = a1 >> 0x14 & 0x07FF;
	Eq_2 a1_17 = a1 >> 0x1F;
	Eq_338101 a4_20 = a3 >> 0x14 & 0x07FF;
	if (a6_11 == 0x07FF)
	{
		if ((a1 & 0x000FFFFF | a0) != 0x00)
			goto l230A19BC;
		if (a4_20 != a6_11)
		{
l230A1A58:
			if (a4_20 != 0x00)
				goto l230A19F0;
			a0_33 = 0;
l230A19E4:
			if ((a3 & 0x000FFFFF | a2) == 0x00)
			{
				if (a0_33 != 0x00)
					goto l230A1A34;
				goto l230A19F8;
			}
l230A19EC:
			if (a0_33 != 0x00)
			{
				a1_17.u0 = -1;
				if (a3 >> 0x1F != 0x00)
					a1_17 = a3 >> 0x1F;
				goto l230A1A10;
			}
l230A19F0:
			if (a1 >> 0x1F == a3 >> 0x1F && a4_20 >= a6_11)
			{
				if (a6_11 < a4_20)
				{
l230A1A1C:
					if (a1 >> 0x1F == 0x00)
					{
l230A19FC:
						a1_17.u0 = -1;
						goto l230A1A10;
					}
					goto l230A1A10;
				}
				if ((a3 & 0x000FFFFF) >= (a1 & 0x000FFFFF))
				{
					if ((a1 & 0x000FFFFF) != (a3 & 0x000FFFFF))
					{
						if ((a1 & 0x000FFFFF) < (a3 & 0x000FFFFF))
							goto l230A1A1C;
						goto l230A1A34;
					}
					if (a2 >= a0)
					{
						if (a0 < a2)
							goto l230A1A1C;
l230A1A34:
						a1_17.u0 = 0;
l230A1A10:
						a1Out = a1_17;
						a4Out = a4_20;
						a5Out = a3 & 0x000FFFFF;
						return a1_17;
					}
				}
			}
l230A19F8:
			if (a1 >> 0x1F == 0x00)
			{
				a1_17.u0 = 1;
				goto l230A1A10;
			}
			goto l230A19FC;
		}
	}
	else if (a4_20 != 0x07FF)
		goto l230A19D4;
	if ((a3 & 0x000FFFFF | a2) != 0x00)
	{
l230A19BC:
		__csrrs(fflags, 0x10);
		a1_17.u0 = -2;
		goto l230A1A10;
	}
l230A19D4:
	if (a6_11 == 0x00)
	{
		a0_33 = (word32) ((a1 & 0x000FFFFF | a0) < 1);
		if (a4_20 != 0x00)
			goto l230A19EC;
		goto l230A19E4;
	}
	goto l230A1A58;
}

// 230A1A64: Register Eq_2 __ledf2(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_337990 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_2 a1Out, Register out Eq_337994 a4Out, Register out Eq_337995 a5Out, Register out Eq_337996 a7Out)
// Called from:
//      print_number
//      ecvtbuf
//      flt
//      pow
Eq_2 __ledf2(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_337990 a3, ptr32 fflags, ptr32 frm, union Eq_2 & a1Out, union Eq_337994 & a4Out, union Eq_337995 & a5Out, union Eq_337996 & a7Out)
{
	int32 a0_33;
	__csrrs(frm, fp);
	Eq_337994 a6_11 = a1 >> 0x14 & 0x07FF;
	Eq_2 a1_17 = a1 >> 0x1F;
	Eq_337994 a4_20 = a3 >> 0x14 & 0x07FF;
	if (a6_11 == 0x07FF)
	{
		if ((a1 & 0x000FFFFF | a0) != 0x00)
			goto l230A1AA8;
		if (a4_20 != a6_11)
		{
l230A1B44:
			if (a4_20 != 0x00)
				goto l230A1ADC;
			a0_33 = 0;
l230A1AD0:
			if ((a3 & 0x000FFFFF | a2) == 0x00)
			{
				if (a0_33 != 0x00)
					goto l230A1B20;
				goto l230A1AE4;
			}
l230A1AD8:
			if (a0_33 != 0x00)
			{
				a1_17.u0 = -1;
				if (a3 >> 0x1F != 0x00)
					a1_17 = a3 >> 0x1F;
				goto l230A1AFC;
			}
l230A1ADC:
			if (a1 >> 0x1F == a3 >> 0x1F && a4_20 >= a6_11)
			{
				if (a6_11 < a4_20)
				{
l230A1B08:
					if (a1 >> 0x1F == 0x00)
					{
l230A1AE8:
						a1_17.u0 = -1;
						goto l230A1AFC;
					}
					goto l230A1AFC;
				}
				if ((a3 & 0x000FFFFF) >= (a1 & 0x000FFFFF))
				{
					if ((a1 & 0x000FFFFF) != (a3 & 0x000FFFFF))
					{
						if ((a1 & 0x000FFFFF) < (a3 & 0x000FFFFF))
							goto l230A1B08;
						goto l230A1B20;
					}
					if (a2 >= a0)
					{
						if (a0 < a2)
							goto l230A1B08;
l230A1B20:
						a1_17.u0 = 0;
l230A1AFC:
						a1Out = a1_17;
						a4Out = a4_20;
						a5Out = a3 & 0x000FFFFF;
						a7Out = a1 & 0x000FFFFF;
						return a1_17;
					}
				}
			}
l230A1AE4:
			if (a1 >> 0x1F == 0x00)
			{
				a1_17.u0 = 1;
				goto l230A1AFC;
			}
			goto l230A1AE8;
		}
	}
	else if (a4_20 != 0x07FF)
		goto l230A1AC0;
	if ((a3 & 0x000FFFFF | a2) != 0x00)
	{
l230A1AA8:
		__csrrs(fflags, 0x10);
		a1_17.u0 = 2;
		goto l230A1AFC;
	}
l230A1AC0:
	if (a6_11 == 0x00)
	{
		a0_33 = (word32) ((a1 & 0x000FFFFF | a0) < 1);
		if (a4_20 != 0x00)
			goto l230A1AD8;
		goto l230A1AD0;
	}
	goto l230A1B44;
}

// 230A1B50: Register Eq_2 __muldf3(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_8789 s0Out, Register out (ptr32 Eq_8790) s1Out, Register out Eq_8791 a0Out, Register out Eq_8792 a1Out, Register out Eq_8793 a3Out, Register out Eq_8794 s2Out, Register out Eq_8795 s3Out, Register out (ptr32 Eq_8796) s4Out, Register out (ptr32 Eq_8797) s5Out, Register out (ptr32 Eq_8798) s6Out, Register out (ptr32 Eq_8799) s7Out, Register out Eq_8800 s8Out, Register out Eq_8801 s9Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      pa_input
//      pa_adapt
//      rf_pri_rccal_iq
//      rf_set_channel
//      phyif_utils_decode
//      tcpip_stack_input
//      parse_value
//      ecvtbuf
//      ADC_Parse_Result
//      __ieee754_pow
//      __ieee754_sqrt
//      scalbn
//      __floatundisf
Eq_2 __muldf3(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_8789 & s0Out, struct Eq_8790 & s1Out, union Eq_8791 & a0Out, union Eq_8792 & a1Out, union Eq_8793 & a3Out, union Eq_8794 & s2Out, union Eq_8795 & s3Out, union Eq_8796 & s4Out, struct Eq_8797 & s5Out, struct Eq_8798 & s6Out, struct Eq_8799 & s7Out, union Eq_8800 & s8Out, union Eq_8801 & s9Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	int32 s1_149;
	Eq_2 s4_197;
	int32 s7_168;
	int32 s8_159;
	Eq_2 s2_33 = __csrrs(frm, fp + -48);
	int32 s7_37 = a1 >> 0x14 & 0x07FF;
	Eq_2 s3_253 = (word32) (word20) a1;
	if (s7_37 != 0x00)
	{
		if (s7_37 == 0x07FF)
		{
			if ((s3_253 | a0) != 0x00)
			{
				s4_197 = a0;
				s7_168 = 0x07FF;
				s8_159 = 3;
				s1_149 = 16;
				if (s3_253 << 0x0C >= 0x00)
				{
l230A1C5C:
					int32 a0_110;
					int32 a4_111;
					int32 a0_98 = a3 >> 0x14 & 0x07FF;
					Eq_2 a5_104 = a2;
					Eq_2 s0_105 = (word32) (word20) a3;
					if (a0_98 != 0x00)
					{
						if (a0_98 == 0x07FF)
						{
							if ((s0_105 | a2) != 0x00)
							{
								a0_110 = 0x07FF;
								if (s0_105 << 0x0C >= 0x00)
								{
									a4_111 = 3;
									s1_149 = 16;
								}
								else
									a4_111 = 3;
							}
							else
							{
								s0_105.u0 = 0;
								a5_104.u0 = 0;
								a0_110 = 0x07FF;
								a4_111 = 2;
							}
l230A1CA0:
							int32 a0_176 = s7_168 + a0_110;
							Eq_570475 a3_166 = s8_159 << 0x02 | a4_111;
							ui32 a6_192 = a1 >> 0x1F ^ a3 >> 0x1F;
							int32 a7_193 = a0_176 + 1;
							if (a3_166 <= -0x0F)
							{
								<anonymous> * a3_796 = g_a230CB434[((word32) a3_166.u1 - 1) * 0x04] + 0x230CB434;
								Eq_8789 s0_819;
								struct Eq_8798 * s6_820;
								Eq_8801 s9_821;
								Eq_2 ra_822;
								struct Eq_8790 * s1_823;
								Eq_8794 s2_824;
								Eq_8795 s3_825;
								union Eq_8796 * s4_826;
								struct Eq_8797 * s5_827;
								struct Eq_8799 * s7_828;
								Eq_8800 s8_829;
								Eq_8791 a0_830;
								Eq_8793 a3_832;
								ptr32 frm_833;
								Eq_8792 a1_834;
								ptr32 fflags_846;
								a3_796();
								s0Out = s0_819;
								s1Out = s1_823;
								a0Out = a0_830;
								a1Out = a1_834;
								a3Out = a3_832;
								s2Out = s2_824;
								s3Out = s3_825;
								s4Out = s4_826;
								s5Out = s5_827;
								s6Out = s6_820;
								s7Out = s7_828;
								s8Out = s8_829;
								s9Out = s9_821;
								fflagsOut = fflags_846;
								frmOut = frm_833;
								return ra_822;
							}
							ui32 t5_210 = a5_104 & 0xFFFF;
							uint32 a4_204 = s4_197 >> 0x10;
							ui32 s4_209 = s4_197 & 0xFFFF;
							uint32 a3_208 = a5_104 >> 0x10;
							uint32 t4_213 = a4_204 + t5_210;
							uint32 a5_212 = t5_210 + s4_209;
							uint32 a2_216 = (a5_212 >> 0x10) + ((a3_208 + s4_209) + t4_213);
							uint32 t3_217 = a4_204 + a3_208;
							if (a2_216 < t4_213)
								t3_217 += 0x00010000;
							ui32 t6_230 = s0_105 & 0xFFFF;
							uint32 t4_229 = s0_105 >> 0x10;
							uint32 a5_236 = a4_204 + t6_230;
							uint32 a1_234 = s4_209 + t6_230;
							ui32 a2_232 = ((a2_216 & 0xFFFF) << 0x10) + (a5_212 & 0xFFFF);
							uint32 s4_240 = (a1_234 >> 0x10) + ((t4_229 + s4_209) + a5_236);
							uint32 a4_241 = a4_204 + t4_229;
							if (s4_240 < a5_236)
								a4_241 += 0x00010000;
							uint32 s0_260 = s3_253 >> 0x10;
							ui32 s3_261 = s3_253 & 0xFFFF;
							uint32 s4_269 = ((s4_240 & 0xFFFF) << 0x10) + (a1_234 & 0xFFFF);
							uint32 a4_272 = s0_260 + t5_210;
							uint32 t2_267 = t5_210 + s3_261;
							uint32 t1_248 = (s4_240 >> 0x10) + a4_241;
							uint32 t0_271 = (a2_216 >> 0x10) + s4_269;
							uint32 t5_275 = a3_208 + s0_260;
							uint32 a3_279 = (t2_267 >> 0x10) + ((a3_208 + s3_261) + a4_272);
							if (a3_279 < a4_272)
								t5_275 += 0x00010000;
							uint32 a5_294 = s0_260 + t6_230;
							uint32 t2_297 = s3_261 + t6_230;
							uint32 t5_285 = (a3_279 >> 0x10) + t5_275;
							uint32 a3_295 = ((a3_279 & 0xFFFF) << 0x10) + (t2_267 & 0xFFFF);
							uint32 a1_301 = t4_229 + s0_260;
							uint32 s3_304 = (t2_297 >> 0x10) + ((t4_229 + s3_261) + a5_294);
							if (s3_304 < a5_294)
								a1_301 += 0x00010000;
							uint32 t3_319 = t3_217 + t0_271;
							uint32 s4_323 = (word32) (t3_319 < s4_269);
							uint32 a4_326 = ((s3_304 & 0xFFFF) << 0x10) + (t2_297 & 0xFFFF) + t1_248;
							uint32 t3_329 = t3_319 + a3_295;
							uint32 s0_327 = a4_326 + s4_323;
							uint32 a3_330 = (word32) (t3_329 < a3_295);
							uint32 t4_332 = s0_327 + t5_285;
							uint32 t6_333 = t4_332 + a3_330;
							Eq_8793 a3_1279 = (word32) (t4_332 < t5_285) | (word32) (t6_333 < a3_330);
							uint32 s0_347 = (word32) a3_1279 + (((word32) (a4_326 < t1_248) | (word32) (s0_327 < s4_323)) + (s3_304 >> 0x10)) + a1_301 << 0x09 | t6_333 >> 0x17;
							Eq_570709 a5_358 = (word32) ((t3_329 << 0x09 | a2_232) != 0x00) | t3_329 >> 0x17 | t6_333 << 0x09;
							if (s0_347 << 0x07 < 0x00)
							{
								a5_358 = a5_358 >> 0x01 | a5_358 & 1 | s0_347 << 0x1F;
								s0_347 >>= 0x01;
							}
							else
								a7_193 = a0_176;
							Eq_8791 a5_442;
							int32 a4_376;
							Eq_8791 s0_468;
							int32 a1_375 = a7_193 + 0x03FF;
							if (a1_375 > 0x00)
							{
								if ((a5_358 & 7) == 0x00)
								{
l230A2088:
									if (s0_347 << 0x07 < 0x00)
									{
										s0_347 &= ~0x01000000;
										a1_375 = a7_193 + 0x0400;
									}
									if (a1_375 <= 0x07FE)
									{
										a5_442 = s0_347 << 0x1D | a5_358 >> 0x03;
										s0_468 = s0_347 >> 0x03;
										a4_376 = a1_375;
										goto l230A1DD0;
									}
									if (s2_33 != 2)
									{
										if (s2_33 != 3)
										{
											if (s2_33 != 0x00)
											{
l230A20D4:
												a5_442.u0 = -1;
												a4_376 = 0x07FE;
l230A20DC:
												s1_149 |= 5;
												s0_468 = a5_442;
												goto l230A1DD0;
											}
										}
										else if (a6_192 != 0x00)
											goto l230A20D4;
									}
									else if (a6_192 == 0x00)
										goto l230A20D4;
									a5_442.u0 = 0;
									a4_376 = 0x07FF;
									goto l230A20DC;
								}
								else
								{
									Eq_570709 a4_550;
									s1_149 |= 1;
									if (s2_33 != 2)
									{
										if (s2_33 != 3)
										{
											if (s2_33 != 0x00)
												goto l230A2088;
											a3_1279.u0 = 4;
											if ((a5_358 & 0x0F) != 4)
											{
												a4_550 = (word32) a5_358.u1 + 4;
												goto l230A2024;
											}
											goto l230A2088;
										}
										if (a6_192 != 0x00)
											goto l230A2088;
									}
									else if (a6_192 == 0x00)
										goto l230A2088;
									a4_550 = (word32) a5_358.u1 + 8;
l230A2024:
									s0_347 += (word32) (a4_550 < a5_358);
									a5_358 = a4_550;
									goto l230A2088;
								}
							}
							a4_376 = 1;
							if (a1_375 != 0x00)
							{
l230A2170:
								a3_1279 = 1 - a1_375;
								if (a3_1279 <= 56)
								{
									uint32 a5_487;
									Eq_570855 s0_488;
									if (a3_1279 <= 31)
									{
										int32 a7_489 = a7_193 + 0x041E;
										a5_487 = s0_347 << a7_489 | a5_358 >> a3_1279 | (word32) (a5_358 << a7_489 != 0x00);
										s0_488 = s0_347 >> a3_1279;
									}
									else
									{
										uint32 a2_474 = s0_347 >> -31 - a1_375;
										int32 a1_475 = 0;
										if (a3_1279 != 32)
											a1_475 = s0_347 << a7_193 + 0x043E;
										a5_487 = a2_474 | (word32) ((a1_475 | a5_358) != 0x00);
										s0_488.u0 = 0;
									}
									if ((a5_487 & 7) == 0x00)
									{
l230A222C:
										a3_1279 = s0_488 << 0x08;
										if (a3_1279 < 0x00)
										{
											s1_149 |= 1;
											s0_468.u0 = 0;
											a5_442.u0 = 0;
											if (a4_376 == 0x00)
											{
												a4_376 = 1;
												goto l230A1DD0;
											}
											goto l230A226C;
										}
										a3_1279 = a5_487 >> 0x03;
										a5_442 = s0_488 << 0x1D | a3_1279;
										s0_468 = s0_488 >> 0x03;
										if (a4_376 == 0x00)
											goto l230A1DD0;
										a4_376 = s1_149 & 1;
										if (a4_376 != 0x00)
										{
											a4_376 = 0;
l230A226C:
											s1_149 |= 2;
											goto l230A1DD0;
										}
l230A1DD0:
										Eq_8792 a1_634 = (word32) (word20) s0_468 | (a4_376 & 0x07FF) << 0x14 | a6_192 << 0x1F;
										if (s1_149 != 0x00)
											__csrrs(fflags, ra);
										s0Out = s0;
										s1Out = s1;
										a0Out = a5_442;
										a1Out = a1_634;
										a3Out = a3_1279;
										s2Out = s2;
										s3Out = s3;
										s4Out = s4;
										s5Out = s5;
										s6Out = s6;
										s7Out = s7;
										s8Out = s8;
										s9Out = s9;
										fflagsOut = fflags;
										frmOut = frm;
										return ra;
									}
									uint32 a3_509;
									s1_149 |= 1;
									if (s2_33 != 2)
									{
										if (s2_33 != 3)
										{
											if (s2_33 != 0x00 || (a5_487 & 0x0F) == 4)
												goto l230A222C;
											a3_509 = a5_487 + 4;
l230A21D8:
											s0_488 = (word32) s0_488 + (word32) (a3_509 < a5_487);
											a5_487 = a3_509;
											goto l230A222C;
										}
										if (a6_192 != 0x00)
											goto l230A222C;
									}
									else if (a6_192 == 0x00)
										goto l230A222C;
									a3_509 = a5_487 + 8;
									goto l230A21D8;
								}
								a5_442 = a5_358 | s0_347;
								if (a5_442 == 0x00)
								{
l230A22AC:
									s1_149 |= 2;
									s0_468.u0 = 0;
									a4_376 = 0;
									goto l230A1DD0;
								}
								Eq_570968 a5_453;
								s1_149 |= 1;
								if (s2_33 != 2)
								{
									if (s2_33 != 3)
									{
										a5_453.u0 = 5;
										if (s2_33 == 0x00)
											goto l230A22A8;
									}
									else
									{
										a5_453.u0 = 9;
										if (a6_192 == 0x00)
											goto l230A22A8;
									}
								}
								else
								{
									a5_453.u0 = 9;
									if (a6_192 != 0x00)
										goto l230A22A8;
								}
								a5_453.u0 = 1;
l230A22A8:
								a5_442 = a5_453 >> 0x03;
								goto l230A22AC;
							}
							uint32 a4_380 = s0_347;
							if ((a5_358 & 7) == 0x00)
							{
l230A2164:
								a4_376 = (a4_380 >> 0x18 ^ 1) & 1;
								goto l230A2170;
							}
							word32 a4_416;
							s1_149 |= 1;
							if (s2_33 != 2)
							{
								if (s2_33 != 3)
								{
									a4_380 = s0_347;
									if (s2_33 != 0x00 || (a5_358 & 0x0F) == 4)
										goto l230A2164;
									a4_416 = (word32) (a5_358 < -4);
l230A2140:
									a4_380 = (a4_416 ^ 1) + s0_347;
									goto l230A2164;
								}
								a4_380 = s0_347;
								if (a6_192 != 0x00)
									goto l230A2164;
							}
							else
							{
								a4_380 = s0_347;
								if (a6_192 == 0x00)
									goto l230A2164;
							}
							a4_416 = (word32) (a5_358 < -8);
							goto l230A2140;
						}
						s0_105 = a2 >> 0x1D | s0_105 << 0x03 | 0x00800000;
						a0_110 = a0_98 + -0x03FF;
						a5_104 = a2 << 0x03;
					}
					else
					{
						if ((s0_105 | a2) == 0x00)
						{
							s0_105.u0 = 0;
							a5_104.u0 = 0;
							a0_110 = 0;
							a4_111 = 1;
							goto l230A1CA0;
						}
						Eq_2 a0_116;
						if (s0_105 != 0x00)
						{
							word32 a5_1547;
							word32 a4_1546;
							a0_116 = __clzsi2(s0_105, out a4_1546, out a5_1547);
						}
						else
						{
							word32 a4_1544;
							word32 a5_1545;
							a0_116 = (word32) __clzsi2(a2, out a4_1544, out a5_1545) + 32;
						}
						int32 a3_122 = (word32) a0_116 - 11;
						if (a3_122 <= 28)
						{
							word32 a5_129 = (word32) a0_116 - 8;
							s0_105 = a2 >> 29 - a3_122 | s0_105 << a5_129;
							a5_104 = a2 << a5_129;
						}
						else
						{
							s0_105 = a2 << (word32) a0_116 - 40;
							a5_104.u0 = 0;
						}
						a0_110 = -1011 - a0_116;
					}
					a4_111 = 0;
					goto l230A1CA0;
				}
			}
			else
			{
				s3_253.u0 = 0;
				s4_197.u0 = 0;
				s7_168 = 0x07FF;
				s8_159 = 2;
			}
l230A1BD0:
			s1_149 = 0;
			goto l230A1C5C;
		}
		s3_253 = a0 >> 0x1D | s3_253 << 0x03 | 0x00800000;
		s4_197 = a0 << 0x03;
		s7_168 = s7_37 + -0x03FF;
	}
	else
	{
		if ((s3_253 | a0) == 0x00)
		{
			s3_253.u0 = 0;
			s4_197.u0 = 0;
			s7_168 = 0;
			s8_159 = 1;
			goto l230A1BD0;
		}
		Eq_2 a0_48;
		if (s3_253 != 0x00)
		{
			word32 a5_1543;
			word32 a4_1542;
			a0_48 = __clzsi2(s3_253, out a4_1542, out a5_1543);
		}
		else
		{
			word32 a5_1541;
			word32 a4_1540;
			a0_48 = (word32) __clzsi2(a0, out a4_1540, out a5_1541) + 32;
		}
		int32 a4_54 = (word32) a0_48 - 11;
		if (a4_54 <= 28)
		{
			word32 s4_61 = (word32) a0_48 - 8;
			s3_253 = a0 >> 29 - a4_54 | s3_253 << s4_61;
			s4_197 = a0 << s4_61;
		}
		else
		{
			s3_253 = a0 << (word32) a0_48 - 40;
			s4_197.u0 = 0;
		}
		s7_168 = -1011 - a0_48;
	}
	s8_159 = 0;
	goto l230A1BD0;
}

