pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A22EC: Register Eq_2 __subdf3(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out Eq_338006 a1Out)
// Called from:
//      print_number
//      parse_value
//      modf
//      __ieee754_pow
//      __ieee754_sqrt
//      rint
Eq_2 __subdf3(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 fflags, ptr32 frm, union Eq_338006 & a1Out)
{
	Eq_2 s3_17 = __csrrs(frm, fp + -32);
	Eq_2 a5_136 = a2 >> 0x1D | (a3 & 0x000FFFFF) << 0x03;
	Eq_571023 a6_210 = a3 >> 0x14 & 0x07FF;
	Eq_571023 s1_291 = a1 >> 0x14 & 0x07FF;
	Eq_571023 s2_104 = a1 >> 0x1F;
	Eq_2 t3_111 = a0 >> 0x1D | (a1 & 0x000FFFFF) << 0x03;
	Eq_2 a7_100 = a0 << 0x03;
	Eq_571023 a3_39 = a3 >> 0x1F;
	Eq_2 t1_193 = a2 << 0x03;
	if (a6_210 != 0x07FF || (a5_136 | a2 << 0x03) == 0x00)
		a3_39 = a3 >> 0x1F ^ 1;
	Eq_571023 a4_130 = s1_291 - a6_210;
	if (a3_39 == a1 >> 0x1F)
	{
		if (a4_130 > 0x00)
		{
			Eq_571023 a3_495;
			if (a6_210 == 0x00)
			{
				if ((a5_136 | a2 << 0x03) == 0x00)
					goto l230A2380;
				a3_495 = (word32) a4_130 - 1;
				if (a4_130 == ~0x00)
				{
					t1_193 = (a2 << 0x03) + (a0 << 0x03);
					a5_136 = t3_111 + a5_136 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
					goto l230A23AC;
				}
				if (a4_130 == 0x07FF)
				{
l230A23BC:
					a5_136 = t3_111 | a0 << 0x03;
					if (a5_136 != 0x00)
					{
						if (t3_111 << 0x09 < 0x00)
						{
l230A2388:
							a5_136 = t3_111;
							goto l230A238C;
						}
						a5_136 = t3_111;
l230A23D0:
						s1_291.u0 = 16;
						goto l230A2640;
					}
					a7_100.u0 = 0;
l230A2D38:
					s1_291.u0 = 0;
					goto l230A2B20;
				}
l230A2404:
				Eq_571731 a3_530;
				ui32 t1_515;
				if (a3_495 <= 56)
				{
					if (a3_495 <= 31)
					{
						int32 a2_532 = 32 - a3_495;
						t1_515 = a5_136 << a2_532 | (a2 << 0x03) >> a3_495 | (word32) ((a2 << 0x03) << a2_532 != 0x00);
						a3_530 = a5_136 >> a3_495;
						goto l230A2438;
					}
					uint32 a4_519 = a5_136 >> (word32) a3_495 - 32;
					int32 a2_520 = 0;
					if (a3_495 != 32)
						a2_520 = a5_136 << 64 - a3_495;
					t1_515 = a4_519 | (word32) ((a2_520 | a2 << 0x03) != 0x00);
				}
				else
					t1_515 = (word32) ((a5_136 | a2 << 0x03) != 0x00);
				a3_530.u0 = 0;
l230A2438:
				t1_193 = t1_515 + (a0 << 0x03);
				a5_136 = a3_530 + t3_111 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
				a4_130 = s1_291;
				goto l230A244C;
			}
			if (s1_291 != 0x07FF)
			{
				a5_136 |= 0x00800000;
				a3_495 = a4_130;
				goto l230A2404;
			}
l230A23E0:
			a5_136 = t3_111 | a0 << 0x03;
			if (a5_136 != 0x00)
			{
				if (t3_111 << 0x09 >= 0x00)
				{
					a5_136 = t3_111;
					goto l230A2594;
				}
				a5_136 = t3_111;
l230A2D4C:
				a4_130.u0 = 0x07FF;
				goto l230A26E0;
			}
			a7_100.u0 = 0;
			goto l230A2D18;
		}
		if (a4_130 != 0x00)
		{
			Eq_571023 s0_420;
			a4_130 = a6_210 - s1_291;
			if (s1_291 == 0x00)
			{
				if ((t3_111 | a0 << 0x03) == 0x00)
				{
					if (a4_130 != 0x07FF)
					{
l230A28A0:
						if (a4_130 != 0x00)
						{
							a7_100 = t1_193;
							goto l230A26E0;
						}
						goto l230A28A4;
					}
					goto l230A24E4;
				}
				s0_420 = (word32) a4_130 - 1;
				if (a4_130 == ~0x00)
				{
					Eq_2 a7_479 = (a0 << 0x03) + (a2 << 0x03);
					a5_136 = t3_111 + a5_136 + CONVERT(a7_479 <u a2 << 0x03, bool, word32);
					t1_193 = a7_479;
l230A23AC:
					a4_130.u0 = 1;
					goto l230A244C;
				}
				if (a4_130 == 0x07FF)
				{
l230A24E4:
					a7_100 = a5_136 | a2 << 0x03;
					if (a7_100 == 0x00)
					{
						a5_136.u0 = 0;
						goto l230A2B20;
					}
					a7_100 = a2 << 0x03;
					a6_210.u0 = 0;
					if (a5_136 << 0x09 >= 0x00)
						goto l230A23D0;
					goto l230A2640;
				}
			}
			else
			{
				if (a6_210 == 0x07FF)
				{
					a7_100 = a5_136 | a2 << 0x03;
					if (a7_100 != 0x00)
					{
						a7_100 = a2 << 0x03;
						if (a5_136 << 0x09 >= 0x00)
						{
l230A2594:
							goto l230A2598;
						}
						goto l230A2D4C;
					}
					a5_136.u0 = 0;
l230A2D18:
					a4_130.u0 = 0x07FF;
					goto l230A2D38;
				}
				t3_111 |= 0x00800000;
				s0_420 = a4_130;
			}
			Eq_571903 s0_448;
			ui32 a7_433;
			if (s0_420 <= 56)
			{
				if (s0_420 <= 31)
				{
					int32 a0_450 = 32 - s0_420;
					a7_433 = t3_111 << a0_450 | (a0 << 0x03) >> s0_420 | (word32) ((a0 << 0x03) << a0_450 != 0x00);
					s0_448 = t3_111 >> s0_420;
					goto l230A255C;
				}
				uint32 a4_437 = t3_111 >> (word32) s0_420 - 32;
				int32 a0_438 = 0;
				if (s0_420 != 32)
					a0_438 = t3_111 << 64 - s0_420;
				a7_433 = a4_437 | (word32) ((a0_438 | a0 << 0x03) != 0x00);
			}
			else
				a7_433 = (word32) ((t3_111 | a0 << 0x03) != 0x00);
			s0_448.u0 = 0;
l230A255C:
			Eq_2 a7_464 = a7_433 + (a2 << 0x03);
			a5_136 = s0_448 + a5_136 + CONVERT(a7_464 <u a2 << 0x03, bool, word32);
			t1_193 = a7_464;
			a4_130 = a6_210;
l230A244C:
			if (a5_136 << 0x08 < 0x00)
			{
				a4_130 = (word32) a4_130.u0 + 1;
				if (a4_130 != 0x07FF)
				{
					uint32 a3_695 = a5_136 & ~0x00800000;
					a7_100 = a3_695 << 0x1F | (t1_193 >> 0x01 | t1_193 & 1);
					a5_136 = a3_695 >> 0x01;
					goto l230A26E0;
				}
				if (s3_17 != 0x00)
				{
					if (s3_17 == 3)
					{
						if (a1 >> 0x1F == 0x00)
							goto l230A2768;
l230A2D20:
						goto l230A271C;
					}
					if (s3_17 != 2)
						goto l230A2D20;
					if (a1 >> 0x1F == 0x00)
					{
l230A271C:
						a4_130.u0 = 0x07FE;
						a6_210.u0 = 0;
						a5_136.u0 = -1;
						a7_100.u0 = -1;
						s1_291.u0 = 5;
l230A2720:
						Eq_2 a3_808;
						s1_291 |= 1;
						if (s3_17 != 2)
						{
							if (s3_17 != 3)
							{
								if (s3_17 != 0x00 || (a7_100 & 0x0F) == 4)
									goto l230A2DC0;
								a3_808 = (byte) a7_100.u0 + 4;
l230A2748:
								a5_136 = (word32) a5_136 + (word32) (a3_808 < a7_100);
								a7_100 = a3_808;
l230A2DC0:
								if (a6_210 != 0x00)
								{
l230A2654:
									s1_291 |= 2;
									goto l230A2B20;
								}
								goto l230A2B20;
							}
							if (s2_104 != 0x00)
								goto l230A2DC0;
						}
						else if (s2_104 == 0x00)
							goto l230A2DC0;
						a3_808 = (byte) a7_100.u0 + 8;
						goto l230A2748;
					}
				}
				goto l230A2768;
			}
			goto l230A28A0;
		}
		a4_130 = (word32) s1_291.u0 + 1;
		if (((word32) s1_291.u0 + 1 & 0x07FE) != 0x00)
		{
			if (s1_291 == -0x07FE)
			{
				if (s3_17 != 0x00)
				{
					if (s3_17 == 3)
					{
						if (a1 >> 0x1F != 0x00)
							goto l230A270C;
					}
					else if (s3_17 != 2 || a1 >> 0x1F == 0x00)
						goto l230A270C;
				}
				a4_130.u0 = 0x07FF;
l230A2768:
				a5_136.u0 = 0;
				a7_100.u0 = 0;
				s1_291.u0 = 5;
l230A2B20:
				if (a5_136 << 0x08 >= 0x00)
				{
l230A2B40:
					Eq_2 a7_917 = a5_136 << 0x1D | a7_100 >> 0x03;
					Eq_571342 a5_919 = a5_136 >> 0x03;
					if (a4_130 == 0x07FF)
					{
						a7_917 |= a5_919;
						a5_919.u0 = 0;
						if (a7_917 != 0x00)
						{
							a5_919.u0 = 0x00080000;
							a7_917.u0 = 0;
							s2_104.u0 = 0;
						}
					}
					Eq_338006 a1_942 = (word32) (word20) a5_919 | (a4_130 & 0x07FF) << 0x14 | s2_104 << 0x1F;
					if (s1_291 != 0x00)
						__csrrs(fflags, ra);
					a1Out = a1_942;
					return a7_917;
				}
				a4_130 = (word32) a4_130.u0 + 1;
				if (a4_130 != 0x07FF)
				{
					a5_136 &= ~0x00800000;
					goto l230A2B40;
				}
				a7_100.u0 = 0;
				if (s3_17 != 0x00)
				{
					if (s3_17 == 3)
					{
						if (s2_104 == 0x00)
							goto l230A2DF4;
					}
					else if (s3_17 == 2 && s2_104 != 0x00)
						goto l230A2DF4;
					a7_100.u0 = -1;
					a4_130.u0 = 0x07FE;
				}
l230A2DF4:
				s1_291 |= 5;
				a5_136 = a7_100;
				goto l230A2B40;
			}
			uint32 t1_359 = (a0 << 0x03) + (a2 << 0x03);
			word32 t3_362 = t3_111 + a5_136 + CONVERT(t1_359 <u a0 << 0x03, bool, word32);
			a7_100 = t3_362 << 0x1F | t1_359 >> 0x01;
			a5_136 = t3_362 >> 0x01;
l230A26E0:
			a6_210.u0 = 0;
l230A238C:
			s1_291.u0 = 0;
			goto l230A2640;
		}
		ui32 a3_367 = t3_111 | a0 << 0x03;
		if (s1_291 == 0x00)
		{
			if (a3_367 != 0x00)
			{
				if ((a5_136 | a2 << 0x03) == 0x00)
					goto l230A29F4;
				t1_193 = (a0 << 0x03) + (a2 << 0x03);
				t3_111 = t3_111 + a5_136 + CONVERT(t1_193 <u a0 << 0x03, bool, word32);
				if (t3_111 << 0x08 < 0x00)
				{
					a5_136 = t3_111 & ~0x00800000;
					a7_100 = t1_193;
					a6_210.u0 = 0;
					a4_130.u0 = 1;
					goto l230A2640;
				}
l230A28A8:
				a7_100 = t1_193;
l230A29F4:
				a5_136 = a7_100 | t3_111;
				if (a5_136 == 0x00)
				{
					a7_100.u0 = 0;
					a4_130.u0 = 0;
					goto l230A2D38;
				}
				uint32 a6_592 = (t3_111 << 0x01) + (a7_100 >> 0x1F);
				Eq_571261 a5_593 = a7_100 << 0x01;
				s1_291.u0 = 0;
				if ((a5_593 & 7) != 0x00)
				{
					if (s3_17 != 2)
					{
						if (s3_17 != 3)
						{
							s1_291.u0 = 1;
							if (s3_17 == 0x00 && (a5_593 & 0x0F) != 4)
								a6_592 += (word32) (a5_593 < -4) ^ 1;
						}
						else
						{
							s1_291 = s2_104;
							if (s2_104 == 0x00)
							{
								a6_592 += (word32) (a5_593 < -8) ^ 1;
								s1_291.u0 = 1;
							}
						}
					}
					else
					{
						s1_291.u0 = 1;
						if (s2_104 != 0x00)
						{
							a6_592 += (word32) (a5_593 < -8) ^ 1;
							s1_291 = s2_104;
						}
					}
				}
				a6_210 = (a6_592 >> 0x18 ^ 1) & 1;
				a5_136 = t3_111;
				a4_130.u0 = 0;
				goto l230A2640;
			}
l230A28A4:
			t3_111 = a5_136;
			goto l230A28A8;
		}
		if (s1_291 == 0x07FF)
		{
			if (a3_367 != 0x00)
			{
				s1_291 = (word32) ((t3_111 & 0x00400000) < 1) << 0x04;
				if (a6_210 != 0x07FF)
					goto l230A26A0;
			}
			else
			{
				if (a6_210 != s1_291)
				{
					a7_100 = a2 << 0x03;
					goto l230A2D4C;
				}
				s1_291.u0 = 0;
			}
		}
		else
		{
			s1_291.u0 = 0;
			if (a6_210 != 0x07FF)
				goto l230A269C;
		}
		if ((a5_136 | a2 << 0x03) == 0x00)
		{
			if (a3_367 != 0x00)
			{
l230A26A8:
				a5_136 = t3_111;
				goto l230A2AF8;
			}
			goto l230A2E10;
		}
		if (a5_136 << 0x09 >= 0x00)
			s1_291.u0 = 16;
l230A269C:
		if (a3_367 != 0x00)
		{
l230A26A0:
			if ((a5_136 | a2 << 0x03) == 0x00)
				goto l230A26A8;
l230A2B10:
			s2_104.u0 = 0;
			a5_136.u0 = 0x00400000;
			a7_100.u0 = 0;
			a4_130.u0 = 0x07FF;
			goto l230A2B20;
		}
l230A2E10:
		a7_100 = a2 << 0x03;
		goto l230A2AF8;
	}
	Eq_2 s4_289;
	Eq_2 s0_286;
	if (a4_130 > 0x00)
	{
		Eq_571023 a3_222;
		if (a6_210 == 0x00)
		{
			if ((a5_136 | a2 << 0x03) == 0x00)
			{
l230A2380:
				if (a4_130 != 0x07FF)
					goto l230A2388;
				goto l230A23BC;
			}
			a3_222 = (word32) a4_130 - 1;
			if (a4_130 == ~0x00)
			{
				t1_193 = (a0 << 0x03) - (a2 << 0x03);
				a5_136 = t3_111 - a5_136 - (word32) (a0 << 0x03 < t1_193);
				goto l230A27B0;
			}
			if (a4_130 == 0x07FF)
				goto l230A23BC;
		}
		else
		{
			if (s1_291 == 0x07FF)
				goto l230A23E0;
			a5_136 |= 0x00800000;
			a3_222 = a4_130;
		}
		Eq_571143 a3_246;
		ui32 t1_231;
		if (a3_222 <= 56)
		{
			if (a3_222 <= 31)
			{
				int32 a2_248 = 32 - a3_222;
				t1_231 = a5_136 << a2_248 | (a2 << 0x03) >> a3_222 | (word32) ((a2 << 0x03) << a2_248 != 0x00);
				a3_246 = a5_136 >> a3_222;
				goto l230A27F4;
			}
			uint32 a4_235 = a5_136 >> (word32) a3_222 - 32;
			int32 a2_236 = 0;
			if (a3_222 != 32)
				a2_236 = a5_136 << 64 - a3_222;
			t1_231 = a4_235 | (word32) ((a2_236 | a2 << 0x03) != 0x00);
		}
		else
			t1_231 = (word32) ((a5_136 | a2 << 0x03) != 0x00);
		a3_246.u0 = 0;
l230A27F4:
		t1_193 = (a0 << 0x03) - t1_231;
		a5_136 = t3_111 - a3_246 - (word32) (a0 << 0x03 < t1_193);
		a4_130 = s1_291;
		goto l230A2808;
	}
	if (a4_130 != 0x00)
	{
		Eq_571023 s0_134;
		a4_130 = a6_210 - s1_291;
		if (s1_291 == 0x00)
		{
			if ((t3_111 | a0 << 0x03) == 0x00)
			{
				s2_104 = a3_39;
				if (a4_130 != 0x07FF)
					goto l230A28A0;
				goto l230A24E4;
			}
			s0_134 = (word32) a4_130.u0 - 1;
			if (a4_130 == ~0x00)
			{
				Eq_2 a7_211 = (a2 << 0x03) - (a0 << 0x03);
				a5_136 = a5_136 - t3_111 - (word32) (a2 << 0x03 < a7_211);
				s2_104 = a3_39;
				t1_193 = a7_211;
l230A27B0:
				a4_130.u0 = 1;
				goto l230A2808;
			}
			if (a4_130 == 0x07FF)
			{
				a7_100 = a5_136 | a2 << 0x03;
				if (a7_100 == 0x00)
				{
					a5_136.u0 = 0;
					s2_104 = a3_39;
					goto l230A2B20;
				}
				a7_100 = a2 << 0x03;
				s2_104 = a3_39;
				a6_210.u0 = 0;
				if (a5_136 << 0x09 >= 0x00)
					goto l230A23D0;
l230A2640:
				if ((a7_100 & 7) == 0x00)
				{
					if (a6_210 == 0x00 || (s1_291 & 1) == 0x00)
						goto l230A2B20;
					goto l230A2654;
				}
				goto l230A2720;
			}
		}
		else
		{
			if (a6_210 == 0x07FF)
			{
				a7_100 = a5_136 | a2 << 0x03;
				if (a7_100 == 0x00)
				{
					a5_136.u0 = 0;
					a4_130.u0 = 0x07FF;
					s2_104 = a3_39;
					goto l230A2D38;
				}
				a7_100 = a2 << 0x03;
				if (a5_136 << 0x09 < 0x00)
				{
					a4_130.u0 = 0x07FF;
					s2_104 = a3_39;
					goto l230A26E0;
				}
				s2_104 = a3_39;
l230A2598:
				a4_130.u0 = 0x07FF;
				a6_210.u0 = 0;
				goto l230A23D0;
			}
			t3_111 |= 0x00800000;
			s0_134 = a4_130;
		}
		Eq_571544 s0_168;
		ui32 a7_153;
		if (s0_134 <= 56)
		{
			if (s0_134 <= 31)
			{
				int32 a0_170 = 32 - s0_134;
				a7_153 = t3_111 << a0_170 | (a0 << 0x03) >> s0_134 | (word32) ((a0 << 0x03) << a0_170 != 0x00);
				s0_168 = t3_111 >> s0_134;
				goto l230A2964;
			}
			uint32 a4_157 = t3_111 >> (word32) s0_134 - 32;
			int32 a0_158 = 0;
			if (s0_134 != 32)
				a0_158 = t3_111 << 64 - s0_134;
			a7_153 = a4_157 | (word32) ((a0_158 | a0 << 0x03) != 0x00);
		}
		else
			a7_153 = (word32) ((t3_111 | a0 << 0x03) != 0x00);
		s0_168.u0 = 0;
l230A2964:
		Eq_2 a7_184 = (a2 << 0x03) - a7_153;
		a5_136 = a5_136 - s0_168 - (word32) (a2 << 0x03 < a7_184);
		t1_193 = a7_184;
		a4_130 = a6_210;
		s2_104 = a3_39;
l230A2808:
		if (a5_136 << 0x08 >= 0x00)
			goto l230A28A0;
		s0_286 = a5_136 & 0x007FFFFF;
		s4_289 = t1_193;
		s1_291 = a4_130;
l230A2BE8:
		Eq_2 a0_298;
		if (s0_286 != 0x00)
		{
			word32 a5_1913;
			word32 a4_1912;
			a0_298 = __clzsi2(s0_286, out a4_1912, out a5_1913);
		}
		else
		{
			word32 a4_1910;
			word32 a5_1911;
			a0_298 = (word32) __clzsi2(s4_289, out a4_1910, out a5_1911) + 32;
		}
		uint32 s0_308;
		Eq_571023 a4_304 = (word32) a0_298 - 8;
		if (a4_304 <= 31)
		{
			s0_308 = s4_289 >> 32 - a4_304 | s0_286 << a4_304;
			t1_193 = s4_289 << a4_304;
		}
		else
		{
			s0_308 = s4_289 << (word32) a0_298 - 40;
			t1_193.u0 = 0;
		}
		if (a4_304 < s1_291)
		{
			a4_130 = s1_291 - a4_304;
			a5_136 = s0_308 & ~0x00800000;
			goto l230A28A0;
		}
		int32 a4_326 = a4_304 - s1_291;
		if (a4_326 <= -30)
		{
			int32 a4_345 = 32 - (a4_326 + 1);
			a7_100 = s0_308 << a4_345 | t1_193 >> a4_326 + 1 | (word32) (t1_193 << a4_345 != 0x00);
			t3_111 = s0_308 >> a4_326 + 1;
			goto l230A29F4;
		}
		uint32 a4_331 = s0_308 >> a4_326 + -31;
		int32 a3_332 = 0;
		if (a4_326 != -31)
			a3_332 = s0_308 << 64 - (a4_326 + 1);
		a7_100 = a4_331 | (word32) ((t1_193 | a3_332) != 0x00);
l230A2AA4:
		t3_111.u0 = 0;
		goto l230A29F4;
	}
	if (((word32) s1_291.u0 + 1 & 0x07FE) != 0x00)
	{
		s4_289 = (a0 << 0x03) - (a2 << 0x03);
		s0_286 = t3_111 - a5_136 - (word32) (a0 << 0x03 < s4_289);
		if (s0_286 << 0x08 < 0x00)
		{
			s4_289 = (a2 << 0x03) - (a0 << 0x03);
			s0_286 = a5_136 - t3_111 - (word32) (a2 << 0x03 < s4_289);
			s2_104 = a3_39;
			goto l230A2BE8;
		}
		a7_100 = s4_289 | s0_286;
		if (a7_100 != 0x00)
			goto l230A2BE8;
		goto l230A2A9C;
	}
	ui32 a1_73 = t3_111 | a0 << 0x03;
	ui32 a2_74 = a5_136 | a2 << 0x03;
	if (s1_291 == 0x00)
	{
		if (a1_73 == 0x00)
		{
			if (a2_74 == 0x00)
			{
				s2_104 = (word32) (s3_17 < -3);
				t3_111.u0 = 0;
				a7_100.u0 = 0;
				goto l230A29F4;
			}
			t3_111 = a5_136;
			a7_100 = a2 << 0x03;
l230A2A8C:
			s2_104 = a3_39;
			goto l230A29F4;
		}
		if (a2_74 == 0x00)
			goto l230A29F4;
		Eq_2 a2_105 = (a0 << 0x03) - (a2 << 0x03);
		Eq_2 a4_108 = t3_111 - a5_136 - (word32) (a0 << 0x03 < a2_105);
		if (a4_108 << 0x08 < 0x00)
		{
			a7_100 = (a2 << 0x03) - (a0 << 0x03);
			t3_111 = a5_136 - t3_111 - (word32) (a2 << 0x03 < a7_100);
			goto l230A2A8C;
		}
		a7_100 = a2_105 | a4_108;
		if (a7_100 != 0x00)
		{
			t3_111 = a4_108;
			a7_100 = a2_105;
			goto l230A29F4;
		}
l230A2A9C:
		s2_104 = (word32) (s3_17 < -3);
		goto l230A2AA4;
	}
	if (s1_291 == 0x07FF)
	{
		if (a1_73 != 0x00)
		{
			s1_291 = (word32) ((t3_111 & 0x00400000) < 1) << 0x04;
			if (a6_210 != 0x07FF)
				goto l230A2B0C;
		}
		else
		{
			if (a6_210 != s1_291)
			{
				s1_291.u0 = 0;
l230A2AEC:
				if (a2_74 == 0x00)
				{
					a7_100.u0 = 0;
					s2_104.u0 = 0;
					a5_136.u0 = 0x00400000;
					a4_130.u0 = 0x07FF;
					s1_291.u0 = 16;
					goto l230A2B20;
				}
				a7_100 = a2 << 0x03;
				s2_104 = a3_39;
l230A2AF8:
				a6_210.u0 = 0;
				a4_130.u0 = 0x07FF;
				goto l230A2640;
			}
			s1_291.u0 = 0;
		}
	}
	else
	{
		s1_291.u0 = 0;
		if (a6_210 != 0x07FF)
			goto l230A2AE8;
	}
	if (a2_74 != 0x00 && a5_136 << 0x09 >= 0x00)
		s1_291.u0 = 16;
l230A2AE8:
	if (a1_73 == 0x00)
		goto l230A2AEC;
l230A2B0C:
	if (a2_74 == 0x00)
		goto l230A26A8;
	goto l230A2B10;
}

