pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A3604: void __assert(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9)
void __assert(Eq_2 ra, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9)
{
	__assert_func(ra, 0, s2, s6, s7, s8, s9);
}

// 230A3618: Register Eq_2 atoi(Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_118480 a4Out, Register out Eq_118481 a5Out)
// Called from:
//      cmd_wifi_cfg
//      cmd_wifi_ap_start
//      cmd_wifi_ap_conf_max_sta
//      wifi_rc_fixed_enable
//      wifi_capcode_cmd
//      ble_auth_passkey
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      cmd_wdt_init
//      netif_find
//      at_key_value_get
//      at_server_init
//      http_url_req
//      get_di_para
//      get_ip_para
//      httpc_tcp_recv
//      __assert
Eq_2 atoi(Eq_2 a0, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_118480 & a4Out, union Eq_118481 & a5Out)
{
	ptr32 a1_7;
	ptr32 a2_8;
	ptr32 a3_9;
	Eq_118480 a4_10;
	Eq_118481 a5_11;
	Eq_2 a0_6 = strtol(a0, null, 0x0A, out a1_7, out a2_8, out a3_9, out a4_10, out a5_11);
	a1Out = a1_7;
	a2Out = a2_8;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	return a0_6;
}

// 230A3624: void _atoi_r(Register Eq_2 a0, Register Eq_2 a1)
void _atoi_r(Eq_2 a0, Eq_2 a1)
{
	_strtol_r(a0, a1, null, 0x0A);
}

// 230A3630: Register Eq_2 __errno(Register out ptr32 a5Out)
// Called from:
//      aos_loop_run
//      pow
//      _close
//      _exit
//      _fstat
//      _kill
//      _lseek
//      _read
//      _sbrk
//      _stat
//      _write
Eq_2 __errno(ptr32 & a5Out)
{
	Eq_2 a0_6 = g_t4200ECFC;
	a5Out = 0x4200ECFC;
	return a0_6;
}

// 230A3640: void _fiprintf_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9)
void _fiprintf_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9)
{
	word32 s0_64;
	word32 a0_65;
	word32 s2_66;
	_vfiprintf_r(ra, a0, a1, a2, s2, s6, s7, s8, s9, out s0_64, out a0_65, out s2_66);
}

// 230A3678: void fiprintf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9)
// Called from:
//      __assert_func
void fiprintf(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9)
{
	word32 s0_71;
	word32 a0_72;
	word32 s2_73;
	_vfiprintf_r(ra, g_t4200ECFC, a0, a1, s2, s6, s7, s8, s9, out s0_71, out a0_72, out s2_73);
}

// 230A36C8: Register Eq_2 memchr(Register Eq_2 a0, Register int32 a1, Register Eq_2 a2, Register out Eq_324936 a3Out, Register out Eq_2 a5Out)
// Called from:
//      fdt_get_string
//      fdt_subnode_offset_namelen
//      tc_blfdtdump
//      __sfvwrite_r
Eq_2 memchr(Eq_2 a0, int32 a1, Eq_2 a2, union Eq_324936 & a3Out, union Eq_2 & a5Out)
{
	Eq_2 a5_100;
	if ((a0 & 3) != 0x00)
	{
		a5_100 = (word32) a2 - 1;
		if (a2 != 0x00)
		{
			if ((word32) *a0.u0 != (a1 & 0x00FF))
			{
				a3.u0 = -1;
				do
				{
					a0 = (byte) a0.u0 + 1;
					if ((a0 & 3) == 0x00)
						goto l230A3708;
					a5_100 = (word32) a5_100 - 1;
					if (a5_100 == -1)
						goto l230A3734;
				} while ((word32) *a0 != (a1 & 0x00FF));
			}
			goto l230A3738;
		}
	}
	else
	{
		a5_100 = a2;
l230A3708:
		if (a5_100 > 3)
		{
			ui32 a1_31 = a1 << 0x08 & 0xFFFF | a1 & 0x00FF;
			ui32 a7_33 = a1_31 << 0x10 | a1_31;
			do
			{
				ui32 a4_43 = a7_33 ^ *a0;
				a3 = a4_43 + ~0x01010100;
				if ((a4_43 + ~0x01010100 & ~a4_43 & 0x80808080) != 0x00)
					goto l230A3714;
				a5_100 = (word32) a5_100 - 4;
				a0 = (word32) a0 + 4;
			} while (a5_100 > 3);
		}
		if (a5_100 != 0x00)
		{
l230A3714:
			if ((word32) *a0 != (a1 & 0x00FF))
			{
				a5_100 = a0 + a5_100;
				do
				{
					a0 = (word32) a0 + 1;
					if (a5_100 == a0)
						goto l230A3734;
				} while ((word32) *a0 != (a1 & 0x00FF));
			}
l230A3738:
			a3Out = a3;
			a5Out = a5_100;
			return a0;
		}
	}
l230A3734:
	a0.u0 = 0;
	goto l230A3738;
}

// 230A37A4: Register Eq_2 memcmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_44567) a3Out, Register out (ptr32 Eq_44567) a4Out, Register out Eq_44569 a5Out)
// Called from:
//      rxu_cntrl_frame_handle
//      scanu_search_by_ssid
//      scanu_rm_exist_ssid
//      _aid_list_delete
//      apm_probe_req_handler
//      apm_assoc_req_handler
//      process_rsn_ie
//      process_wpa_ie
//      IsEAPOL_MICValid
//      parseKeyKDE
//      KeyMgmtSta_IsRxEAPOLValid
//      supplicantAkmIsWpaWpa2
//      supplicantAkmIsWpa2
//      supplicantConstructContext
//      pmkCacheFindPSKElement
//      chan_ctxt_add
//      rxu_mgt_ind_handler
//      bl_utils_idx_lookup
//      stateGlobalGuard_scan_beacon
//      bt_mesh_beacon_recv
//      net_key_update
//      net_key_add
//      mod_sub_va_del
//      va_add
//      app_key_set
//      mod_reset
//      bt_mesh_ccm_decrypt
//      auth_match
//      prov_random
//      gen_prov_ctl
//      bl_find_valid_queued_entry
//      bt_conn_addr_le_cmp
//      find_ccc_cfg
//      find_sc_cfg
//      notify_cb
//      id_find
//      set_random_address
//      bt_unpair
//      id_create.isra.25
//      bt_setup_id_addr
//      init_work
//      bt_le_adv_start
//      bt_uuid_cmp
//      smp_public_key
//      smp_pairing_random
//      bt_smp_request_ltk
//      bt_smp_sign_verify
//      bt_keys_find.part.1
//      bt_keys_get_addr
//      bt_keys_find_irk
//      bt_keys_find_addr
//      bt_rpa_irk_matches
//      find_type_cb
//      fdt_subnode_offset_namelen
//      fdt_get_property_namelen_
//      ota_tcp_cmd
//      ls_cmd
//      psm_test_cmd
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      ethernet_input
//      dhcp_server_recv
//      file_info
//      dirent_file
//      romfs_register
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_rsa_pkcs1_verify
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_parse_certificate
//      x509_name_cmp
//      x509_crt_check_parent
//      x509_crt_verify_top.isra.7
//      mbedtls_x509_crt_check_extended_key_usage
//      mbedtls_x509_crt_verify_with_profile
//      mbedtls_x509_crt_parse_der
//      oid_sig_alg_from_asn1.part.0
//      mbedtls_oid_get_attr_short_name
//      mbedtls_oid_get_x509_ext_type
//      mbedtls_oid_get_extended_key_usage
//      mbedtls_oid_get_pk_alg
//      mbedtls_oid_get_ec_grp
//      mbedtls_oid_get_md_alg
//      mbedtls_pem_read_buffer
//      mbedtls_ssl_handshake_server_step
//      two_way_long_needle
//      strstr
Eq_2 memcmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, union Eq_2 & a2Out, struct Eq_44567 & a3Out, struct Eq_44567 & a4Out, union Eq_44569 & a5Out)
{
	Eq_44569 a5_17;
	if (a2 > 3)
	{
		a3 = (struct Eq_44567 *) 3;
		if (((a0 | a1) & 3) != 0x00)
		{
l230A381C:
			a5_17 = (word32) a2 - 1;
l230A37E0:
			a4 = (word32) *a0;
			a3 = (word32) *a1;
			if (a4 == a3)
			{
				a4 = (word32) a5_17 + 1;
				a5_17 = (word32) a0 + 1;
				word32 a0_39 = a0 + a4;
				do
				{
					a1 = (word32) a1 + 1;
					if (a5_17 == a0_39)
						goto l230A3814;
					a4 = (word32) *a5_17;
					a3 = (word32) *a1;
					a5_17 = (word32) a5_17 + 1;
				} while (a4 == a3);
			}
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_17;
			return a4 - a3;
		}
		do
		{
			a4 = (struct Eq_44567 *) *a0;
			if (a4 != *a1)
				goto l230A381C;
			a2 = (word32) a2 - 4;
			a0 = (word32) a0 + 4;
			a1 = (word32) a1 + 4;
		} while (a2 > 3);
	}
	a5_17 = (word32) a2 - 1;
	if (a2 == 0x00)
	{
l230A3814:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_17;
		return 0;
	}
	goto l230A37E0;
}

// 230A382C: Register int32 memcpy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_572 a6Out, Register out Eq_2 a7Out)
// Called from:
//      scan_item_cb
//      wifiprov_wifi_state_get
//      trpc_power_get
//      rf_pri_update_tx_power_offset
//      mm_sta_add
//      mm_bcn_change
//      ps_send_pspoll
//      scan_probe_req_tx
//      sta_mgmt_register
//      txl_frame_get
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      vif_mgmt_register
//      rc_update_stats
//      rc_init
//      rxu_cntrl_frame_handle
//      scanu_scan_next
//      scanu_start
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      txu_cntrl_sechdr_len_compute
//      apm_start_cfm
//      apm_set_bss_param
//      apm_sta_add
//      apm_send_mlme
//      apm_bcn_set
//      apm_assoc_req_handler
//      keyMgmtSta_StartSession
//      supplicantInitSession
//      supplicantEnable
//      keyMgmtFormatWpaRsnIe
//      add_key_to_mac
//      add_mfp_key_to_mac
//      keyMgmtPlumbPairwiseKey
//      process_rsn_ie
//      process_wpa_ie
//      isApReplayCounterFresh
//      updateApReplayCounter
//      formEAPOLEthHdr
//      IsEAPOL_MICValid
//      parseKeyDataGTK
//      KeyMgmtSta_PrepareEAPOLFrame
//      supplicantConstructContext
//      KeyMgmtSta_DeriveKeys
//      GetKeyMsgNonceFromEAPOL
//      ProcessRxEAPOL_GrpMsg1
//      bl_sha256_crypto_kdf
//      pmkCacheSetPassphrase
//      pmkCacheAddPSK
//      RC4_Encrypt
//      sha256_compress
//      sha256_vector
//      hmac_sha256_vector
//      ProcessKeyMgmtDataAp
//      GenerateGTK_internal
//      PopulateKeyMsg
//      prepareKDE
//      Encrypt_keyData
//      KeyMgmtAp_DerivePTK
//      KeyData_CopyWPAWP2
//      InitKeyMgmtInfo
//      cm_InitConnection
//      cm_SetPeerAddr
//      cm_SetComData
//      mm_hw_config_handler
//      me_build_beacon
//      me_rc_stats_req_handler
//      me_chan_config_req_handler
//      me_config_req_handler
//      me_sta_add_req_handler
//      scanu_raw_send_req_handler
//      rxu_mgt_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_sta_add_cfm_handler
//      apm_start_req_handler
//      Bl_hmac_md5
//      Bl_hmac_sha1
//      Bl_PRF
//      wpa_MD5Update
//      wpa_MD5Final
//      ap_setpsk
//      InitializeAp
//      ipc_host_init
//      bl_main_apm_sta_info_get
//      bl_send_start
//      bl_send_add_if
//      bl_send_sm_connect_req
//      bl_send_apm_start_req
//      bl_rx_apm_sta_add_ind
//      bl_rx_scanu_result_ind
//      bl_output
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_ap_sta_info_get_internal
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_ap_start
//      cmd_wifi_power_table_update
//      cb_scan_item_parse
//      wifi_mgmr_sta_enable
//      wifi_mgmr_sta_connect_ind_stat_get
//      wifi_mgmr_sta_ssid_set
//      wifi_mgmr_sta_psk_set
//      wifi_mgmr_sta_connect
//      wifi_mgmr_ap_enable
//      wifi_mgmr_ap_mac_get
//      wifi_mgmr_ap_sta_info_get
//      wifi_mgmr_cfg_req
//      wifi_mgmr_scan_ap_all
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cmd_mgr_msgind
//      llc_map_update_ind
//      llm_init
//      llcp_channel_map_ind_handler
//      hci_le_set_host_ch_class_cmd_handler
//      blemesh_init
//      bt_mesh_beacon_recv
//      send_mod_sub_status
//      create_mod_app_status.isra.5
//      send_mod_pub_status.isra.7
//      va_add
//      app_key_set
//      heartbeat_pub_set
//      bt_mesh_ccm_encrypt
//      bt_mesh_ccm_decrypt
//      bt_mesh_k2
//      bt_mesh_k3
//      bt_mesh_net_obfuscate
//      health_fault_status
//      bt_mesh_provision
//      bt_mesh_prov_enable
//      net_decrypt.isra.1
//      bt_mesh_net_keys_create
//      friend_cred_refresh
//      bt_mesh_net_beacon_update
//      bt_mesh_net_revoke_keys
//      prov_confirm
//      prov_invite
//      prov_data
//      prov_pub_key
//      prov_start
//      gen_prov_cont
//      gen_prov_start
//      send_pub_key
//      bt_mesh_proxy_adv_start
//      bt_mesh_trans_recv
//      net_buf_simple_add_mem
//      _copy
//      bl_onchiphci_rx_packet_handler
//      bt_conn_le_start_encryption
//      bt_conn_add_le
//      bt_conn_create_le
//      gatt_notify
//      gatt_indicate
//      disconnected_cb
//      read_appearance
//      read_ppcp
//      read_name
//      bt_gatt_attr_read_ccc
//      bt_gatt_attr_read_service
//      sc_save
//      bt_gatt_attr_write_ccc
//      bt_gatt_attr_read
//      bt_gatt_attr_read_chrc
//      bt_gatt_foreach_attr
//      gatt_read_group_rsp
//      gatt_read_type_rsp
//      read_included_uuid_cb
//      gatt_find_info_rsp
//      bt_gatt_write_without_response_cb
//      bt_gatt_write
//      bt_gatt_subscribe
//      bt_gatt_disconnected
//      bt_addr_le_copy
//      le_pkey_complete
//      le_remote_feat_complete
//      set_random_address
//      hci_id_add
//      set_ad
//      le_ltk_request
//      enh_conn_complete
//      le_legacy_conn_complete
//      init_work
//      bt_dh_key_gen
//      l2cap_chan_le_send_sdu
//      l2cap_chan_le_recv_seg
//      uuid_to_uuid128
//      bt_uuid_create
//      bt_uuid_to_str
//      smp_sign_buf
//      smp_f6
//      smp_g2
//      smp_ident_info
//      smp_encrypt_info
//      sc_smp_send_dhkey_check
//      smp_dhkey_check
//      smp_send_pairing_random
//      sc_send_public_key
//      send_pairing_rsp
//      bt_smp_distribute_keys
//      smp_signing_info
//      smp_master_ident
//      smp_pairing_req
//      bt_smp_dhkey_ready
//      smp_c1
//      smp_pairing_confirm
//      smp_pairing_rsp
//      smp_ident_addr_info
//      smp_public_key
//      smp_pairing_random
//      bt_smp_request_ltk
//      bt_smp_sign_verify
//      bt_smp_sign
//      bt_smp_auth_passkey_entry
//      bt_smp_start_security
//      bt_smp_update_keys
//      bt_keys_get_addr
//      bt_keys_find_irk
//      read_func
//      data_cb
//      bt_rpa_irk_matches
//      tc_aes128_set_encrypt_key
//      find_info_cb
//      tc_fdt_wifi_module
//      ota_tcp_cmd
//      scan_complete_cb
//      __recv_event
//      wifi_state_get_cb
//      write_data
//      __ble_bytes_send
//      __protocol_send
//      pro_trans_read
//      pro_trans_layer_ack_read
//      __payload_write
//      __payload_read
//      ensure
//      cJSON_strdup
//      print_array.isra.4
//      print_object.isra.3
//      aos_cli_input_direct
//      psm_test_cmd
//      prvCopyDataToQueue
//      prvCopyDataFromQueue
//      prvWriteBytesToBuffer
//      prvReadBytesFromBuffer
//      bl_uart_init
//      bl_chip_info
//      bl_rand_stream
//      bl_wifi_sta_mac_addr_set
//      bl_wifi_ap_mac_addr_set
//      bl_wifi_mac_addr_get
//      bl_wifi_ap_info_set
//      bl_wifi_sta_info_set
//      vfs_uart_init
//      hal_uart_setconfig
//      hal_board_cfg
//      bl_tsen_adc_get
//      PtTable_Update_Entry
//      PtTable_Get_Active_Entries
//      bl_timer_tick_enable
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      lwip_sendto
//      dns_gethostbyname
//      lwip_chksum_copy
//      etharp_input
//      etharp_request
//      ip4_output_if_opt
//      pbuf_copy
//      pbuf_copy_partial
//      pbuf_take
//      pbuf_take_at
//      tcp_seg_copy
//      ethernet_output
//      icmp_input
//      icmp_dest_unreach
//      dhcp_client_find_by_ip.isra.0
//      dhcp_server_recv
//      dhcpd_start
//      romfs_read
//      dirent_file
//      utils_sha256_update
//      Bl_F_fast.constprop.0
//      utils_wifi_psk_cal_fast_bin
//      utils_hmac_sha1_fast
//      inode_reserve
//      aos_poll_read_fd
//      event_write
//      event_read
//      at_serial_cfg_set
//      at_server_notify_with_ctx
//      cwjap_cur
//      at_parse
//      at_set_ap
//      at_http_request
//      get_text_para
//      get_tdata_para
//      get_ip_para
//      get_hex_para
//      send_data_handler
//      client_ssl_set_alpn
//      udp_send_data
//      mfg_media_read_macaddr
//      bl_mtd_write
//      hal_hbn_init
//      bl_hbn_enter
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_random
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_encrypt
//      mbedtls_rsa_rsaes_oaep_decrypt
//      mbedtls_rsa_pkcs1_decrypt
//      mbedtls_rsa_pkcs1_sign
//      ssl_swap_epochs
//      tls_prf_sha256
//      mbedtls_ssl_derive_keys
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_write_record
//      mbedtls_ssl_resend
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_write_certificate
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_write
//      mbedtls_ssl_read_record_layer
//      mbedtls_ssl_read
//      mbedtls_x509_crt_parse_der
//      mbedtls_aes_crypt_cbc
//      mbedtls_mpi_grow
//      mbedtls_mpi_shrink
//      mbedtls_mpi_copy
//      mpi_montmul
//      mbedtls_mpi_exp_mod
//      mbedtls_cipher_set_iv
//      mbedtls_cipher_update
//      mbedtls_cipher_auth_encrypt
//      mbedtls_debug_print_crt
//      ecp_mod_p256k1
//      mbedtls_gcm_starts
//      sha224_clone_wrap
//      sha224_update_wrap
//      pem_aes_decrypt
//      mbedtls_md5_clone
//      mbedtls_md5_update
//      mbedtls_sha1_clone
//      mbedtls_sha1_update
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
//      __sfvwrite_r
int32 memcpy(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_572 & a6Out, union Eq_2 & a7Out)
{
	Eq_2 a4_11;
	ui32 a5_5 = a1 ^ a0;
	Eq_2 a5_118 = a5_5 & 3;
	word32 a7_8 = a0 + a2;
	if ((a5_5 & 3) == 0x00)
	{
		a5_118.u0 = 3;
		if (a2 > 3)
		{
			a4_11 = (word32) a0 + 1;
			if ((a0 & 3) != 0x00)
			{
				do
				{
					a3 = (word32) *a1;
					a4_11 = a4_11;
					*((word32) a4_11 + 0x0FFF) = (byte) a3;
					a1 = (word32) a1 + 1;
					if ((a4_11 & 3) == 0x00)
						break;
					a3 = (word32) *a1;
					*((word32) a4_11 + 0x00001000) = (byte) a3;
					++a4_11;
					a1 = (word32) a1 + 1;
				} while ((a4_11 + 1 & 3) != 0x00);
			}
			a2 = a7_8 & -4;
			a5_118 = (a7_8 & -4) + -32;
			while (a4_11 < a5_118)
			{
				int32 t0_36 = *((word32) a1 + 4);
				int32 t6_37 = *((word32) a1 + 8);
				int32 t5_38 = *((word32) a1 + 0x0C);
				int32 t4_39 = *((word32) a1 + 16);
				int32 t3_40 = *((word32) a1 + 20);
				t1 = (int32) *((word32) a1 + 24);
				a6 = *((word32) a1 + 28);
				*a4_11 = *a1;
				a1 = (word32) a1 + 36;
				a3 = *((word32) a1 - 4);
				*((word32) a4_11 + 4) = t0_36;
				*((word32) a4_11 + 8) = t6_37;
				*((word32) a4_11 + 0x0C) = t5_38;
				*((word32) a4_11 + 16) = t4_39;
				*((word32) a4_11 + 20) = t3_40;
				*((word32) a4_11 + 24) = t1;
				*((word32) a4_11 + 28) = a6;
				a4_11 = (word32) a4_11 + 36;
				*((word32) a4_11 + 0x0FFC) = a3;
			}
			if (a4_11 < (a7_8 & -4))
			{
				a3 = a1;
				Eq_2 a5_63 = a4_11;
				do
				{
					a6 = *a3;
					a5_63 = (word32) a5_63 + 4;
					*((word32) a5_63 + 0x0FFC) = a6;
					a3 = (word32) a3 + 4;
				} while (a5_63 < (a7_8 & -4));
				a5_118 = ((a7_8 & -4) + -1 - a4_11 & -4) + 4;
				a4_11 += a5_118;
				a1 += a5_118;
			}
			if (a4_11 >= a7_8)
			{
l230A3898:
				a1Out = a1;
				a2Out = a2;
				a3Out = a3;
				a4Out = a4_11;
				a5Out = a5_118;
				a6Out = a6;
				a7Out.u0 = <invalid>;
				return t1;
			}
l230A38A4:
			do
			{
				Eq_2 a5_87 = (word32) *a1;
				a4_11 = (word32) a4_11 + 1;
				*((word32) a4_11 + 0x0FFF) = (byte) a5_87;
				a1 = (word32) a1 + 1;
			} while (a4_11 < a7_8);
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out = a4_11;
			a5Out = a5_87;
			a6Out = a6;
			a7Out.u0 = <invalid>;
			return t1;
		}
	}
	a4_11 = a0;
	if (a0 >= a7_8)
		goto l230A3898;
	goto l230A38A4;
}

