pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A3948: Register Eq_2 memmove(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_2 a5Out)
// Called from:
//      rc_sort_samples_tp
//      mbedtls_ssl_write_record
//      mbedtls_ssl_fetch_input
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_read_record_layer
//      __sfvwrite_r
//      _realloc_r
Eq_2 memmove(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a3Out, byte & a4Out, union Eq_2 & a5Out)
{
	if (a1 < a0)
	{
		word32 a5_6 = a1 + a2;
		if (a0 < a5_6)
		{
			word32 a4_81 = a0 + a2;
			if (a2 == 0x00)
			{
				a3Out = a3;
				a4Out = a4_81;
				a5Out = a5_6;
				return a1;
			}
			else
			{
				do
				{
					a5_6 = (word32) a5_6 - 1;
					Eq_2 a3_85 = (word32) *a5_6;
					a4_81 += -1;
					*a4_81 = (byte) a3_85;
				} while (a1 != a5_6);
				a3Out = a3_85;
				a4Out = a4_81;
				a5Out = a5_6;
				return a1;
			}
		}
	}
	Eq_2 a5_14;
	Eq_2 a3_13;
	if (a2 <= 0x0F)
		a5_14 = a0;
	else
	{
		if (((a1 | a0) & 3) != 0x00)
		{
			a3_13 = (word32) a2 - 1;
			a5_14 = a0;
			goto l230A3988;
		}
		ui32 a7_16 = (word32) a2 - 16 & -16;
		Eq_2 a6_18 = (word32) a0 + (a7_16 + 16);
		Eq_2 a4_19 = a1;
		a5_14 = a0;
		do
		{
			a5_14 = (word32) a5_14 + 16;
			*((word32) a5_14 + 0x0FF0) = *a4_19;
			a4_19 = (word32) a4_19 + 16;
			*((word32) a5_14 + 0x0FF4) = *((word32) a4_19 - 0x0C);
			*((word32) a5_14 + 0x0FF8) = *((word32) a4_19 - 8);
			*((word32) a5_14 + 0x0FFC) = *((word32) a4_19 - 4);
		} while (a6_18 != a5_14);
		a4 = a2 & 0x0C;
		a1 = (word32) a1 + (a7_16 + 16);
		if ((a2 & 0x0C) != 0x00)
		{
			Eq_2 a4_42 = a1;
			Eq_2 a7_43 = a5_14;
			do
			{
				a4_42 = (word32) a4_42 + 4;
				a7_43 = (word32) a7_43 + 4;
				*((word32) a7_43 + 0x0FFC) = *((word32) a4_42 - 4);
			} while ((word32) a1 + ((a2 & 0x0F) - a4_42) > 3);
			a4 = ((a2 & 0x0F) + -4 & -4) + 4;
			a2 &= 3;
			a5_14 += a4;
			a1 += a4;
		}
		else
			a2 &= 0x0F;
	}
	a3_13 = (word32) a2 - 1;
	if (a2 == 0x00)
	{
		a3Out = a3_13;
		a4Out = a4;
		a5Out = a5_14;
		return a1;
	}
l230A3988:
	Eq_2 a3_72 = (word32) a5_14 + ((word32) a3_13 + 1);
	do
	{
		a1 = (word32) a1 + 1;
		byte * a4_76 = (word32) *((word32) a1 - 1);
		a5_14 = (word32) a5_14 + 1;
		*((word32) a5_14 + 0x0FFF) = (byte) a4_76;
	} while (a5_14 != a3_72);
	a3Out = a3_72;
	a4Out = a4_76;
	a5Out = a5_14;
	return a1;
}

// 230A3A68: Register Eq_2 memset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_630 a1, Register Eq_2 a2, Register out Eq_2 t1Out, Register out Eq_2 a0Out, Register out Eq_630 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_638) a5Out)
// Called from:
//      wifiprov_wifi_state_get
//      event_cb_wifi_event
//      __usr_at_cmd_demo
//      ipc_emb_init
//      ipc_emb_tx_evt
//      phy_tcal_reset
//      mm_env_init
//      mm_init
//      mm_sta_add
//      mm_sta_del
//      mm_bcn_init_vif
//      ps_init
//      bl_init
//      scan_init
//      sta_mgmt_entry_init
//      sta_mgmt_add_key
//      td_reset
//      txl_cfm_init
//      txl_cntrl_init
//      txl_reset
//      txl_frame_init_desc
//      txl_frame_init
//      vif_mgmt_init
//      vif_mgmt_unregister
//      vif_mgmt_add_key
//      me_init
//      rc_update_stats
//      rc_init
//      rxu_swdesc_upload_evt
//      scanu_init
//      scanu_rm_exist_ssid
//      _aid_list_delete
//      apm_init
//      apm_assoc_req_handler
//      dbg_init
//      ke_msg_alloc
//      GetTxEAPOLBuffer
//      init_customApp_mibs
//      supplicantInit
//      add_key_to_mac
//      add_mfp_key_to_mac
//      IsEAPOL_MICValid
//      KeyMgmtSta_PrepareEAPOLFrame
//      set_psk
//      pmkCacheInit
//      pmkCacheNewElement
//      pmkCacheDeletePSK
//      hmac_sha256_vector
//      PrepDefaultEapolMsg
//      InitStaKeyInfo
//      prepareKDE
//      cm_InitConnection
//      chan_init
//      chan_ctxt_del
//      mm_monitor_enable_req_handler
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
//      rxu_mgt_ind_handler
//      generate_subkey
//      bl_aes_cmac
//      Bl_hmac_md5
//      Bl_hmac_sha1
//      Bl_PRF
//      wpa_MD5Transform
//      wpa_MD5Final
//      Bl_SHA1Final
//      InitializeAp
//      ipc_host_init
//      bl_main_monitor
//      bl_main_apm_start
//      bl_main_apm_sta_delete
//      bl_main_connect
//      bl_send_msg
//      bl_msg_zalloc.constprop.3
//      notify_event_scan_done
//      bl_rx_chan_switch_ind
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      bl_rx_scanu_result_ind
//      bl_output
//      tcpip_stack_input
//      bl_ipc_init
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_ap_sta_info_get_internal
//      wifi_mgmr_api_ip_update
//      wifi_mgmr_api_reconnect
//      wifi_mgmr_api_disable_autoreconnect
//      wifi_mgmr_api_enable_autoreconnect
//      wifi_mgmr_api_disconnect
//      wifi_mgmr_api_ifaceup
//      wifi_mgmr_api_sniffer_enable
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_fw_disconnect
//      wifi_mgmr_api_fw_tsen_reload
//      wifi_mgmr_api_fw_scan
//      wifi_mgmr_api_fw_powersaving
//      wifi_mgmr_api_ap_start
//      wifi_mgmr_api_ap_stop
//      wifi_mgmr_api_idle
//      wifi_mgmr_api_raw_send
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      cmd_wifi_ap_start
//      wifi_denoise_disable_cmd
//      wifi_denoise_enable_cmd
//      wifi_mgmr_sta_connect
//      wifi_mgmr_ap_sta_info_get
//      wifi_mgmr_rate_config
//      wifi_mgmr_conf_max_sta
//      wifi_mgmr_cfg_req
//      wifi_mgmr_all_ap_scan
//      wifi_mgmr_profile_add
//      wifi_mgmr_profile_get
//      cb_disconnect_ind
//      cb_connect_ind
//      netif_status_callback
//      bl606a0_wifi_init
//      blemesh_rpl_clr
//      fault_clear
//      blemesh_seg_send
//      blemesh_net_send
//      blemesh_fault_set
//      send_friend_poll
//      clear_friendship
//      sub_update
//      send_friend_req.constprop.8
//      bt_mesh_model_publish
//      mod_publish
//      bt_mesh_adv_create_from_pool
//      send_mod_pub_status.isra.7
//      bt_mesh_app_key_del
//      bt_mesh_subnet_del
//      bt_mesh_cfg_reset
//      bt_mesh_reset
//      friend_cred_clear
//      bt_mesh_net_create
//      bt_mesh_rpl_reset
//      bt_mesh_net_iv_update
//      bt_mesh_net_recv
//      prov_start
//      bt_mesh_pb_gatt_close
//      proxy_connected
//      proxy_send
//      proxy_complete_pdu
//      bt_mesh_proxy_adv_start
//      send_ack
//      bt_mesh_rx_reset
//      bt_mesh_heartbeat_send
//      send_friend_clear
//      friend_clear
//      net_buf_unref
//      _set
//      bl_find_valid_queued_entry
//      bl_onchiphci_interface_init
//      bt_conn_le_start_encryption
//      bt_conn_add_le
//      bt_conn_le_conn_update
//      sc_ccc_cfg_write
//      update_ccc
//      hci_id_add
//      set_ad
//      bt_le_scan_update
//      le_adv_report
//      le_conn_param_req
//      bt_le_adv_start
//      bt_set_tx_pwr
//      l2cap_chan_tx_init
//      bt_uuid_to_str
//      smp_f5
//      bt_smp_disconnected
//      compute_and_send_master_dhcheck
//      compute_and_check_and_send_slave_dhcheck
//      smp_dhkey_check
//      bt_smp_distribute_keys
//      smp_init
//      smp_c1
//      smp_pairing_random
//      bt_smp_request_ltk
//      bt_smp_update_keys
//      bt_keys_clear
//      write_func
//      ble_connect
//      discover_func
//      read_func
//      device_found
//      ble_tp_notify_task
//      bt_rpa_irk_matches
//      bt_att_accept
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
//      bt_att_req_cancel
//      cmd_blog_info_dump
//      ota_tcp_cmd
//      __recv_event
//      bl_ble_sync_start
//      pro_trans_init
//      cJSON_New_Item
//      print_array.isra.4
//      print_object.isra.3
//      hexdump_cmd
//      aos_cli_init
//      aos_cli_printf
//      proc_onecmd
//      ls_cmd
//      cli_getchar
//      aos_cli_input_direct
//      get_dns_request
//      dns_server_init
//      write_status
//      format_sector.constprop.16
//      move_env
//      create_env_blob
//      ef_port_init
//      psm_test_cmd
//      prvInitialiseNewStreamBuffer
//      vStreamBufferDelete
//      prvInitialiseNewTask.isra.2
//      bl_wifi_ap_info_set
//      bl_wifi_sta_info_set
//      dev_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
//      loopset_led_trigger
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      dns_check_entry
//      dhcp_create_msg
//      dhcp_recv
//      dhcp_start
//      ip4_output_if_opt
//      netif_add
//      raw_new_ip_type
//      tcp_new_ip_type
//      udp_new_ip_type
//      dhcp_server_recv
//      dhcp_server_start
//      iperf_server_udp
//      iperf_server_udp_recv_fn
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      dirent_file
//      romfs_opendir
//      romfs_register
//      sntp_dns_found
//      utils_sha256_init
//      utils_hmac_sha1_fast
//      inode_init
//      aos_register_driver
//      aos_register_fs
//      aos_loop_init
//      aos_task_new
//      event_open
//      at_key_value_set
//      at_server_init
//      at_server_notify_with_ctx
//      http_url_req
//      cwjap_info
//      __wifimode_set
//      cwjap_cur
//      domain_name_resolution
//      uart_config_handler
//      at_init
//      at_parse
//      ble_sync_mode
//      ap_cfg_handler
//      join_ap_handler
//      at_join_ap
//      at_set_ap
//      get_ip_para
//      get_hex_para
//      at_queue_init
//      create_tcp_udp_handler
//      close_network_handler
//      send_data_handler
//      client_ssl_config_path
//      client_ssl_set_sni
//      client_ssl_set_alpn
//      tcp_accept_callback
//      bl_tcpserver
//      Sec_Eng_SHA256_Init
//      mfg_media_read_poweroffset
//      bl_mtd_open
//      bloop_init
//      bloop_timer_init
//      httpc_tcp_recv
//      httpc_init_connection_common.constprop.5
//      altcp_alloc
//      altcp_mbedtls_alloc_config
//      block_cipher_df
//      ctr_drbg_update_internal
//      mbedtls_ctr_drbg_init
//      mbedtls_ctr_drbg_reseed
//      mbedtls_ctr_drbg_seed
//      mbedtls_ctr_drbg_random
//      mbedtls_entropy_init
//      pk_get_pk_alg
//      mgf_mask
//      mbedtls_rsa_init
//      mbedtls_rsa_rsaes_oaep_encrypt
//      mbedtls_rsa_pkcs1_sign
//      mbedtls_rsa_rsassa_pss_verify_ext
//      mbedtls_sha256_init
//      mbedtls_ssl_session_init
//      mbedtls_ssl_init
//      mbedtls_ssl_setup
//      mbedtls_ssl_config_init
//      mbedtls_ssl_write_record
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_write_finished
//      mbedtls_ssl_parse_change_cipher_spec
//      mbedtls_x509_crt_init
//      mbedtls_x509_crt_parse_der
//      mycalloc
//      mbedtls_aes_init
//      mbedtls_mpi_copy
//      mbedtls_mpi_lset
//      mbedtls_mpi_write_binary
//      mpi_montmul
//      mbedtls_mpi_exp_mod
//      mbedtls_cipher_init
//      mbedtls_cipher_setup
//      mbedtls_cipher_auth_encrypt
//      mbedtls_debug_print_buf
//      mbedtls_debug_print_crt
//      mbedtls_ecp_group_init
//      mbedtls_ecp_mul
//      mbedtls_ecp_check_pub_priv
//      ecp_mod_p256k1
//      mbedtls_gcm_init
//      mbedtls_gcm_setkey
//      mbedtls_gcm_starts
//      mbedtls_md_init
//      mbedtls_md_hmac_starts
//      mbedtls_pem_init
//      mbedtls_pem_read_buffer
//      mbedtls_md5_init
//      mbedtls_sha1_init
//      mbedtls_ssl_handshake_server_step
//      mbedtls_x509_dn_gets
//      strstr
//      __sfmoreglue
//      __sfp
//      __sinit
Eq_2 memset(Eq_2 ra, Eq_2 a0, Eq_630 a1, Eq_2 a2, union Eq_2 & t1Out, union Eq_2 & a0Out, union Eq_630 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_638 & a5Out)
{
	Eq_2 t1_14 = 0x0F;
	Eq_2 a4_25 = a0;
	if (a2 > 0x0F)
	{
		struct Eq_638 * a5_24 = a0 & 0x0F;
		if ((a0 & 0x0F) != 0x00)
		{
			Eq_573228 a3_10 = ((a0 & 0x0F) << 0x02) + 587873052;
			word32 a4_16;
			word32 a2_17;
			word32 a5_18;
			Eq_2 t0_22;
			(*((word32) a3_10 - 96))();
			ra = t0_22;
			a5_24 = a5_18 + -16;
			a4_25 = a4_16 - (a5_18 + -16);
			a2 = a2_17 + (a5_18 + -16);
			if (t1_14 >= a2)
				goto l230A3AAC;
		}
		if (a1 != 0x00)
		{
			ui32 a1_29 = a1 & 0x00FF;
			ui32 a1_31 = a1_29 | a1_29 << 0x08;
			a1 = a1_31 | a1_31 << 0x10;
		}
		a2 &= 0x0F;
		Eq_2 a3_40 = (word32) a4_25 + (a2 & -16);
		do
		{
			*a4_25 = a1;
			*((word32) a4_25 + 4) = a1;
			*((word32) a4_25 + 8) = a1;
			*((word32) a4_25 + 0x0C) = a1;
			a4_25 = (word32) a4_25 + 16;
		} while (a4_25 < a3_40);
		if (a2 == 0x00)
		{
			t1Out = t1_14;
			a0Out = a0;
			a1Out = a1;
			a2Out = a2;
			a3Out = a3_40;
			a4Out = a4_25;
			a5Out = a5_24;
			return ra;
		}
	}
l230A3AAC:
	Eq_573206 a3_58 = (t1_14 - a2 << 0x02) + 587872948;
	Eq_2 t1_73;
	Eq_2 a0_74;
	Eq_2 a4_75;
	Eq_2 a2_76;
	struct Eq_638 * a5_77;
	Eq_630 a1_78;
	Eq_2 a3_79;
	Eq_2 ra_80;
	(*((word32) a3_58 + 0x0C))();
	t1Out = t1_73;
	a0Out = a0_74;
	a1Out = a1_78;
	a2Out = a2_76;
	a3Out = a3_79;
	a4Out = a4_75;
	a5Out = a5_77;
	return ra_80;
}

// 230A3ABC: void fn230A3ABC(Register ptr32 a3)
// Called from:
//      memset
void fn230A3ABC(ptr32 a3)
{
	(a3 + 0x0C)();
}

// 230A3AC0: void fn230A3AC0(Register word32 a1, Register (ptr32 Eq_573286) a4)
// Called from:
//      memset
void fn230A3AC0(word32 a1, struct Eq_573286 * a4)
{
	a4->b000E = (byte) a1;
	a4->b000D = (byte) a1;
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AC4: void fn230A3AC4(Register word32 a1, Register (ptr32 Eq_573348) a4)
// Called from:
//      memset
void fn230A3AC4(word32 a1, struct Eq_573348 * a4)
{
	a4->b000D = (byte) a1;
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AC8: void fn230A3AC8(Register word32 a1, Register (ptr32 Eq_573406) a4)
// Called from:
//      memset
void fn230A3AC8(word32 a1, struct Eq_573406 * a4)
{
	a4->b000C = (byte) a1;
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3ACC: void fn230A3ACC(Register word32 a1, Register (ptr32 Eq_573460) a4)
// Called from:
//      memset
void fn230A3ACC(word32 a1, struct Eq_573460 * a4)
{
	a4->b000B = (byte) a1;
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AD0: void fn230A3AD0(Register word32 a1, Register (ptr32 Eq_573510) a4)
// Called from:
//      memset
void fn230A3AD0(word32 a1, struct Eq_573510 * a4)
{
	a4->b000A = (byte) a1;
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AD4: void fn230A3AD4(Register word32 a1, Register (ptr32 Eq_573556) a4)
// Called from:
//      memset
void fn230A3AD4(word32 a1, struct Eq_573556 * a4)
{
	a4->b0009 = (byte) a1;
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AD8: void fn230A3AD8(Register word32 a1, Register (ptr32 Eq_573598) a4)
// Called from:
//      memset
void fn230A3AD8(word32 a1, struct Eq_573598 * a4)
{
	a4->b0008 = (byte) a1;
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3ADC: void fn230A3ADC(Register word32 a1, Register (ptr32 Eq_573636) a4)
// Called from:
//      memset
void fn230A3ADC(word32 a1, struct Eq_573636 * a4)
{
	a4->b0007 = (byte) a1;
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

