pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A3AE0: void fn230A3AE0(Register word32 a1, Register (ptr32 Eq_573670) a4)
// Called from:
//      memset
void fn230A3AE0(word32 a1, struct Eq_573670 * a4)
{
	a4->b0006 = (byte) a1;
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AE4: void fn230A3AE4(Register word32 a1, Register (ptr32 Eq_573700) a4)
// Called from:
//      memset
void fn230A3AE4(word32 a1, struct Eq_573700 * a4)
{
	a4->b0005 = (byte) a1;
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AE8: void fn230A3AE8(Register word32 a1, Register (ptr32 Eq_573726) a4)
// Called from:
//      memset
void fn230A3AE8(word32 a1, struct Eq_573726 * a4)
{
	a4->b0004 = (byte) a1;
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AEC: void fn230A3AEC(Register word32 a1, Register (ptr32 Eq_573748) a4)
// Called from:
//      memset
void fn230A3AEC(word32 a1, struct Eq_573748 * a4)
{
	a4->b0003 = (byte) a1;
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AF0: void fn230A3AF0(Register word32 a1, Register (ptr32 Eq_573766) a4)
// Called from:
//      memset
void fn230A3AF0(word32 a1, struct Eq_573766 * a4)
{
	a4->b0002 = (byte) a1;
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AF4: void fn230A3AF4(Register word32 a1, Register (ptr32 Eq_573780) a4)
// Called from:
//      memset
void fn230A3AF4(word32 a1, struct Eq_573780 * a4)
{
	a4->b0001 = (byte) a1;
	a4->b0000 = (byte) a1;
}

// 230A3AF8: void fn230A3AF8(Register word32 a1, Register (ptr32 byte) a4)
// Called from:
//      memset
void fn230A3AF8(word32 a1, byte * a4)
{
	*a4 = (byte) a1;
}

// 230A3B44: Register Eq_2 _init_signal_r.part.0(Register Eq_2 a0)
// Called from:
//      _init_signal_r
//      signal
//      _init_signal
//      __sigtramp
Eq_2 _init_signal_r.part.0(Eq_2 a0)
{
	Eq_2 a0_21;
	word32 a3_56;
	Eq_2 a0_11 = _malloc_r(a0, 0x0080, out a3_56);
	*((word32) a0 + 732) = a0_11;
	if (a0_11 != 0x00)
	{
		a0_23 = a0_11;
		do
		{
			Eq_2 a0_23;
			*a0_23 = 0x00;
			a0_23 = (word32) a0_23 + 4;
		} while (a0_23 != (word32) a0_11 + 0x0080);
		a0_21.u0 = 0;
	}
	else
		a0_21.u0 = -1;
	return a0_21;
}

// 230A3B90: void _init_signal_r(Register Eq_2 a0)
void _init_signal_r(Eq_2 a0)
{
	if (*((word32) a0 + 732) != 0x00)
		return;
	_init_signal_r.part.0(a0);
}

// 230A3BA4: void _signal_r(Register Eq_2 a0, Register Eq_573834 a1, Register word32 a2)
// Called from:
//      signal
void _signal_r(Eq_2 a0, Eq_573834 a1, word32 a2)
{
	if (a1 > 31)
		*a0 = 22;
	else
	{
		Eq_2 a5_19 = *((word32) a0 + 732);
		if (a5_19 == 0x00)
		{
			if (_init_signal_r.part.0(a0) != 0x00)
				return;
			a5_19 = *((word32) a0 + 732);
		}
		*((word32) a5_19 + a1 * 0x04) = a2;
	}
}

// 230A3C2C: void _raise_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_572635 a1)
// Called from:
//      raise
void _raise_r(Eq_2 ra, Eq_2 a0, Eq_572635 a1)
{
	if (a1 > 31)
		*a0 = 22;
	else
	{
		Eq_2 a5_10 = *((word32) a0 + 732);
		if (a5_10 != 0x00)
		{
			<anonymous> ** a5_21 = (word32) a5_10 + (a1 << 0x02);
			<anonymous> * a4_22 = *a5_21;
			if (a4_22 != null)
			{
				if (a4_22 == (<anonymous> *) 1)
					return;
				if (a4_22 == (<anonymous> *) -1)
				{
					*a0 = 22;
					return;
				}
				else
				{
					*a5_21 = (<anonymous> **) null;
					word32 a4_62;
					word32 a3_63;
					word32 a2_64;
					a4_22();
					return;
				}
			}
		}
		_getpid_r();
		_kill_r(a0);
	}
}

// 230A3D08: void __sigtramp_r(Register word32 ra, Register Eq_2 a0, Register Eq_573907 a1)
// Called from:
//      __sigtramp
void __sigtramp_r(word32 ra, Eq_2 a0, Eq_573907 a1)
{
	if (a1 > 31)
		return;
	Eq_2 a5_26 = *((word32) a0 + 732);
	if (a5_26 == 0x00)
	{
		if (_init_signal_r.part.0(a0) != 0x00)
			return;
		a5_26 = *((word32) a0 + 732);
	}
	<anonymous> ** a5_31 = (word32) a5_26 + (a1 << 0x02);
	<anonymous> * a4_33 = *a5_31;
	if (a4_33 == null)
		return;
	if (a4_33 == (<anonymous> *) -1)
		return;
	if (a4_33 == (<anonymous> *) 1)
		return;
	*a5_31 = (<anonymous> **) null;
	word32 a4_56;
	word32 a3_57;
	word32 a2_58;
	word32 a6_59;
	word32 a7_60;
	word32 t1_61;
	a4_33();
}

// 230A3DC0: void raise(Register Eq_2 ra, Register Eq_572635 a0)
// Called from:
//      abort
void raise(Eq_2 ra, Eq_572635 a0)
{
	Eq_2 a0_8 = g_t4200ECFC;
	_raise_r(ra, a0_8, a0);
}

// 230A3DD4: void signal(Register Eq_573834 a0, Register word32 a1)
void signal(Eq_573834 a0, word32 a1)
{
	Eq_2 a0_10 = g_t4200ECFC;
	_signal_r(a0_10, a0, a1);
}

// 230A3DEC: void _init_signal()
void _init_signal()
{
	Eq_2 a0_6 = g_t4200ECFC;
	if (*((word32) a0_6 + 732) != 0x00)
		return;
	_init_signal_r.part.0(a0_6);
}

// 230A3E0C: void __sigtramp(Register word32 ra, Register Eq_573907 a0)
void __sigtramp(word32 ra, Eq_573907 a0)
{
	Eq_2 a0_8 = g_t4200ECFC;
	__sigtramp_r(ra, a0_8, a0);
}

// 230A3E20: void _kill_r(Register Eq_2 a0)
// Called from:
//      raise
void _kill_r(Eq_2 a0)
{
	g_dw420277A8 = 0x00;
	if (_kill() != -1)
		return;
	Eq_385116 a5_22 = g_t420267A8;
	if (a5_22 == 0x00)
		return;
	*a0 = a5_22;
}

// 230A3E84: void _getpid_r()
// Called from:
//      raise
void _getpid_r()
{
	_getpid();
}

// 230A3E88: Register Eq_2 strchr(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_1869 a2Out, Register out Eq_1870 a3Out, Register out Eq_1871 a4Out, Register out Eq_1872 a5Out)
// Called from:
//      event_cb_wifi_event
//      print_string_ptr
//      proc_onecmd
//      dhcpd_start
//      dirent_file
//      strrchr
//      strstr
Eq_2 strchr(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_1869 & a2Out, union Eq_1870 & a3Out, union Eq_1871 & a4Out, union Eq_1872 & a5Out)
{
	Eq_1872 a5_13;
	Eq_1870 a3_123 = a1 & 0x00FF;
	if ((a1 & 0x00FF) == 0x00)
	{
		if ((a0 & 3) != 0x00)
		{
			Eq_1872 a5_8 = (word32) *a0;
			if (a5_8 == 0x00)
			{
				a1Out = a1;
				a2Out = a2;
				a3Out = a1 & 0x00FF;
				a4Out = a4;
				a5Out = a5_8;
				return a0;
			}
			do
			{
				a0 = (word32) a0 + 1;
				if ((a0 & 3) == 0x00)
					goto l230A3F8C;
				a5_13 = (word32) *a0;
			} while (a5_13 != 0x00);
		}
		else
		{
l230A3F8C:
			Eq_574110 a4_16 = *a0;
			a4 = ~a4_16;
			a2.u0 = ~0x01010100;
			a3_123.u0 = 0x80808080;
			if (((word32) a4_16 - 0x01010101 & a4 & 0x80808080) == 0x00)
			{
				do
				{
					a0 = (word32) a0 + 4;
					Eq_574152 a4_28 = *a0;
					a4 = ~a4_28;
				} while (((word32) a4_28 - 0x01010101 & a4 & 0x80808080) == 0x00);
			}
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				do
				{
					a0 = (word32) a0 + 1;
					Eq_1872 a5_41 = (word32) *a0;
				} while (a5_41 != 0x00);
				a1Out = a1;
				a2Out.u0 = ~0x01010100;
				a3Out.u0 = 0x80808080;
				a4Out = a4;
				a5Out = a5_41;
				return a0;
			}
		}
l230A3F64:
		a1Out = a1;
		a2Out = a2;
		a3Out = a3_123;
		a4Out = a4;
		a5Out = a5_13;
		return a0;
	}
	else
	{
		if ((a0 & 3) != 0x00)
		{
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				if ((a1 & 0x00FF) == a5_13)
				{
					a1Out = a1;
					a2Out = a2;
					a3Out = a1 & 0x00FF;
					a4Out = a4;
					a5Out = a5_13;
					return a0;
				}
				do
				{
					a0 = (byte) a0.u0 + 1;
					if ((a0 & 3) == 0x00)
						goto l230A3EC0;
					a5_13 = (word32) *a0;
					if (a5_13 == 0x00)
						goto l230A3F60;
				} while (a5_13 != (a1 & 0x00FF));
				goto l230A3F64;
			}
		}
		else
		{
l230A3EC0:
			ui32 a1_53 = a1 & 0x00FF | (a1 & 0x00FF) << 0x08;
			int32 a4_56 = *a0;
			ui32 t1_58 = a1_53 << 0x10 | a1_53;
			ui32 a2_60 = t1_58 ^ a4_56;
			a1 = ~a2_60;
			a2 = a1 & a2_60 + ~0x01010100;
			a4 = a4_56 + ~0x01010100;
			if (((~a4_56 & a4_56 + ~0x01010100 | a2) & 0x80808080) == 0x00)
			{
				do
				{
					a0 = (word32) a0 + 4;
					Eq_574075 a4_75 = *a0;
					ui32 a2_77 = a4_75 ^ t1_58;
					a4 = ~a4_75;
					a2 = a2_77 + ~0x01010100 & ~a2_77;
					a1 = a2_77 + ~0x01010100;
				} while ((((word32) a4_75 - 0x01010101 & a4 | a2) & 0x80808080) == 0x00);
			}
			a5_13 = (word32) *a0;
			if (a5_13 != 0x00)
			{
				if ((a1 & 0x00FF) != a5_13)
				{
					do
					{
						a0 = (word32) a0 + 1;
						a5_13 = (word32) *a0;
						if (a5_13 == 0x00)
							goto l230A3F60;
					} while (a5_13 != (a1 & 0x00FF));
					a1Out = a1;
					a2Out = a2;
					a3Out = a1 & 0x00FF;
					a4Out = a4;
					a5Out = a5_13;
					return a0;
				}
				goto l230A3F64;
			}
		}
l230A3F60:
		a0.u0 = 0;
		goto l230A3F64;
	}
}

// 230A3FF4: Register Eq_2 strcmp(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_100915 a2Out, Register out Eq_100915 a3Out, Register out Eq_100917 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      bl_msg_update_channel_cfg
//      stateGlobalGuard_scan_beacon
//      cmd_wifi_cfg
//      bt_set_name
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      proc_onecmd
//      ls_cmd
//      echo_cmd
//      hal_boot2_partition_bus_addr
//      hal_boot2_partition_addr
//      inode_open
//      at_key_value_set
//      at_key_value_get
//      scan_handler
//      at_parse
//      ble_sync_mode
//      create_tcp_udp_handler
//      at_scan
//      bl_cipstart
//      setlocale
Eq_2 strcmp(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_100915 & a2Out, union Eq_100915 & a3Out, union Eq_100917 & a4Out, union Eq_2 & a5Out)
{
	ui32 a4_5 = a0 | a1;
	if ((a4_5 & 3) != 0x00)
	{
l230A4100:
		do
		{
			Eq_100915 a2_60 = (word32) *a0;
			Eq_100915 a3_62 = (word32) *a1;
			a0 = (word32) a0 + 1;
			a1 = (word32) a1 + 1;
		} while (a2_60 == a3_62 && a2_60 != 0x00);
		a1Out = a1;
		a2Out = a2_60;
		a3Out = a3_62;
		a4Out = a4_5 & 3;
		a5Out = a5;
		return a2_60 - a3_62;
	}
	else
	{
		a5 = (union Eq_2 *) 0x7F7F7F7F;
		do
		{
			Eq_100915 a2_12 = *a0;
			Eq_100915 a3_14 = *a1;
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
l230A4128:
				if (a2_12 != a3_14)
					goto l230A4100;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out = (union Eq_2 *) 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 4);
			a3_14 = *((word32) a1 + 4);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 4;
				a1 = (word32) a1 + 4;
				goto l230A4128;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 8);
			a3_14 = *((word32) a1 + 8);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 8;
				a1 = (word32) a1 + 8;
				if (a2_12 != a3_14)
					goto l230A4100;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out = (union Eq_2 *) 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 0x0C);
			a3_14 = *((word32) a1 + 0x0C);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 0x0C;
				a1 = (word32) a1 + 0x0C;
				if (a2_12 != a3_14)
					goto l230A4100;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out = (union Eq_2 *) 0x7F7F7F7F;
				return 0;
			}
			if (a2_12 != a3_14)
				break;
			a2_12 = *((word32) a0 + 16);
			a3_14 = *((word32) a1 + 16);
			if (((a2_12 & 0x7F7F7F7F) + 0x7F7F7F7F | (a2_12 | 0x7F7F7F7F)) != -1)
			{
				a0 = (word32) a0 + 16;
				a1 = (word32) a1 + 16;
				if (a2_12 != a3_14)
					goto l230A4100;
				a1Out = a1;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_5 & 3;
				a5Out = (union Eq_2 *) 0x7F7F7F7F;
				return 0;
			}
			a0 = (word32) a0 + 20;
			a1 = (word32) a1 + 20;
		} while (a2_12 == a3_14);
		union Eq_2 * a5_76;
		Eq_100917 a4_75;
		Eq_2 a1_78;
		uint32 a4_72 = a2_12 << 0x10;
		uint32 a5_74 = a3_14 << 0x10;
		if (a4_72 == a5_74)
		{
			a4_75 = a2_12 >> 0x10;
			a5_76 = a3_14 >> 0x10;
			Eq_2 a0_81 = a4_75 - a5_76;
			a1_78 = a0_81 & 0x00FF;
			if ((a0_81 & 0x00FF) == 0x00)
			{
				a1Out = a0_81 & 0x00FF;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_75;
				a5Out = a5_76;
				return a0_81;
			}
		}
		else
		{
			Eq_2 a0_77 = (a4_72 >> 0x10) - (a5_74 >> 0x10);
			a4_75 = a4_72 >> 0x10;
			a5_76 = a5_74 >> 0x10;
			a1_78 = a0_77 & 0x00FF;
			if ((a0_77 & 0x00FF) == 0x00)
			{
				a1Out = a0_77 & 0x00FF;
				a2Out = a2_12;
				a3Out = a3_14;
				a4Out = a4_72 >> 0x10;
				a5Out = a5_74 >> 0x10;
				return a0_77;
			}
		}
		a1Out = a1_78;
		a2Out = a2_12;
		a3Out = a3_14;
		Eq_100917 a4_84 = a4_75 & 0x00FF;
		a4Out = a4_84;
		union Eq_2 * a5_86 = a5_76 & 0x00FF;
		a5Out = a5_86;
		return a4_84 - a5_86;
	}
}

// 230A4170: Register Eq_2 strcpy(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_735 a4Out, Register out Eq_2 a5Out)
// Called from:
//      wifiprov_wifi_state_get
//      bt_addr_le_str_real
//      bt_addr_le_to_str.constprop.14
//      cmd_blog_info_dump
//      print_number
//      print_string_ptr
//      print_array.isra.4
//      print_object.isra.3
//      ps_cmd
//      aos_cli_printf
//      vTaskList
//      bl_chip_memory_ram
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      at_key_value_get
//      cipsta_ip_get
//      http_url_req
//      cb_altcp_recv_fn
//      set_apcfg
//      at_join_ap
//      bl_cipsslcsni
//      bl_mtd_info
Eq_2 strcpy(Eq_2 a0, Eq_2 a1, union Eq_735 & a4Out, union Eq_2 & a5Out)
{
	if (((a0 | a1) & 3) != 0x00)
	{
		Eq_2 a5_11 = a0;
		do
		{
			Eq_735 a4_10 = (word32) *a1;
			a5_11 = (word32) a5_11 + 1;
			*((word32) a5_11 + 0x0FFF) = (byte) a4_10;
			a1 = (word32) a1 + 1;
		} while (a4_10 != 0x00);
		a4Out = a4_10;
		a5Out = a5_11;
		return a1;
	}
	else
	{
		Eq_2 a2_24;
		int32 a4_16 = *a1;
		if (((a4_16 & 0x7F7F7F7F) + 0x7F7F7F7F | a4_16 | 0x7F7F7F7F) == -1)
		{
			a2_24 = a0;
			do
			{
				a2_24 = (word32) a2_24 + 4;
				*((word32) a2_24 + 0x0FFC) = a4_16;
				a1 = (word32) a1 + 4;
				a4_16 = (int32) *a1;
			} while (((a4_16 & 0x7F7F7F7F) + 0x7F7F7F7F | a4_16 | 0x7F7F7F7F) == -1);
		}
		else
			a2_24 = a0;
		Eq_2 a5_42 = (word32) *a1;
		Eq_735 a4_43 = (word32) *((word32) a1 + 1);
		word32 a3_44 = (word32) *((word32) a1 + 2);
		*a2_24 = (byte) a5_42;
		if (a5_42 != 0x00)
		{
			*((word32) a2_24 + 1) = (byte) a4_43;
			if (a4_43 != 0x00)
			{
				*((word32) a2_24 + 2) = (byte) a3_44;
				if (a3_44 != 0x00)
				{
					*((word32) a2_24 + 3) = 0x00;
					a4Out = a4_43;
					a5Out = a5_42;
					return a1;
				}
			}
		}
		a4Out = a4_43;
		a5Out = a5_42;
		return a1;
	}
}

