pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A4220: Register Eq_2 strlen(Register Eq_2 a0, Register out Eq_1905 a1Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_2 a4Out, Register out Eq_1909 a5Out)
// Called from:
//      event_cb_wifi_event
//      app_delayed_action_bleadv
//      app_delayed_action_bleadvstop
//      mm_sta_add
//      set_psk
//      pmkCacheFindPSK
//      KeyMgmtInit
//      GenerateGTK_internal
//      cm_SetComData
//      ap_setpsk
//      InitializeAp
//      bl_send_apm_start_req
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_api_ap_start
//      wifi_ap_sta_delete_cmd
//      cb_scan_item_parse
//      wifi_mgmr_sta_connect_ind_stat_get
//      wifi_mgmr_sta_ssid_set
//      wifi_mgmr_sta_psk_set
//      wifi_mgmr_sta_connect
//      wifi_mgmr_scan_ap_all
//      blemesh_input_str
//      blemesh_input_num
//      blemesh_fault_set
//      beacon_send
//      bt_mesh_s1
//      bt_mesh_k1
//      bt_mesh_proxy_adv_start
//      read_name
//      le_adv_update
//      bt_set_name
//      ble_start_advertise
//      ble_set_device_name
//      fdt_get_name
//      fdt_subnode_offset
//      fdt_getprop
//      utilfdt_print_data
//      tc_blfdtdump
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      blog_hexdump_out
//      cJSON_strdup
//      update
//      print_array.isra.4
//      print_object.isra.3
//      cli_putstr
//      ps_cmd
//      aos_cli_printf
//      ls_cmd
//      aos_cli_input_direct
//      find_env_cb
//      find_env
//      del_env
//      create_env_blob
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      ef_env_set_default
//      vTaskList
//      hal_board_cfg
//      dns_check_entry
//      dns_gethostbyname
//      dhcp_option_hostname.isra.0
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      romfs_ioctl
//      romfs_read
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_open
//      romfs_register
//      Bl_F_fast.constprop.0
//      utils_wifi_psk_cal_fast_bin
//      aos_open
//      inode_open
//      inode_reserve
//      cb_altcp_recv_fn
//      scan
//      set_apcfg
//      cwjap_cur
//      at_join_ap
//      at_set_ap
//      client_ssl_set_sni
//      client_ssl_set_alpn
//      bl_cipsslcsni
//      Default_Handler
//      httpc_create_request_string.constprop.6
//      tls_prf_sha256
//      mbedtls_ssl_set_hostname
//      mbedtls_ssl_conf_alpn_protocols
//      mbedtls_ssl_free
//      x509_check_wildcard
//      mbedtls_x509_crt_verify_with_profile
//      mbedtls_pem_read_buffer
//      mbedtls_ssl_handshake_client_step
//      mbedtls_ssl_handshake_server_step
//      strstr
Eq_2 strlen(Eq_2 a0, union Eq_1905 & a1Out, ptr32 & a2Out, word32 & a3Out, union Eq_2 & a4Out, union Eq_1909 & a5Out)
{
	Eq_2 a4_17 = a0;
	if ((a0 & 3) != 0x00)
	{
		do
		{
			a4_17 = (word32) a4_17 + 1;
			Eq_1909 a5_8 = (word32) *a4_17;
			if (a5_8 == 0x00)
			{
				a1Out = a1;
				a2Out = a2;
				a3Out = a4_17 & 3;
				Eq_2 a4_12 = a4_17 - a0;
				a4Out = a4_12;
				a5Out = a5_8;
				return (word32) a4_12 - 1;
			}
		} while ((a4_17 & 3) != 0x00);
	}
	do
	{
		a4_17 = (word32) a4_17 + 4;
		int32 a2_20 = *((word32) a4_17 - 4);
	} while (((a2_20 & 0x7F7F7F7F) + 0x7F7F7F7F | a2_20 | 0x7F7F7F7F) == -1);
	word32 * a3_27 = (word32) *((word32) a4_17 - 4);
	Eq_1909 a5_30 = a4_17 - a0;
	ptr32 a2_31 = (word32) *((word32) a4_17 - 3);
	word32 a0_32 = (word32) *((word32) a4_17 - 2);
	if (a3_27 == null)
	{
		a1Out.u0 = -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 - 4;
	}
	else if (a2_31 == 0x00)
	{
		a1Out.u0 = -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 - 3;
	}
	else
	{
		a1Out.u0 = -1;
		a2Out = a2_31;
		a3Out = a3_27;
		a4Out = a4_17;
		a5Out = a5_30;
		return (word32) a5_30 + (word32) (a0_32 != 0x00) + -2;
	}
}

// 230A42AC: Register Eq_2 strncmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_338875 a3Out, Register out Eq_338875 a4Out, Register out Eq_338875 a5Out)
// Called from:
//      parse_value
//      proc_onecmd
//      aos_cli_input_direct
//      find_env_cb
//      find_env
//      romfs_open
//      inode_open
Eq_2 strncmp(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_338875 & a3Out, union Eq_338875 & a4Out, union Eq_338875 & a5Out)
{
	if (a2 != 0x00)
	{
		Eq_574536 a2_43;
		ui32 a5_6 = a0 | a1;
		a5 = a5_6 & 3;
		if ((a5_6 & 3) == 0x00)
		{
			a5.u0 = 3;
			if (a2 > 3)
			{
				a5 = *a0;
				a4 = *a1;
				if (a5 == a4)
				{
					a2 = (word32) a2 - 4;
					if (a2 != ~0x03)
					{
						ui32 a5_18 = (word32) a5 - 0x01010101 & ~a5;
						a4 = (word32) a5 - 0x01010101;
						a5 = a5_18 & 0x80808080;
						if ((a5_18 & 0x80808080) == 0x00)
						{
							do
							{
								a0 = (word32) a0 + 4;
								a1 = (word32) a1 + 4;
								if (a2 <= 3)
									goto l230A4338;
								a4 = *a0;
								ui32 a5_34 = (word32) a4 - 0x01010101 & ~a4;
								a3 = *a1;
								a5 = a5_34 & 0x80808080;
								if (a4 != a3)
									goto l230A4388;
								a2 = (word32) a2 - 4;
							} while (a2 != 0x00 && (a5_34 & 0x80808080) == 0x00);
						}
					}
					goto l230A4380;
				}
l230A4388:
				a4 = (word32) *a0;
				a3 = (word32) *a1;
				a2_43 = (word32) a2 - 1;
				if (a3 != a4)
				{
l230A4378:
					a3Out = a3;
					a4Out = a4;
					a5Out = a5;
					return a4 - a3;
				}
				goto l230A434C;
			}
		}
l230A4338:
		a4 = (word32) *a0;
		a3 = (word32) *a1;
		a2_43 = (word32) a2 - 1;
		if (a3 != a4)
			goto l230A4378;
		if (a2_43 != 0x00)
		{
l230A434C:
			if (a4 != 0x00)
			{
				a5 = (word32) a0 + 1;
				word32 a2_56 = a0 + a2_43;
				do
				{
					a1 = (word32) a1 + 1;
					a4 = (word32) *a5;
					a3 = (word32) *a1;
					if (a4 != a3)
						goto l230A4378;
					if (a2_56 == a5)
						break;
					a5 = (word32) a5 + 1;
				} while (a4 != 0x00);
			}
			goto l230A4380;
		}
	}
l230A4380:
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return 0;
}

// 230A439C: Register Eq_2 strncpy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a2Out, Register out Eq_1652 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      event_cb_wifi_event
//      stateGlobalGuard_scan_beacon
//      wifi_mgmr_set_country_code_internal
//      bt_mesh_input_string
//      bt_set_name
//      blog_hexdump_out
//      aos_cli_input_direct
//      move_env
//      lwip_gethostbyname
//      romfs_readdir
//      get_bytearray_from_string
//      aos_task_new
//      bl_cipstart
//      bl_mtd_open
Eq_2 strncpy(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a2Out, union Eq_1652 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_25;
	ui32 a5_5 = a1 | a0;
	Eq_2 a5_24 = a5_5 & 3;
	if ((a5_5 & 3) == 0x00)
	{
		a5_24.u0 = 3;
		a4_25 = a0;
		while (a2 > 3)
		{
			a3 = *a1;
			ui32 a5_22 = (word32) a3 - 0x01010101 & ~a3;
			a5_24 = a5_22 & 0x80808080;
			if ((a5_22 & 0x80808080) != 0x00)
				goto l230A43B8;
			a4_25 += 4;
			*((word32) a4_25 + 0x0FFC) = a3;
			a2 = (word32) a2 - 4;
			a1 = (word32) a1 + 4;
		}
	}
	else
		a4_25 = a0;
	if (a2 != 0x00)
	{
l230A43B8:
		Eq_1652 a6_46;
		word32 a6_38 = (word32) *a1;
		*a4_25 = (byte) a6_38;
		a3 = (word32) a2 - 1;
		a1 = (word32) a1 + 1;
		a5_24 = (word32) a4_25 + 1;
		if (a6_38 != 0x00)
		{
			a2 = a4_25 + a2;
			a3 = a4_25 + a3;
			do
			{
				a1 = (word32) a1 + 1;
				a6_46 = a3 - a5_24;
				if (a5_24 == a2)
				{
					a2Out = a2;
					a3Out = a3;
					a4Out = a4_25;
					a5Out = a5_24;
					return a1;
				}
				a4_25 = (word32) *((word32) a1 - 1);
				++a5_24;
				*((word32) a5_24 + 0x0FFF) = (byte) a4_25;
			} while (a4_25 != 0x00);
		}
		else
			a6_46 = a3;
		a4_25 = a5_24 + a6_46;
		if (a6_46 == 0x00)
		{
			a2Out = a2;
			a3Out = a3;
			a4Out = a4_25;
			a5Out = a5_24;
			return a1;
		}
		do
		{
			++a5_24;
			*((word32) a5_24 + 0x0FFF) = 0x00;
		} while (a5_24 != a4_25);
	}
	a2Out = a2;
	a3Out = a3;
	a4Out = a4_25;
	a5Out = a5_24;
	return a1;
}

// 230A4468: Register Eq_2 strnlen(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out Eq_2 a5Out)
// Called from:
//      fdt_stringlist_count
//      fdt_stringlist_get
//      flt
//      two_way_long_needle
//      strstr
Eq_2 strnlen(Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, union Eq_2 & a3Out, byte & a4Out, union Eq_2 & a5Out)
{
	if (a1 != 0x00)
	{
		a5 = (word32) *a0;
		if (a5 != 0x00)
		{
			a3 = a0 + a1;
			a5 = a0;
			do
			{
				a5 = (word32) a5 + 1;
				if (a5 == a3)
					goto l230A4490;
				a4 = (word32) *a5;
			} while (a4 != null);
			Eq_2 a1_16 = a5 - a0;
			a1Out = a1_16;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			return a1_16;
		}
		a1.u0 = 0;
	}
l230A4490:
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return a1;
}

