pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A44AC: Register Eq_2 strrchr(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a5Out)
// Called from:
//      fdt_get_name
Eq_2 strrchr(Eq_2 a0, Eq_2 a1, ptr32 & a5Out)
{
	if (a1 == 0x00)
	{
		ptr32 a5_8;
		word32 a1_71;
		word32 a2_72;
		word32 a3_73;
		word32 a4_74;
		Eq_2 a0_9 = strchr(a0, a1, out a1_71, out a2_72, out a3_73, out a4_74, out a5_8);
		a5Out = a5_8;
		return a0_9;
	}
	else
	{
		Eq_2 a5_22 = a0;
		Eq_2 s1_23 = 0;
		while (true)
		{
			ptr32 a5_31;
			word32 a1_67;
			word32 a2_68;
			word32 a3_69;
			word32 a4_70;
			Eq_2 a0_32 = strchr(a5_22, a1, out a1_67, out a2_68, out a3_69, out a4_70, out a5_31);
			if (a0_32 == 0x00)
				break;
			a5_22 = (word32) a0_32 + 1;
			s1_23 = a0_32;
		}
		a5Out = a5_31;
		return s1_23;
	}
}

// 230A4504: Register Eq_2 two_way_long_needle(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      strstr
Eq_2 two_way_long_needle(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s10_221 = a1;
	Eq_2 s7_125 = 1;
	Eq_2 a3_39 = 1;
	Eq_2 a2_40 = 0;
	Eq_2 s11_41 = -1;
l230A455C:
	word32 a5_48 = a3_39 + a2_40;
	word32 a4_46 = a2 + s11_41 + a3_39;
	word32 a1_49 = a2 + a5_48;
	while (a5_48 < a3)
	{
		up32 a1_53 = (word32) *a1_49;
		up32 a4_55 = (word32) *a4_46;
		if (a1_53 >= a4_55)
		{
			if (a1_53 != a4_55)
			{
				s11_41 = a2_40;
				s7_125.u0 = 1;
				a2_40 = (word32) a2_40 + 1;
				a3_39.u0 = 1;
			}
			else if (a3_39 != s7_125)
				a3_39 = (byte) a3_39.u0 + 1;
			else
			{
				a2_40 = a5_48;
				a3_39.u0 = 1;
			}
			goto l230A455C;
		}
		a5_48 = (word32) a5_48 + 1;
		a2_40 = a5_48;
		a3_39.u0 = 1;
		s7_125 = a5_48 - s11_41;
		a4_46 = a2 + s11_41 + 1;
		a1_49 = a2 + a5_48;
	}
	Eq_2 a7_103 = 1;
	Eq_2 a3_100 = 1;
	Eq_2 a2_101 = 0;
	Eq_2 a1_102 = -1;
l230A45AC:
	word32 a5_113 = a3_100 + a2_101;
	word32 a4_112 = a2 + a1_102 + a3_100;
	word32 a0_114 = a2 + a5_113;
	while (a5_113 < a3)
	{
		up32 a0_92 = (word32) *a0_114;
		up32 a4_94 = (word32) *a4_112;
		if (a4_94 >= a0_92)
		{
			if (a0_92 != a4_94)
			{
				a1_102 = a2_101;
				a7_103.u0 = 1;
				a2_101 = (word32) a2_101 + 1;
				a3_100.u0 = 1;
			}
			else if (a3_100 != a7_103)
				a3_100 = (byte) a3_100.u0 + 1;
			else
			{
				a2_101 = a5_113;
				a3_100.u0 = 1;
			}
			goto l230A45AC;
		}
		a5_113 = (word32) a5_113 + 1;
		a2_101 = a5_113;
		a3_100.u0 = 1;
		a7_103 = a5_113 - a1_102;
		a4_112 = a2 + a1_102 + 1;
		a0_114 = a2 + a5_113;
	}
	Eq_2 a1_117 = (word32) a1_102 + 1;
	Eq_2 s11_122 = (word32) s11_41 + 1;
	if (a1_117 >= s11_122)
	{
		s7_125 = a7_103;
		s11_122 = a1_117;
	}
	word32 * a5_134 = fp + -0x0440;
	do
	{
		*a5_134 = (word32) a3;
		++a5_134;
	} while (fp + -64 != a5_134);
	word32 a1_145 = a2 + a3;
	Eq_2 a4_146 = a2;
	word32 a2_147 = (word32) a2 + ((word32) a3 - 1);
	if (a3 != 0x00)
	{
		do
		{
			(fp + -64 + ((word32) (*a4_146) << 0x02))->dw0C00 = a2_147 - a4_146;
			a4_146 = (word32) a4_146 + 1;
		} while (a4_146 != a1_145);
	}
	Eq_2 a4_1194;
	Eq_2 a5_1204;
	Eq_2 a0_1153;
	word32 a4_1274;
	word32 a2_1273;
	word32 a5_1275;
	Eq_2 a3_1181;
	Eq_2 a1_1154;
	if (memcmp(a2, a2 + s7_125, s11_122, out a1_1154, out a2_1273, out a3_1181, out a4_1274, out a5_1275) == 0x00)
	{
		word32 s5_332 = s11_122 + -1;
		word32 a5_343 = a0 + s5_332;
		word32 a5_347 = a2 + s5_332;
		Eq_2 s6_349 = 0;
		Eq_2 s8_350 = 0;
		int32 s4_352 = 1 - s11_122;
		do
		{
			word32 a2_356 = a0 + s8_350;
			a4_1194 = fp + -64;
			a5_1204 = (fp + -64 + ((word32) (*((word32) a2_356 + ((word32) a3 - 1))) << 0x02))->tFFFFFC00;
			if (a5_1204 != 0x00)
			{
				if (s6_349 != 0x00 && a5_1204 < s7_125)
					a5_1204 = a3 - s7_125;
l230A46B8:
				s8_350 += a5_1204;
				s6_349.u0 = 0;
				goto l230A46C0;
			}
			a5_1204 = s6_349;
			if (s6_349 < s11_122)
				a5_1204 = s11_122;
			if (a5_1204 < (word32) a3 - 1)
			{
				word32 a3_375 = a0 + a5_1204 + s8_350;
				a4_1194 = a2 + a5_1204;
				do
				{
					if ((word32) *a3_375 != (word32) (*a4_1194))
					{
						s8_350 = (word32) s8_350 + s4_352;
						goto l230A46B8;
					}
					++a5_1204;
					a3_375 = a2 + a5_1204;
					a4_1194 = a0 + (a5_1204 + s8_350);
				} while (a5_1204 < (word32) a3 - 1);
			}
			a3_1181 = s5_332;
			if (s6_349 < s11_122)
			{
				a4_1194 = (word32) *((word32) s8_350 + a5_343);
				a5_1204 = (word32) *a5_347;
				if (a4_1194 != a5_1204)
					goto l230A495C;
				while (true)
				{
					a4_1194 = a3_1181 + -1;
					a1_1154 = a2 + a4_1194;
					a5_1204 = a0 + (a4_1194 + s8_350);
					if (s6_349 == a3_1181)
						break;
					a1_1154 = (word32) *a1_1154;
					a5_1204 = (word32) *a5_1204;
					if (a1_1154 != a5_1204)
						break;
					a3_1181 = a4_1194;
				}
				if (a3_1181 >= (byte) s6_349.u0 + 1)
					goto l230A47E8;
l230A4968:
				a0_1153 = a2_356;
				goto l230A46E4;
			}
l230A495C:
			a3_1181 = s11_122;
			if (s11_122 < (byte) s6_349.u0 + 1)
				goto l230A4968;
l230A47E8:
			s8_350 += s7_125;
			s6_349 = a3 - s7_125;
l230A46C0:
			if (s10_221 - a3 >= s8_350)
				continue;
			word32 a5_1276;
			s10_221 += strnlen(a0 + s10_221, a3 | 0x0800, out a1_1154, out a3_1181, out a4_1194, out a5_1276);
			a5_1204 = s10_221 - a3;
		} while (a5_1204 >= s8_350);
l230A46E0:
		a0_1153.u0 = 0;
		goto l230A46E4;
	}
	Eq_2 s7_186 = a3 - s11_122;
	if (s7_186 < s11_122)
		s7_186 = s11_122;
	word32 s5_189 = s11_122 + -1;
	word32 a5_192 = a2 + s5_189;
	word32 s7_196 = s7_186 + 1;
	Eq_2 s8_197 = 0;
	word32 s6_202 = s11_122 + -2;
	int32 s4_203 = 1 - s11_122;
l230A4840:
	a1_1154 = a0 + s8_197;
	Mem211 = Mem201;
	int32 a5_217 = (fp + -64 + ((word32) (*((word32) a1_1154 + ((word32) a3 - 1))) << 0x02))->dwFFFFFC00;
	while (a5_217 != 0x00)
	{
		s8_197 = (word32) s8_197 + a5_217;
l230A4864:
		Mem239 = Mem201;
		if (s10_221 - a3 >= s8_197)
			goto l230A4840;
		word32 a5_1277;
		s10_221 += strnlen(a0 + s10_221, a3 | 0x0800, out a1_1154, out a3_1181, out a4_1194, out a5_1277);
		a5_1204 = s10_221 - a3;
		if (a5_1204 < s8_197)
			goto l230A46E0;
		a1_1154 = a0 + s8_197;
		a5_217 = (fp + -64 + ((word32) (*((word32) a1_1154 + ((word32) a3 - 1))) << 0x02))->dwFFFFFC00;
	}
	a4_1194 = fp + -64;
	Mem256 = Mem201;
	if (s11_122 < (word32) a3 - 1)
	{
		Eq_2 a5_259 = s11_122;
		if (CONVERT(Mem256[a1_1154 + s11_122:byte], byte, word32) == CONVERT(Mem256[a2 + s11_122:byte], byte, word32))
		{
			do
			{
				++a5_259;
				word32 a2_265 = a2 + a5_259;
				a4_1194 = a0 + (s8_197 + a5_259);
				if (a5_259 >= (word32) a3 - 1)
					goto l230A48E4;
			} while ((word32) *a2_265 == (word32) (*a4_1194));
		}
		a3_1181 = (word32) s8_197 + s4_203;
		s8_197 = a3_1181 + a5_259;
	}
	else
	{
l230A48E4:
		a5_1204.u0 = -1;
		if (s5_189 == (byte *) -1)
		{
l230A4970:
			a0_1153 = a1_1154;
l230A46E4:
			a1Out = a1_1154;
			a3Out = a3_1181;
			a4Out = a4_1194;
			a5Out = a5_1204;
			return a0_1153;
		}
		if (CONVERT(Mem256[a1_1154 + s5_189:byte], byte, word32) == CONVERT(Mem256[a5_192 + 0x00:byte], byte, word32))
		{
			a5_1204 = a2 + s6_202;
			a4_1194 = a0 + (s8_197 + s6_202);
			do
			{
				if (a5_1278 == (word32) a2 - 1)
					goto l230A4970;
				a5_1204 = (word32) a5_1278 - 1;
				a4_1194 = (word32) a4_1279 - 1;
				a5_1278 = a5_1204;
				a4_1279 = a4_1194;
			} while ((word32) *a5_1278 == (word32) (*a4_1279));
		}
		s8_197 += s7_196;
	}
	goto l230A4864;
}

// 230A4978: Register Eq_2 strstr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a1Out, Register out (ptr32 Eq_330406) a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      cmd_blog_info_dump
//      ota_tcp_cmd
//      http_url_req
//      mbedtls_x509_crt_parse
//      mbedtls_pem_read_buffer
Eq_2 strstr(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_2 & a1Out, struct Eq_330406 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a1_104 = (word32) *a1;
	Eq_2 s0_121 = a0;
	if (a1_104 == 0x00)
	{
l230A4A9C:
		a1Out = a1_104;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s0_121;
	}
	else
	{
		a3 = (word32) *((word32) a1 + 1);
		if (a3 == null)
		{
			word32 a2_407;
			s0_121 = strchr(a0, a1_104, out a1_104, out a2_407, out a3, out a4, out a5);
			goto l230A4A9C;
		}
		ui32 a2_34 = (word32) *((word32) a1 + 2);
		if (a2_34 != 0x00)
		{
			a4 = (word32) *((word32) a1 + 3);
			if (a4 != 0x00)
			{
				if ((word32) *((word32) a1 + 4) != 0x00)
				{
					word32 a3_410;
					word32 a5_412;
					word32 a1_408;
					word32 a2_409;
					word32 a4_411;
					Eq_2 a0_94 = strlen(a1, out a1_408, out a2_409, out a3_410, out a4_411, out a5_412);
					Eq_2 a0_103 = strnlen(a0, a0_94 | 0x0200, out a1_104, out a3, out a4, out a5);
					if (a0_103 >= a0_94)
					{
						if (a0_94 <= 0x00FE)
						{
							word32 a4_416;
							word32 a5_417;
							word32 a0_414;
							word32 a2_415;
							word32 t1_413;
							memset(ra, fp + -96, (word32) a0_94 + 1, 64, out t1_413, out a0_414, out a1_104, out a2_415, out a3, out a4_416, out a5_417);
							word32 s3_126 = a0 + (a0_103 - a0_94);
							if (a0_94 != 0x00)
							{
								Eq_2 a4_137 = a1;
								a1_104 = a0_94 + a1;
								word32 a2_139 = a1 + (a0_94 & 0x00FF);
								do
								{
									a3 = a2_139 - a4_137;
									(fp + -32 + ((word32) (*a4_137) & 63))->b0FC0 = (byte) a3;
									++a4_137;
								} while (a1_104 != a4_137);
							}
							do
							{
								word32 s0_155 = s0_121 + -1;
								a4 = fp + -32;
								for (s0_121 = s0_155 + CONVERT(Mem231[((fp + -32) + (CONVERT(Mem231[s0_155 + a0_94:byte], byte, word32) & 63)) + -64:byte], byte, word32); s3_126 >= s0_121; s0_121 += s4_180)
								{
									word32 s4_180 = CONVERT(Mem231[fp + -32 + (CONVERT(Mem231[s0_121 + a0_94:byte], byte, word32) & 63) + -64:byte], byte, word32);
									word32 a2_418;
									if (memcmp(s0_121, a1, a0_94, out a1_104, out a2_418, out a3, out a4, out a5) == 0x00)
										goto l230A4A9C;
								}
								word32 a0_191 = s3_126 + a0_94;
								a5 = (word32) *a0_191;
								if (a5 == 0x00)
									goto l230A4B4C;
								s3_126 += strnlen(a0_191, 0x0800, out a1_104, out a3, out a4, out a5);
							} while (s3_126 >= s0_121);
							s0_121.u0 = 0;
						}
						else
							s0_121 = two_way_long_needle(a0, a0_103, a1, a0_94, out a1_104, out a3, out a4, out a5);
						goto l230A4A9C;
					}
				}
				else
				{
					a1_104 <<= 0x18;
					a3 = (word32) *a0;
					a5 = a1_104 << 0x18 | a3 << 0x10 | a4 | a2_34 << 0x08;
					if (a3 != null)
					{
						a4.u0 = 0;
						while (true)
						{
							a4 = a3 | a4 << 0x08;
							a3 = (word32) *((byte) s0_121.u0 + 1);
							word32 a2_88 = s0_121 + 1;
							if (a3 == null)
								break;
							if (a5 == a4)
								goto l230A4BD4;
							s0_121 = a2_88;
						}
						if (a5 == a4)
						{
l230A4BD4:
							s0_121 += -3;
							goto l230A4A9C;
						}
					}
				}
			}
			else
			{
				a4 = (word32) *a0;
				a1_104 = a3 << 0x10;
				a5 = a1_104 << 0x18 | a3 << 0x10 | a2_34 << 0x08;
				if (a4 != 0x00)
				{
					a4 <<= 0x08;
					Eq_2 a2_59 = (word32) a0 + 1;
					a3 = (word32) *((word32) a0 + 1);
					while (true)
					{
						ui32 a4_63 = a3 | a4;
						a4 = a4_63 << 0x08;
						if (a3 == null)
							break;
						a1_104 = (word32) a2_59 + 1;
						a3 = (word32) *((word32) a2_59 + 1);
						if (a5 == a4_63 << 0x08)
						{
							s0_121 = a2_59 + -2;
							goto l230A4A9C;
						}
						a2_59 = a1_104;
					}
				}
			}
		}
		else
		{
			a5 = (word32) *a0;
			a1_104 = a1_104 << 0x10 | a3;
			if (a5 != 0x00)
			{
				a3 = (word32) a0 + 1;
				a4 = (word32) *((word32) a0 + 1);
				while (true)
				{
					a5 = a4 | a5 << 0x10;
					if (a4 == 0x00)
						break;
					struct Eq_330406 * a2_45 = a3 + 1;
					a4 = (word32) a3[1];
					if (a1_104 == a5)
					{
						s0_121 = (char *) a3 - 1;
						goto l230A4A9C;
					}
					a3 = a2_45;
				}
			}
		}
l230A4B4C:
		s0_121.u0 = 0;
		goto l230A4A9C;
	}
}

