pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A4BF8: Register Eq_2 _strtol_l.isra.0(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_344856 a3, Register out Eq_2 a1Out, Register out Eq_344856 a3Out, Register out Eq_2 a4Out, Register out Eq_575486 a5Out)
// Called from:
//      _strtol_r
//      strtol_l
//      strtol
Eq_2 _strtol_l.isra.0(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_344856 a3, union Eq_2 & a1Out, union Eq_344856 & a3Out, union Eq_2 & a4Out, union Eq_575486 & a5Out)
{
	Eq_2 t1_11 = a1;
	while (true)
	{
		Eq_2 a4_125 = (word32) t1_11 + 1;
		Eq_575491 a5_17 = (word32) *((word32) a4_125 - 1);
		if (((word32) *((word32) a5_17.u0 + 588035505) & 8) == 0x00)
			break;
		t1_11 = a4_125;
	}
	Eq_575491 a6_183;
	Eq_344856 t6_46;
	int32 s0_25;
	if (a5_17 != 45)
	{
		if (a5_17 == 43)
		{
			a6_183 = (word32) *a4_125;
			s0_25 = 0;
			a4_125 = (word32) t1_11 + 2;
			if (a3 != 0x00)
			{
l230A4C50:
				t6_46 = a3;
				if (a3 != 16)
					goto l230A4C5C;
				if (a6_183 != 48 || ((word32) (*a4_125) & 223) != 88)
				{
					t6_46.u0 = 16;
					goto l230A4C5C;
				}
l230A4D80:
				a6_183 = (word32) *((word32) a4_125 + 1);
				t6_46.u0 = 16;
				a4_125 = (word32) a4_125 + 2;
				a3.u0 = 16;
				goto l230A4C5C;
			}
l230A4CD4:
			if (a6_183 != 48)
			{
				t6_46.u0 = 0x0A;
				a3.u0 = 0x0A;
			}
			else
			{
				if (((word32) *a4_125 & 223) == 88)
					goto l230A4D80;
				t6_46.u0 = 8;
				a3.u0 = 8;
			}
l230A4C5C:
			Eq_2 t0_122 = 0x80000000;
			if (s0_25 == 0x00)
				t0_122.u0 = 0x7FFFFFFF;
			Eq_344856 s1_78 = t0_122 & t6_46;
			int32 a7_158 = 0;
			Eq_2 a0_108 = 0;
			Eq_2 t4_84 = t0_122 >> t6_46;
l230A4C84:
			Eq_344856 a5_166 = (word32) a6_183 - 48;
			if (a5_166 > 9)
			{
				if (a6_183 > -90)
				{
					if (a6_183 <= -122)
					{
						a5_166 = (word32) a6_183 - 87;
						if (a5_166 < a3)
						{
l230A4C9C:
							if (a7_158 != -1)
							{
								a7_158 = -1;
								if (t4_84 >= a0_108 && (t4_84 != a0_108 || s1_78 >= a5_166))
								{
									a7_158 = 1;
									a0_108 = a5_166 + (t6_46 + a0_108);
								}
							}
							a4_125 = (word32) a4_125 + 1;
							a6_183 = (word32) *((word32) a4_125 - 1);
							goto l230A4C84;
						}
					}
l230A4CF8:
					Eq_575486 a5_100 = -1;
					if (a7_158 != -1)
					{
						if (s0_25 != 0x00)
							a0_108 = 0x00 - a0_108;
						if (a2 != null)
						{
							if (a7_158 == 0x00)
								goto l230A4D10;
							t0_122 = a0_108;
l230A4D3C:
							a1 = (word32) a4_125 - 1;
							a0_108 = t0_122;
l230A4D10:
							*a2 = (union Eq_2 *) a1;
							goto l230A4D14;
						}
					}
					else
					{
						*a0 = 0x0022;
						a5_100.u0 = 0x0022;
						a0_108 = t0_122;
						if (a2 != null)
							goto l230A4D3C;
					}
l230A4D14:
					a1Out = a1;
					a3Out = a3;
					a4Out = a4_125;
					a5Out = a5_100;
					return a0_108;
				}
				a5_166 = (word32) a6_183 - 55;
			}
			if (a5_166 < a3)
				goto l230A4C9C;
			goto l230A4CF8;
		}
		a6_183 = a5_17;
		s0_25 = 0;
	}
	else
	{
		a6_183 = (word32) *a4_125;
		s0_25 = 1;
		a4_125 = (word32) t1_11 + 2;
	}
	if (a3 != 0x00)
		goto l230A4C50;
	goto l230A4CD4;
}

// 230A4DB0: void _strtol_r(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_344856 a3)
// Called from:
//      _atoi_r
void _strtol_r(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_344856 a3)
{
	word32 a1_21;
	word32 a3_22;
	word32 a4_23;
	word32 a5_24;
	_strtol_l.isra.0(a0, a1, a2, a3, out a1_21, out a3_22, out a4_23, out a5_24);
}

// 230A4DB4: void strtol_l(Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_344856 a2)
void strtol_l(Eq_2 a0, union Eq_2 * a1, Eq_344856 a2)
{
	Eq_2 a0_12 = g_t4200ECFC;
	word32 a1_27;
	word32 a3_28;
	word32 a4_29;
	word32 a5_30;
	_strtol_l.isra.0(a0_12, a0, a1, a2, out a1_27, out a3_28, out a4_29, out a5_30);
}

// 230A4DD0: Register Eq_2 strtol(Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_344856 a2, Register out ptr32 a1Out, Register out (ptr32 Eq_2) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mmem_cmd
//      pmem_cmd
//      get_bytearray_from_string
//      atoi
Eq_2 strtol(Eq_2 a0, union Eq_2 * a1, Eq_344856 a2, ptr32 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_12 = g_t4200ECFC;
	ptr32 a3_14;
	ptr32 a4_15;
	ptr32 a5_16;
	ptr32 a1_26;
	Eq_2 a0_13 = _strtol_l.isra.0(a0_12, a0, a1, a2, out a1_26, out a3_14, out a4_15, out a5_16);
	a1Out = a1_26;
	a2Out = a1;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	return a0_13;
}

// 230A4DEC: Register Eq_2 _strtoul_l.isra.0(Register Eq_2 a0, Register (ptr32 Eq_185099) a1, Register (ptr32 (ptr32 Eq_185099)) a2, Register Eq_185139 a3, Register out Eq_2 a3Out)
// Called from:
//      _strtoul_r
//      strtoul_l
//      strtoul
Eq_2 _strtoul_l.isra.0(Eq_2 a0, struct Eq_185099 * a1, struct Eq_185099 ** a2, Eq_185139 a3, union Eq_2 & a3Out)
{
	struct Eq_185099 * t1_17 = a1;
	while (true)
	{
		struct Eq_185099 * a4_10 = t1_17 + 1;
		Eq_575682 a5_12 = (word32) a4_10->bFFFFFFFF;
		if (((word32) *((word32) a5_12.u0 + 588035505) & 8) == 0x00)
			break;
		t1_17 = a4_10;
	}
	Eq_185139 t6_219;
	Eq_185139 t0_216;
	Eq_2 t3_213;
	int32 t2_194;
	Eq_575682 a6_159;
	if (a5_12 != 45)
	{
		if (a5_12 == 43)
		{
			a6_159 = (word32) a4_10->b0000;
			t2_194 = 0;
			a4_10 = t1_17 + 2;
			if (a3 != 0x00)
			{
l230A4E38:
				if (a3 != 16)
				{
					t3_213 = -1 >> a3;
					t6_219 = a3;
					t0_216 = a3;
					goto l230A4E50;
				}
				if (a6_159 == 48)
				{
					if (((word32) a4_10->b0000 & 223) == 88)
						goto l230A4F58;
					t6_219.u0 = 16;
					t3_213 = -1 >> a3;
					t0_216.u0 = 0x0F;
				}
				else
				{
					t0_216.u0 = 0x0F;
					t3_213.u0 = 0x0FFFFFFF;
					t6_219.u0 = 16;
				}
				goto l230A4E50;
			}
l230A4EB0:
			if (a6_159 != 48)
			{
				t0_216.u0 = 5;
				t3_213.u0 = 0x19999999;
				t6_219.u0 = 0x0A;
				a3.u0 = 0x0A;
			}
			else
			{
				if (((word32) a4_10->b0000 & 223) == 88)
				{
l230A4F58:
					a6_159 = (word32) a4_10[1];
					t0_216.u0 = 0x0F;
					a4_10 += 2;
					t3_213.u0 = 0x0FFFFFFF;
					t6_219.u0 = 16;
					a3.u0 = 16;
					goto l230A4E50;
				}
				t0_216.u0 = 7;
				t3_213.u0 = 0x1FFFFFFF;
				t6_219.u0 = 8;
				a3.u0 = 8;
			}
l230A4E50:
			int32 a7_131 = 0;
			Eq_2 a0_104 = 0;
l230A4E60:
			Eq_185139 a5_140 = (word32) a6_159 - 48;
			if (a5_140 > 9)
			{
				if (a6_159 > -90)
				{
					if (a6_159 <= -122)
					{
						a5_140 = (word32) a6_159 - 87;
						if (a5_140 < a3)
						{
l230A4E78:
							if (a7_131 >= 0x00)
							{
								a7_131 = -1;
								if (t3_213 >= a0_104 && (a0_104 != t3_213 || t0_216 >= a5_140))
								{
									a7_131 = 1;
									a0_104 = a5_140 + (t6_219 + a0_104);
								}
							}
							else
								a7_131 = -1;
							++a4_10;
							a6_159 = (word32) a4_10->bFFFFFFFF;
							goto l230A4E60;
						}
					}
l230A4EE8:
					if (a7_131 >= 0x00)
					{
						if (t2_194 != 0x00)
							a0_104 = 0x00 - a0_104;
						if (a2 == null)
						{
							a3Out.u0 = <invalid>;
							return a0_104;
						}
						if (a7_131 == 0x00)
						{
							*a2 = (struct Eq_185099 **) a1;
							a3Out.u0 = <invalid>;
							return a0_104;
						}
					}
					else
					{
						*a0 = 0x0022;
						a0_104.u0 = -1;
						if (a2 == null)
						{
							a3Out.u0 = <invalid>;
							return -1;
						}
					}
					*a2 = (struct Eq_185099 **) &a4_10->bFFFFFFFF;
					a3Out.u0 = <invalid>;
					return a0_104;
				}
				a5_140 = (word32) a6_159 - 55;
			}
			if (a5_140 < a3)
				goto l230A4E78;
			goto l230A4EE8;
		}
		a6_159 = a5_12;
		t2_194 = 0;
	}
	else
	{
		a6_159 = (word32) a4_10->b0000;
		t2_194 = 1;
		a4_10 = t1_17 + 2;
	}
	if (a3 != 0x00)
		goto l230A4E38;
	goto l230A4EB0;
}

// 230A4FC8: void _strtoul_r(Register Eq_2 a0, Register (ptr32 Eq_185099) a1, Register (ptr32 (ptr32 Eq_185099)) a2, Register Eq_185139 a3)
void _strtoul_r(Eq_2 a0, struct Eq_185099 * a1, struct Eq_185099 ** a2, Eq_185139 a3)
{
	word32 a3_21;
	_strtoul_l.isra.0(a0, a1, a2, a3, out a3_21);
}

