pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A4FCC: void strtoul_l(Register (ptr32 Eq_185099) a0, Register (ptr32 (ptr32 Eq_185099)) a1, Register Eq_185139 a2)
void strtoul_l(struct Eq_185099 * a0, struct Eq_185099 ** a1, Eq_185139 a2)
{
	Eq_2 a0_12 = g_t4200ECFC;
	word32 a3_27;
	_strtoul_l.isra.0(a0_12, a0, a1, a2, out a3_27);
}

// 230A4FE8: Register (ptr32 Eq_185099) strtoul(Register (ptr32 Eq_185099) a0, Register (ptr32 (ptr32 Eq_185099)) a1, Register Eq_185139 a2, Register out ptr32 a3Out)
// Called from:
//      blemesh_input_num
struct Eq_185099 * strtoul(struct Eq_185099 * a0, struct Eq_185099 ** a1, Eq_185139 a2, ptr32 & a3Out)
{
	Eq_2 a0_12 = g_t4200ECFC;
	ptr32 a3_14;
	struct Eq_185099 * a0_13 = _strtoul_l.isra.0(a0_12, a0, a1, a2, out a3_14);
	a3Out = a3_14;
	return a0_13;
}

// 230A5004: void stat(Register int32 a0, Register (ptr32 Eq_575861) a1)
void stat(int32 a0, struct Eq_575861 * a1)
{
	Eq_2 a0_10 = g_t4200ECFC;
	_stat_r(a0_10, a0, a1);
}

// 230A501C: Register Eq_2 __sprint_r.part.0(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_575874) a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register Eq_2 s10, Register out Eq_575881 a3Out)
// Called from:
//      __sprint_r
//      _vfiprintf_r
Eq_2 __sprint_r.part.0(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_575874 * a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, Eq_467152 s8, int32 s9, Eq_2 s10, union Eq_575881 & a3Out)
{
	Eq_2 a0_180;
	if (*((word32) a1 + 100) << 0x12 < 0x00)
	{
		Eq_2 a5_47 = a2->t0008;
		struct Eq_575910 * s7_50 = a2->ptr0000;
		while (a5_47 != 0x00)
		{
			Eq_575917 s8_54 = s7_50->dw0004;
			int32 * s0_55 = s7_50->dw0000;
			if (s8_54 >> 0x02 != 0x00)
			{
				Eq_575939 s1_57 = 0;
				do
				{
					s1_57 = (word32) s1_57.u0 + 1;
					if (_fputwc_r(a0, *s0_55, a1, out a3) == -1)
					{
						a0_180.u0 = -1;
						goto l230A50AC;
					}
					++s0_55;
				} while (s8_54 >> 0x02 != s1_57);
				a5_47 = a2->t0008;
			}
			a5_47 -= s8_54 & -4;
			a2->t0008 = a5_47;
			++s7_50;
		}
		a0_180.u0 = 0;
	}
	else
		a0_180 = __sfvwrite_r(ra, a0, a1, a2, s2, s3, s7, s8, s9, s10, out a3);
l230A50AC:
	a2->t0008.u0 = 0x00;
	a2->dw0004 = 0x00;
	a3Out = a3;
	return a0_180;
}

// 230A510C: void __sprint_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_575874) a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register Eq_2 s10)
void __sprint_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_575874 * a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, Eq_467152 s8, int32 s9, Eq_2 s10)
{
	if (a2->t0008 == 0x00)
		a2->dw0004 = 0x00;
	else
	{
		word32 a3_56;
		__sprint_r.part.0(ra, a0, a1, a2, s2, s3, s7, s8, s9, s10, out a3_56);
	}
}

// 230A5124: Register Eq_2 _vfiprintf_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register out ptr32 s0Out, Register out Eq_572735 a0Out, Register out Eq_2 s2Out)
// Called from:
//      _fiprintf_r
//      fiprintf
//      vfiprintf
//      __sbprintf
Eq_2 _vfiprintf_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9, ptr32 & s0Out, union Eq_572735 & a0Out, union Eq_2 & s2Out)
{
	Eq_2 a0_1018;
	Eq_2 s10_185 = a2;
	a0_1018 = a0;
	if (a0 != 0x00)
	{
		a0_1018 = a0;
		if (*((word32) a0 + 56) == 0x00)
		{
			word32 a3_2700;
			a0_1018 = __sinit(ra, a0, out a3_2700);
		}
	}
	int32 a4_49 = (int32) *((word32) a1 + 0x0C);
	ui32 a5_51 = (word32) (word16) a4_49;
	if (a5_51 << 0x12 >= 0x00)
	{
		int32 a3_53 = *((word32) a1 + 100);
		*((word32) a1 + 0x0C) = (word16) (a4_49 | 0x2000);
		*((word32) a1 + 100) = a3_53 & ~0x2000;
		a5_51 = (word32) (word16) (a4_49 | 0x2000);
	}
	Eq_572735 dwLoc012C_1532;
	if ((a5_51 & 8) != 0x00 && *((word32) a1 + 16) != 0x00)
	{
		if ((a5_51 & 26) != 0x0A)
			goto l230A51D0;
	}
	else
	{
		word32 a3_2701;
		a0_1018 = __swsetup_r(ra, a0, a1, out a3_2701);
		if (a0_1018 != 0x00)
			goto l230A6368;
		if (((word32) *((word32) a1 + 0x0C) & 26) != 0x0A)
		{
l230A51D0:
			Eq_576074 dwLocE8_1526 = 0x00;
			dwLoc012C_1532.u0 = 0x00;
			s2_189 = s2;
l230A520C:
			Eq_2 s2_189;
			Eq_2 dwLocEC_1539 = 0x00;
			struct Eq_576119 * s11_1041 = fp + -228;
			int32 a5_187 = (word32) *s10_185;
			if (a5_187 != 0x00)
			{
				Eq_576074 a3_1389 = 37;
				if (a5_187 == 37)
				{
					s2_189 = s10_185;
					goto l230A529C;
				}
				Eq_2 s0_190 = s10_185;
				while (true)
				{
					int32 a5_193 = (word32) *((word32) s0_190 + 1);
					s2_189 = (word32) s0_190 + 1;
					if (a5_193 == 0x00)
						break;
					if (a5_193 == 37)
					{
						s6 = s2_189 - s10_185;
						if (s6 != 0x00)
							goto l230A5240;
						goto l230A529C;
					}
					s0_190 = s2_189;
				}
				s6 = s2_189 - s10_185;
				if (s6 != 0x00)
				{
l230A5240:
					a3_1389 = s6 + dwLocE8_1526;
					dwLocE8_1526 = a3_1389;
					dwLocEC_1539.u0 = 1;
					s11_1041 = fp + -220;
					if (true)
					{
						if (a3_1389 != 0x00)
						{
							a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, s8, s9, s10_185, out a3_1389);
							if (a0_1018 != 0x00)
								goto l230A5390;
							s11_1041 = fp + -228;
						}
						else
						{
							dwLocEC_1539.u0 = 0x00;
							s11_1041 = fp + -228;
						}
					}
					dwLoc012C_1532 += s6;
					if ((word32) *((word32) s0_190 + 1) != 0x00)
					{
l230A529C:
						ptr32 s10_272 = (word32) s2_189 + 1;
						Eq_576145 a2_274 = (word32) *((word32) s2_189 + 1);
						s7.u0 = -1;
						Eq_2 s0_1204 = 0;
						s9 = 0;
						s2_189.u0 = 42;
						s10_185 = s10_272 + 1;
						if (a2_274 <= -122)
						{
							<anonymous> * a5_1379 = g_a230CB6B4[((word32) a2_274.u1 - 32) * 0x04] + 588035764;
							Eq_2 ra_1420;
							ptr32 s0_1421;
							Eq_2 s2_1423;
							Eq_572735 a0_1431;
							word32 t0_1436;
							word32 t6_1437;
							word32 t4_1438;
							word32 t3_1439;
							word32 t5_1440;
							word32 t2_1441;
							word32 t1_1442;
							word32 a6_1443;
							word32 a7_1444;
							a5_1379();
							s0Out = s0_1421;
							a0Out = a0_1431;
							s2Out = s2_1423;
							return ra_1420;
						}
						if (a2_274 != 0x00)
						{
							s2_189.u0 = 1;
							s6.u0 = 1;
							s8 = fp + -0x00A4;
							if (false)
								s2_189.u0 = 0x03;
							struct Eq_576119 * a1_1034;
							Eq_2 a2_1495 = dwLocEC_1539;
							Eq_576074 a5_1033 = dwLocE8_1526;
							Eq_2 a1_338 = (byte) dwLocEC_1539.u0 + 1;
							Eq_2 t4_1035 = (byte) dwLocEC_1539.u0 + 1;
							if (false)
							{
l230A54EC:
								a1_1034 = s11_1041 + 1;
								if (true)
									goto l230A552C;
								s11_1041->dw0000 = fp + -0x00F5;
								s11_1041->dw0004 = 1;
								a5_1033 = (word32) a5_1033 + 1;
								if (t4_1035 <= 7)
								{
l230A551C:
									a2_1495 = t4_1035;
									s11_1041 = a1_1034;
									t4_1035 = (word32) t4_1035 + 1;
									++a1_1034;
									goto l230A552C;
								}
								if (a5_1033 != 0x00)
								{
									word32 a3_2703;
									if (__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2703) != 0x00)
										goto l230A5390;
									a2_1495 = t4_1035;
									a1_1034 = fp + -220;
									t4_1035 = (word32) t4_1035 + 1;
									s11_1041 = fp + -228;
l230A552C:
									if (true)
										goto l230A5588;
									s11_1041->dw0000 = fp + -244;
									s11_1041->dw0004 = 2;
									a5_1033 = (word32) a5_1033 + 2;
									if (t4_1035 > 7)
									{
										if (a5_1033 != 0x00)
										{
											word32 a3_2704;
											if (__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2704) != 0x00)
												goto l230A5390;
											a2_1495 = t4_1035;
											a1_1034 = fp + -220;
											t4_1035 = (byte) t4_1035.u0 + 1;
											s11_1041 = fp + -228;
										}
										else
										{
											a1_1034 = fp + -220;
											t4_1035.u0 = 1;
											a2_1495.u0 = 0;
											s11_1041 = fp + -228;
										}
l230A5588:
										Eq_576074 a5_1048;
										Eq_2 dwLocEC_1601;
										a0_1018.u0 = 0x0080;
										if (false)
										{
											Eq_576392 t3_666 = 0 - s2_189;
											if (t3_666 > 0x00)
											{
												struct Eq_576119 * t6_669;
												if (t3_666 > 16)
												{
													do
													{
														s11_1041->dw0000 = 0x230CB830;
														s11_1041->dw0004 = 16;
														a5_1033 = (word32) a5_1033.u0 + 16;
														Eq_2 a1_681 = (byte) a2_1495.u0 + 1;
														if (a1_681 <= 7)
														{
															a0_1018 = (byte) a2_1495.u0 + 2;
															++s11_1041;
															a2_1495 = a1_681;
															goto l230A5C14;
														}
														if (a5_1033 == 0x00)
														{
															a0_1018.u0 = 1;
															a2_1495.u0 = 0;
															s11_1041 = fp + -228;
l230A5C14:
															t3_666 = (word32) t3_2715.u0 - 16;
															if (t3_666 > 16)
																continue;
															break;
														}
														word32 a3_2708;
														if (__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2708) != 0x00)
															goto l230A5390;
														a2_1495 = a1_681;
														t3_666 = (word32) t3_2715.u0 - 16;
														s11_1041 = fp + -228;
														a0_1018 = (word32) a1_681 + 1;
														t3_2715 = t3_666;
													} while (t3_2715 > -32);
													t6_669 = s11_1041 + 1;
												}
												else
												{
													t6_669 = a1_1034;
													a0_1018 = t4_1035;
												}
												s11_1041->dw0000 = 0x230CB830;
												s11_1041->dw0004 = (word32) t3_666;
												a5_1033 += t3_666;
												if (a0_1018 > 7)
												{
													if (a5_1033 != 0x00)
													{
														word32 a3_2709;
														a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2709);
														if (a0_1018 != 0x00)
															goto l230A5390;
														a2_1495 = a0_1018;
														s7.u0 = ~0x00;
														a1_1034 = fp + -220;
														t4_1035 = (word32) a0_1018 + 1;
														s11_1041 = fp + -228;
														if (true)
															goto l230A5598;
l230A5CD4:
														struct Eq_576119 * a2_1043;
														s7.u0 = ~0x00;
														a0_1018.u0 = 16;
														if (false)
														{
															do
															{
																s11_1041->dw0000 = 0x230CB830;
																s11_1041->dw0004 = 16;
																a5_1033 = (word32) a5_1033 + 16;
																Eq_2 a1_882 = (byte) a2_1495.u0 + 1;
																if (a1_882 <= 7)
																{
																	t4_1035 = (byte) a2_1495.u0 + 2;
																	++s11_1041;
																	a2_1495 = a1_882;
																	goto l230A5CFC;
																}
																if (a5_1033 == 0x00)
																{
																	t4_1035.u0 = 1;
																	a2_1495.u0 = 0;
																	s11_1041 = fp + -228;
l230A5CFC:
																	s7 = (word32) s7 - 16;
																	if (s7 > 16)
																		continue;
																	break;
																}
																word32 a3_2712;
																a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, fp + -0x00A4, 0, s10_272 + 1, out a3_2712);
																if (a0_1018 != 0x00)
																	goto l230A5390;
																a2_1495 = a1_882;
																s7 = (byte) s7.u0 - 16;
																s11_1041 = fp + -228;
																t4_1035 = (word32) a1_882 + 1;
															} while (s7 > 16);
															a2_1043 = s11_1041 + 1;
														}
														else
															a2_1043 = a1_1034;
														s11_1041->dw0000 = 0x230CB830;
														s11_1041->dw0004 = (word32) s7;
														a5_1033 += s7;
														if (t4_1035 <= 7)
														{
															t4_1035 = (word32) t4_1035 + 1;
															a1_1034 = a2_1043 + 1;
															s11_1041 = a2_1043;
														}
														else
														{
															if (a5_1033 == 0x00)
															{
																a5_1048.u0 = 1;
																dwLocE8_1526.u0 = 1;
																dwLocEC_1601.u0 = 1;
																a1_1034 = fp + -220;
l230A55D4:
																if (true)
																	goto l230A55E4;
																s6 = 0 - s2_189;
																if (s6 <= 0x00)
																{
l230A55E4:
																	if (s2_189 > 0)
																		s0_1204 = s2_189;
																	dwLoc012C_1532 += s0_1204;
																	if (a5_1048 == 0x00)
																		goto l230A55FC;
																	word32 a3_2714;
																	a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, s8, 0, s10_272 + 1, out a3_2714);
																	if (a0_1018 == 0x00)
																		goto l230A55FC;
l230A5390:
																	if (((word32) *((word32) a1 + 0x0C) & 64) == 0x00)
																		goto l230A53A0;
l230A6368:
																	dwLoc012C_1532.u0 = -1;
																	goto l230A53A0;
																}
																goto l230A5758;
															}
															word32 a3_2713;
															a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, fp + -0x00A4, 0, s10_272 + 1, out a3_2713);
															if (a0_1018 != 0x00)
																goto l230A5390;
															a1_1034 = fp + -220;
															t4_1035 = (word32) t4_1035 + 1;
															s11_1041 = fp + -228;
														}
l230A5598:
														s11_1041->dw0000 = fp + -0x00A4;
														s11_1041->dw0004 = 1;
														a5_1048 = (word32) a5_1033.u0 + 1;
														dwLocE8_1526 = a5_1048;
														dwLocEC_1601 = t4_1035;
														if (t4_1035 > 7)
														{
															if (a5_1048 == 0x00)
															{
																dwLocEC_1601.u0 = 0x00;
																if (true)
																	goto l230A5F2C;
																s6 = 0 - s2_189;
																if (s6 <= 0x00)
																{
l230A5F2C:
																	if (s2_189 > 0)
																		s0_1204 = s2_189;
																	dwLoc012C_1532 += s0_1204;
l230A55FC:
																	goto l230A520C;
																}
																a1_1034 = fp + -228;
l230A5758:
																int32 a2_1112;
																Eq_2 a3_1110 = dwLocEC_1601;
																if (s6 > 16)
																{
																	s8.u0 = 16;
																	s7.u0 = 7;
																	do
																	{
																		a1_1034->dw0000 = 0x230CB820;
																		a1_1034->dw0004 = 16;
																		a5_1048 = (word32) a5_1048 + 16;
																		Eq_2 a4_1122 = (word32) a3_1110 + 1;
																		if (a4_1122 <= 7)
																		{
																			a2_1112 = (word32) a3_1110 + 2;
																			++a1_1034;
																			a3_1110 = a4_1122;
																			goto l230A5784;
																		}
																		if (a5_1048 == 0x00)
																		{
																			a2_1112 = 1;
																			a3_1110.u0 = 0;
																			a1_1034 = fp + -228;
l230A5784:
																			s6 = (word32) s6 - 16;
																			if (s6 > 16)
																				continue;
																			break;
																		}
																		word32 a3_2710;
																		a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 7, 16, 0, s10_272 + 1, out a3_2710);
																		if (a0_1018 != 0x00)
																			goto l230A5390;
																		a3_1110 = a4_1122;
																		s6 = (byte) s6.u0 - 16;
																		a1_1034 = fp + -228;
																		a2_1112 = (word32) a4_1122 + 1;
																	} while (s6 > 16);
																}
																else
																	a2_1112 = (int32) ((byte) dwLocEC_1601.u0 + 1);
																a1_1034->dw0000 = 0x230CB820;
																a1_1034->dw0004 = (word32) s6;
																a5_1048 += s6;
																dwLocE8_1526 = a5_1048;
																if (a2_1112 <= 7)
																	goto l230A55E4;
																if (a5_1048 != 0x00)
																{
																	word32 a3_2711;
																	a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, s8, 0, s10_272 + 1, out a3_2711);
																	if (a0_1018 != 0x00)
																		goto l230A5390;
																	goto l230A55E4;
																}
																goto l230A5F2C;
															}
															word32 a3_2707;
															a0_1018 = __sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, fp + -0x00A4, 0, s10_272 + 1, out a3_2707);
															if (a0_1018 != 0x00)
																goto l230A5390;
															a1_1034 = fp + -228;
														}
														goto l230A55D4;
													}
													a1_1034 = fp + -220;
													t4_1035.u0 = 1;
													a2_1495.u0 = 0;
													s11_1041 = fp + -228;
												}
												else
												{
													t4_1035 = (word32) a0_1018 + 1;
													a1_1034 = t6_669 + 1;
													a2_1495 = a0_1018;
													s11_1041 = t6_669;
												}
											}
										}
										s7.u0 = ~0x00;
										if (true)
											goto l230A5598;
										goto l230A5CD4;
									}
									goto l230A5DF0;
								}
l230A5DD4:
								if (true)
								{
									a2_1495.u0 = 0;
									a1_1034 = fp + -220;
									t4_1035.u0 = 1;
									s11_1041 = fp + -228;
									goto l230A5588;
								}
								a5_1033.u0 = 2;
								t4_1035.u0 = 1;
								a1_1034 = fp + -220;
l230A5DF0:
								a2_1495 = t4_1035;
								s11_1041 = a1_1034;
								t4_1035 = (word32) t4_1035 + 1;
								++a1_1034;
								goto l230A5588;
							}
							Eq_576206 t3_1484 = 0 - s2_189;
							if (t3_1484 <= 0x00)
								goto l230A54EC;
							Eq_2 a0_344;
							if (t3_1484 <= 16)
							{
								a0_344 = (byte) dwLocEC_1539.u0 + 1;
								goto l230A5EF0;
							}
							Eq_576206 t5_1479 = 16;
							Eq_2 t2_1481 = 7;
l230A5E80:
							s11_1041->dw0000 = 0x230CB820;
							s11_1041->dw0004 = (word32) t5_1479;
							a5_1033 = (word32) a5_1033 + 16;
							if (t2_1481 < a1_338)
							{
								if (a5_1033 != 0x00)
								{
									word32 a3_2705;
									if (__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2705) != 0x00)
										goto l230A5390;
									a2_1495 = a1_338;
									t5_1479.u0 = 16;
									t3_1484 = (word32) t3_1484 - 16;
									s11_1041 = fp + -228;
									a0_344 = (word32) a1_338 + 1;
									t2_1481.u0 = 7;
									if (t3_1484 <= -32)
									{
l230A5EF0:
										s11_1041->dw0000 = 0x230CB820;
										s11_1041->dw0004 = (word32) t3_1484;
										a5_1033 += t3_1484;
										if (a0_344 <= 7)
										{
											++s11_1041;
											t4_1035 = (word32) a0_344 + 1;
											a2_1495 = a0_344;
										}
										else
										{
											if (a5_1033 == 0x00)
											{
												if (false)
												{
													a5_1033.u0 = 1;
													t4_1035.u0 = 1;
													a1_1034 = fp + -220;
													goto l230A551C;
												}
												goto l230A5DD4;
											}
											word32 a3_2706;
											if (__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, 0, fp + -0x00A4, 0, s10_272 + 1, out a3_2706) != 0x00)
												goto l230A5390;
											a2_1495 = a0_344;
											s11_1041 = fp + -228;
											t4_1035 = (word32) a0_344 + 1;
										}
										goto l230A54EC;
									}
l230A5E7C:
									a1_338 = (byte) a2_1495.u0 + 1;
									goto l230A5E80;
								}
								a2_1495.u0 = 0;
								a0_344.u0 = 1;
								s11_1041 = fp + -228;
							}
							else
							{
								a0_344 = (byte) a2_1495.u0 + 2;
								++s11_1041;
								a2_1495 = a1_338;
							}
							t3_1484 = (word32) t3_1484 - 16;
							if (t5_1479 >= t3_1484)
								goto l230A5EF0;
							goto l230A5E7C;
						}
						goto l230A5378;
					}
				}
			}
l230A5378:
			if (dwLocE8_1526 != 0x00)
			{
				word32 a3_2702;
				__sprint_r.part.0(ra, a0, a1, fp + -0x00F0, s2_189, a1, s7, s8, s9, s10_185, out a3_2702);
			}
			goto l230A5390;
		}
	}
	if ((int32) *((word32) a1 + 0x0E) >= 0x00)
	{
		dwLoc012C_1532 = __sbprintf(a1);
l230A53A0:
		s0Out = s0;
		a0Out = dwLoc012C_1532;
		s2Out = s2;
		return ra;
	}
	goto l230A51D0;
}

// 230A63B0: void vfiprintf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9)
void vfiprintf(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s6, Eq_2 s7, Eq_467152 s8, int32 s9)
{
	Eq_2 a0_12 = g_t4200ECFC;
	word32 s0_47;
	word32 a0_48;
	word32 s2_49;
	_vfiprintf_r(ra, a0_12, a0, a1, s2, s6, s7, s8, s9, out s0_47, out a0_48, out s2_49);
}

// 230A63CC: Register Eq_2 __sbprintf(Register Eq_2 a1)
// Called from:
//      _vfiprintf_r
Eq_2 __sbprintf(Eq_2 a1)
{
	word16 wLoc046C_80 = (word16) ((word32) *((word32) a1 + 0x0C) & -3);
	struct Eq_576762 * s0_44;
	Eq_2 s2_46;
	Eq_2 a0_48;
	Eq_2 ra_47 = _vfiprintf_r(ra, a0, fp + -1144, a2, a0, s6, s7, s8, s9, out s0_44, out a0_48, out s2_46);
	Eq_2 s1_49 = a0_48;
	if (a0_48 >= 0x00)
	{
		word32 a3_130;
		if (_fflush_r(ra_47, s2_46, fp - 1144, s2_46, out a3_130) != 0x00)
			s1_49.u0 = -1;
	}
	if (((word32) wLoc046C_80 & 64) != 0x00)
		s0_44->w000C = (word16) ((word32) s0_44->w000C | 64);
	return s1_49;
}

