pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A648C: Register Eq_2 __swsetup_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_576054 a3Out)
// Called from:
//      _vfiprintf_r
//      __sfvwrite_r
//      __swbuf
Eq_2 __swsetup_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_576054 & a3Out)
{
	Eq_576054 a3_105;
	ui32 a5_104;
	int32 a4_28;
	Eq_2 a0_116;
	Eq_2 a5_6 = g_t4200ECFC;
	if (a5_6 != 0x00 && *((word32) a5_6 + 56) == 0x00)
	{
		word32 a3_322;
		__sinit(ra, a5_6, out a3_322);
		a4_28 = (int32) *((word32) a1 + 0x0C);
		a5_104 = (word32) (word16) a4_28;
		if ((a5_104 & 8) == 0x00)
		{
l230A6560:
			a3_105 = a5_104 & 16;
			if (a3_105 == 0x00)
			{
				*a0 = 9;
				*((word32) a1 + 0x0C) = (word16) (a4_28 | 64);
				a0_116.u0 = -1;
				goto l230A64F8;
			}
			if ((a5_104 & 4) == 0x00)
				a3_105 = *((word32) a1 + 16);
			else
			{
				Eq_2 a1_51 = *((word32) a1 + 48);
				if (a1_51 != 0x00)
				{
					if (a1_51 != (word32) a1 + 64)
					{
						_free_r(a0, a1_51);
						a4_28 = (int32) *((word32) a1 + 0x0C);
					}
					((word32) a1 + 48)->u0 = 0x00;
				}
				a3_105 = *((word32) a1 + 16);
				*((word32) a1 + 4) = 0x00;
				*a1 = a3_105;
				a4_28 &= -37;
			}
			ui32 a5_67 = a4_28 | 8;
			*((word32) a1 + 0x0C) = (word16) a5_67;
			a5_104 = (word32) (word16) a5_67;
			if (a3_105 != 0x00)
			{
l230A64D8:
				if ((a5_104 & 1) != 0x00)
				{
					int32 a5_120 = *((word32) a1 + 20);
					*((word32) a1 + 8) = 0x00;
					*((word32) a1 + 24) = 0x00 - a5_120;
					a0_116.u0 = 0;
					if (a3_105 != 0x00)
						goto l230A64F8;
					goto l230A6528;
				}
				int32 a4_109 = 0;
				if ((a5_104 & 2) == 0x00)
					a4_109 = (int32) *((word32) a1 + 20);
				*((word32) a1 + 8) = a4_109;
				a0_116.u0 = 0;
				if (a3_105 == 0x00)
				{
l230A6528:
					a0_116.u0 = 0;
					int32 a5_127 = (int32) *((word32) a1 + 0x0C);
					if ((a5_127 & 0x0080) != 0x00)
					{
						*((word32) a1 + 0x0C) = (word16) (a5_127 | 64);
						a0_116.u0 = -1;
					}
					goto l230A64F8;
				}
l230A64F8:
				a3Out = a3_105;
				return a0_116;
			}
l230A6588:
			if ((a5_104 & 640) != 0x0200)
			{
				__smakebuf_r(a0, a1);
				a5_104 = (word32) *((word32) a1 + 0x0C);
				a3_105 = *((word32) a1 + 16);
			}
			goto l230A64D8;
		}
	}
	else
	{
		a4_28 = (int32) *((word32) a1 + 0x0C);
		a5_104 = (word32) (word16) a4_28;
		if ((a5_104 & 8) == 0x00)
			goto l230A6560;
	}
	a3_105 = *((word32) a1 + 16);
	if (a3_105 != 0x00)
		goto l230A64D8;
	goto l230A6588;
}

// 230A65F8: Register Eq_2 __sflush_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register out Eq_576995 a3Out)
// Called from:
//      _fflush_r
//      fclose
Eq_2 __sflush_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, union Eq_576995 & a3Out)
{
	Eq_2 a0_105;
	Eq_2 a0_159;
	int32 a5_171;
	int32 a5_5 = (int32) *((word32) a1 + 0x0C);
	ui32 a4_10 = (word32) (word16) a5_5;
	Eq_576995 a3_167 = a4_10 & 8;
	Eq_2 s0_116 = a1;
	Eq_2 s3_129 = a0;
	if ((a4_10 & 8) != 0x00)
	{
		int32 s2_23 = *((word32) a1 + 16);
		if (s2_23 != 0x00)
		{
			int32 s1_24 = *a1;
			*a1 = s2_23;
			int32 s1_27 = s1_24 - s2_23;
			int32 a5_28 = 0;
			if ((a4_10 & 3) == 0x00)
				a5_28 = (int32) *((word32) a1 + 20);
			*((word32) a1 + 8) = a5_28;
			while (s1_27 > 0x00)
			{
				word32 s1_53;
				word32 s2_54;
				int32 a0_56;
				(*((word32) s0_116 + 36))();
				s1_27 = s1_53 - a0_56;
				if (a0_56 <= 0x00)
				{
					a5_171 = (word32) *((word32) s0_116 + 0x0C);
					a0_159.u0 = -1;
					goto l230A679C;
				}
				s2_23 = s2_54 + a0_56;
			}
		}
		goto l230A671C;
	}
	a3_167 = *((word32) a1 + 4);
	*((word32) a1 + 0x0C) = (word16) (a5_5 | 0x0800);
	if (a3_167 <= 0x00 && *((word32) a1 + 60) <= 0x00)
	{
l230A671C:
		a0_105.u0 = 0;
		goto l230A6720;
	}
	<anonymous> * a4_112 = *((word32) a1 + 40);
	if (a4_112 == null)
		goto l230A671C;
	int32 s1_141 = *a0;
	*a0 = 0x00;
	uint32 a5_72 = (a5_5 | 0x0800) << 0x10;
	uint32 a5_111 = a5_72 >> 0x10;
	int32 a1_113 = *((word32) a1 + 28);
	if (a5_72 >> 0x10 << 0x13 >= 0x00)
	{
		a4_112();
		if (a0_105 == -1)
		{
			int32 a5_99 = *s3_129;
			if (a5_99 != 0x00)
			{
				if (a5_99 != 29 && a5_99 != 22)
					*((word32) s0_116 + 0x0C) = (word16) ((word32) *((word32) s0_116 + 0x0C) | 64);
				else
				{
					*s3_129 = s1_141;
					a0_105.u0 = 0;
				}
l230A6720:
				a3Out = a3_167;
				return a0_105;
			}
		}
		a5_111 = (word32) *((word32) s0_116 + 0x0C);
		a4_112 = (<anonymous> *) *((word32) s0_116 + 40);
		a1_113 = (int32) *((word32) s0_116 + 28);
	}
	else
		a0_105 = *((word32) a1 + 80);
	if ((a5_111 & 4) != 0x00)
	{
		a0_105 -= *((word32) s0_116 + 4);
		if (*((word32) s0_116 + 48) != 0x00)
			a0_105 -= *((word32) s0_116 + 60);
	}
	int32 a5_169;
	Eq_2 s3_154;
	int32 s1_156;
	a4_112();
	if (a0_159 == -1)
	{
		int32 a4_170 = *s3_154;
		a5_171 = (int32) *((word32) s0_116 + 0x0C);
		if (a4_170 != 0x00)
		{
			if (a4_170 != 29)
			{
				a3_167.u0 = 22;
				if (a4_170 != 22)
				{
l230A679C:
					*((word32) s0_116 + 0x0C) = (word16) (a5_171 | 64);
					a3Out = a3_167;
					return a0_159;
				}
			}
			a3_167 = *((word32) s0_116 + 16);
			*((word32) s0_116 + 0x0C) = (word16) (a5_171 & ~0x0800);
			*((word32) s0_116 + 4) = 0x00;
			*s0_116 = a3_167;
l230A66FC:
			Eq_2 a1_210 = *((word32) s0_116 + 48);
			*s3_154 = s1_156;
			if (a1_210 != 0x00)
			{
				if (a1_210 != (word32) s0_116 + 64)
					_free_r(s3_154, a1_210);
				((word32) s0_116 + 48)->u0 = 0x00;
			}
			goto l230A671C;
		}
		a3_167 = *((word32) s0_116 + 16);
		a5_169 = a5_171 & ~0x0800;
	}
	else
	{
		a3_167 = *((word32) s0_116 + 16);
		a5_169 = (int32) (word16) ((word32) *((word32) s0_116 + 0x0C) & ~0x0800);
	}
	*((word32) s0_116 + 0x0C) = (word16) a5_169;
	*((word32) s0_116 + 4) = 0x00;
	*s0_116 = a3_167;
	if (a5_169 << 0x13 < 0x00)
		*((word32) s0_116 + 80) = a0_159;
	goto l230A66FC;
}

// 230A6854: Register Eq_2 _fflush_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register out ptr32 a3Out)
// Called from:
//      __sbprintf
//      fflush
//      __sfvwrite_r
//      __swbuf
Eq_2 _fflush_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, ptr32 & a3Out)
{
	if (a0 != 0x00 && *((word32) a0 + 56) == 0x00)
	{
		__sinit(ra, a0, out a3);
		if ((int32) *((word32) a1 + 0x0C) != 0x00)
		{
l230A68A0:
			ptr32 a3_40;
			Eq_2 a0_39 = __sflush_r(ra, a0, a1, s2, out a3_40);
			a3Out = a3_40;
			return a0_39;
		}
	}
	else if ((int32) *((word32) a1 + 0x0C) != 0x00)
		goto l230A68A0;
	a3Out = a3;
	return 0;
}

// 230A68B4: void fflush(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2)
void fflush(Eq_2 ra, Eq_2 a0, Eq_2 s2)
{
	if (a0 == 0x00)
	{
		Eq_2 a0_8 = g_t4200EEA0;
		_fwalk_reent(ra, a0_8, &g_t230A6854);
	}
	else
	{
		Eq_2 a0_17 = g_t4200ECFC;
		word32 a3_41;
		_fflush_r(ra, a0_17, a0, s2, out a3_41);
	}
}

// 230A68E4: void __fp_lock()
void __fp_lock()
{
}

// 230A68EC: void _cleanup_r(Register Eq_2 ra, Register Eq_2 a0)
void _cleanup_r(Eq_2 ra, Eq_2 a0)
{
	_fwalk_reent(ra, a0, &g_t230A8FD4);
}

// 230A68F8: Register Eq_2 __sinit.part.0(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out)
// Called from:
//      __sfp
//      __sinit
Eq_2 __sinit.part.0(Eq_2 ra, Eq_2 a0, ptr32 & a3Out)
{
	struct Eq_577318 * s0_21 = *((word32) a0 + 4);
	*((word32) a0 + 60) = 587884780;
	*((word32) a0 + 740) = 3;
	*((word32) a0 + 744) = (word32) a0 + 748;
	*((word32) a0 + 736) = 0x00;
	s0_21->dw000C = 4;
	s0_21->dw0064 = 0x00;
	s0_21->dw0000 = 0x00;
	s0_21->dw0004 = 0x00;
	s0_21->dw0008 = 0x00;
	s0_21->dw0010 = 0x00;
	s0_21->dw0014 = 0x00;
	s0_21->dw0018 = 0x00;
	word32 t1_141;
	word32 a0_142;
	word32 a1_143;
	word32 a2_144;
	word32 a3_145;
	word32 a4_146;
	word32 a5_147;
	Eq_2 ra_49 = memset(ra, &s0_21->ptr002C + 0x0C, 0, 8, out t1_141, out a0_142, out a1_143, out a2_144, out a3_145, out a4_146, out a5_147);
	struct Eq_577392 * s1_52 = *((word32) a0 + 8);
	s0_21->ptr0020 = 587893444;
	s0_21->ptr0024 = 0x230A8B28;
	s0_21->ptr0028 = 0x230A8BB0;
	s0_21->ptr002C = 587893784;
	s0_21->ptr001C = s0_21;
	s1_52->dw000C = 0x00010009;
	s1_52->dw0064 = 0x00;
	s1_52->dw0000 = 0x00;
	s1_52->dw0004 = 0x00;
	s1_52->dw0008 = 0x00;
	s1_52->dw0010 = 0x00;
	s1_52->dw0014 = 0x00;
	s1_52->dw0018 = 0x00;
	word32 t1_148;
	word32 a0_149;
	word32 a1_150;
	word32 a2_151;
	word32 a3_152;
	word32 a4_153;
	word32 a5_154;
	Eq_2 ra_85 = memset(ra_49, &s1_52->ptr002C + 0x0C, 0, 8, out t1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154);
	struct Eq_577468 * s0_88 = *((word32) a0 + 0x0C);
	s1_52->ptr0020 = 587893444;
	s1_52->ptr0024 = 0x230A8B28;
	s1_52->ptr0028 = 0x230A8BB0;
	s1_52->ptr002C = 587893784;
	s1_52->ptr001C = s1_52;
	s0_88->dw000C = 0x00020012;
	s0_88->dw0064 = 0x00;
	s0_88->dw0000 = 0x00;
	s0_88->dw0004 = 0x00;
	s0_88->dw0008 = 0x00;
	s0_88->dw0010 = 0x00;
	s0_88->dw0014 = 0x00;
	s0_88->dw0018 = 0x00;
	Eq_2 a0_107;
	ptr32 a3_110;
	word32 t1_155;
	word32 a1_156;
	word32 a2_157;
	word32 a4_158;
	word32 a5_159;
	memset(ra_85, &s0_88->ptr002C + 0x0C, 0, 8, out t1_155, out a0_107, out a1_156, out a2_157, out a3_110, out a4_158, out a5_159);
	s0_88->ptr0020 = 587893444;
	s0_88->ptr0024 = 0x230A8B28;
	s0_88->ptr0028 = 0x230A8BB0;
	s0_88->ptr002C = 587893784;
	s0_88->ptr001C = s0_88;
	*((word32) a0 + 56) = 1;
	a3Out = a3_110;
	return a0_107;
}

// 230A6A7C: void __fp_unlock()
void __fp_unlock()
{
}

// 230A6A84: void __sfmoreglue(Register Eq_2 ra, Register Eq_2 a0, Register int32 a1)
// Called from:
//      __sfp
void __sfmoreglue(Eq_2 ra, Eq_2 a0, int32 a1)
{
	word32 a3_71;
	Eq_2 a0_19 = _malloc_r(a0, a1 + 0x00DB, out a3_71);
	if (a0_19 != 0x00)
	{
		*a0_19 = 0x00;
		*((word32) a0_19 + 4) = a1;
		*((word32) a0_19 + 8) = (word32) a0_19 + 0x0C;
		word32 t1_72;
		word32 a0_73;
		word32 a1_74;
		word32 a2_75;
		word32 a3_76;
		word32 a4_77;
		word32 a5_78;
		memset(ra, (word32) a0_19 + 0x0C, 0, a1 + 0x00CF, out t1_72, out a0_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78);
	}
}

// 230A6AF0: void __sfp(Register Eq_2 ra, Register Eq_2 a0)
void __sfp(Eq_2 ra, Eq_2 a0)
{
	Eq_2 s2_8 = g_t4200EEA0;
	if (*((word32) s2_8 + 56) == 0x00)
	{
		word32 a3_177;
		__sinit.part.0(ra, s2_8, out a3_177);
	}
	Eq_2 s2_109 = (word32) s2_8 + 736;
	while (true)
	{
		int32 a5_34 = *((word32) s2_109 + 4);
		struct Eq_577628 * s0_35 = *((word32) s2_109 + 8);
		int32 a5_36 = a5_34 + -1;
		if (a5_34 >= ~0x00)
		{
			do
			{
				if ((int32) s0_35->w000C == 0x00)
				{
					s0_35->dw0064 = 0x00;
					s0_35->dw0000 = 0x00;
					s0_35->dw0004 = 0x00;
					s0_35->dw0008 = 0x00;
					s0_35->w000C = (int16) ~0xFFFE;
					s0_35->dw0010 = 0x00;
					s0_35->dw0014 = 0x00;
					s0_35->dw0018 = 0x00;
					word32 a4_183;
					word32 a0_179;
					word32 a5_184;
					word32 t1_178;
					word32 a1_180;
					word32 a2_181;
					word32 a3_182;
					memset(ra, &s0_35->dw0048 + 5, 0, 8, out t1_178, out a0_179, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184);
					s0_35->dw0030 = 0x00;
					s0_35->dw0034 = 0x00;
					s0_35->dw0044 = 0x00;
					s0_35->dw0048 = 0x00;
					return;
				}
				a5_36 += -1;
				++s0_35;
			} while (a5_36 != -1);
		}
		Eq_2 s0_108 = *s2_109;
		if (s0_108 == 0x00)
		{
			__sfmoreglue(ra, a0, 4);
			*s2_109 = a0;
			s0_108 = a0;
			if (a0 == 0x00)
			{
				*a0 = 0x0C;
				return;
			}
		}
		s2_109 = s0_108;
	}
}

// 230A6BF8: void _cleanup(Register Eq_2 ra)
void _cleanup(Eq_2 ra)
{
	Eq_2 a0_6 = g_t4200EEA0;
	_fwalk_reent(ra, a0_6, &g_t230A8FD4);
}

