pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A6C10: Register Eq_2 __sinit(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a3Out)
// Called from:
//      _vfiprintf_r
//      __swsetup_r
//      _fflush_r
//      fputwc
//      __swbuf
//      fclose
Eq_2 __sinit(Eq_2 ra, Eq_2 a0, ptr32 & a3Out)
{
	if (*((word32) a0 + 56) == 0x00)
	{
		ptr32 a3_10;
		Eq_2 a0_7 = __sinit.part.0(ra, a0, out a3_10);
		a3Out = a3_10;
		return a0_7;
	}
	else
	{
		a3Out = a3;
		return a0;
	}
}

// 230A6C20: void __sfp_lock_acquire()
// Called from:
//      fclose
void __sfp_lock_acquire()
{
}

// 230A6C24: void __sfp_lock_release()
// Called from:
//      fclose
void __sfp_lock_release()
{
}

// 230A6C28: void __sinit_lock_acquire()
void __sinit_lock_acquire()
{
}

// 230A6C2C: void __sinit_lock_release()
void __sinit_lock_release()
{
}

// 230A6C30: void __fp_lock_all(Register word32 ra)
void __fp_lock_all(word32 ra)
{
	Eq_2 a0_6 = g_t4200ECFC;
	_fwalk(ra, a0_6, &g_t230A68E4);
}

// 230A6C48: void __fp_unlock_all(Register word32 ra)
void __fp_unlock_all(word32 ra)
{
	Eq_2 a0_6 = g_t4200ECFC;
	_fwalk(ra, a0_6, &g_t230A6A7C);
}

// 230A6C60: Register Eq_2 __fputwc(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_577779 a3Out)
// Called from:
//      _fputwc_r
//      fputwc
Eq_2 __fputwc(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_577779 & a3Out)
{
	Eq_577779 a3_218;
	Eq_2 s2_103;
	int32 a4_116;
	__locale_mb_cur_max();
	if (a0 == 1 && a1 <= -0x00FF)
	{
		a4_116 = a1 & 0x00FF;
		s2_103.u0 = 1;
	}
	else
	{
		_wcrtomb_r(ra, a0, a1, a3);
		a3_218 = (word32) a2 + 92;
		s2_103 = a0;
		if (a0 == -1)
		{
			((word32) a2 + 0x0C)->u2 = (word16) ((word32) *((word32) a2 + 0x0C) | 64);
l230A6D48:
			a3Out = a3_218;
			return s2_103;
		}
		if (a0 == 0x00)
		{
l230A6D74:
			s2_103 = a1;
			goto l230A6D48;
		}
		a4_116 = (word32) bLoc24;
	}
	Eq_2 s1_47 = 0;
l230A6D14:
	int32 a5_52 = *((word32) a2 + 8);
	*((word32) a2 + 8) = a5_52 + -1;
	if (a5_52 < ~0x00)
	{
		a3_218 = *((word32) a2 + 24);
		if (a5_52 + -1 < a3_218 || a4_116 == 0x0A)
		{
			__swbuf_r(ra, a0, a1, a2);
			if (a0 == -1)
			{
				s2_103.u0 = -1;
				goto l230A6D48;
			}
			goto l230A6D00;
		}
	}
	byte * a5_64 = *a2;
	*a2 = a5_64 + 1;
	*a5_64 = (byte) a4_116;
	a3_218 = a5_64 + 1;
l230A6D00:
	s1_47 = (word32) s1_47 + 1;
	byte * a5_82 = (word32) s1_47 + (fp + -36);
	if (s1_47 < s2_103)
	{
		a4_116 = (word32) *a5_82;
		goto l230A6D14;
	}
	goto l230A6D74;
}

// 230A6D8C: Register Eq_2 _fputwc_r(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a3Out)
// Called from:
//      __sprint_r.part.0
Eq_2 _fputwc_r(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & a3Out)
{
	int32 a5_5 = (int32) *((word32) a2 + 0x0C);
	if (a5_5 << 0x12 >= 0x00)
	{
		int32 a4_7 = *((word32) a2 + 100);
		((word32) a2 + 0x0C)->u1 = (word16) (a5_5 | 0x2000);
		*((word32) a2 + 100) = a4_7 | 0x2000;
	}
	ptr32 a3_21;
	Eq_2 a0_23 = __fputwc(a0, a1, a2, out a3_21);
	a3Out = a3_21;
	return a0_23;
}

// 230A6DB8: void fputwc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1)
void fputwc(Eq_2 ra, Eq_2 a0, Eq_2 a1)
{
	Eq_2 s0_8 = g_t4200ECFC;
	if (s0_8 != 0x00 && *((word32) s0_8 + 56) == 0x00)
	{
		word32 a3_76;
		__sinit(ra, s0_8, out a3_76);
	}
	int32 a5_31 = (int32) *((word32) a1 + 0x0C);
	if (a5_31 << 0x12 >= 0x00)
	{
		int32 a4_33 = *((word32) a1 + 100);
		((word32) a1 + 0x0C)->u1 = (word16) (a5_31 | 0x2000);
		*((word32) a1 + 100) = a4_33 | 0x2000;
	}
	word32 a3_77;
	__fputwc(s0_8, a0, a1, out a3_77);
}

// 230A6E40: void _malloc_trim_r(Register Eq_2 a0, Register Eq_577952 a1)
// Called from:
//      _free_r
void _malloc_trim_r(Eq_2 a0, Eq_577952 a1)
{
	__malloc_lock();
	int32 s1_23 = g_ptr4200E6EC->dw0004;
	uint32 s0_28 = (0x0FEF - a1 + (s1_23 & -4) >> 0x0C) + -1;
	if (s0_28 << 0x0C >= 0x1000)
	{
		word32 a3_143;
		if (_sbrk_r(a0, 0, out a3_143) == g_ptr4200E6EC + (s1_23 & -4) / 16)
		{
			word32 a3_144;
			if (_sbrk_r(a0, 0x00 - (s0_28 << 0x0C), out a3_144) != (struct Eq_577958 *) -1)
			{
				Eq_578015 s0_83 = g_t4201E924 - (s0_28 << 0x0C);
				g_ptr4200E6EC->dw0004 = (s1_23 & -4) - (s0_28 << 0x0C) | 1;
				g_t4201F924 = s0_83;
				__malloc_unlock();
				return;
			}
			word32 a3_145;
			struct Eq_577958 * a0_57 = _sbrk_r(a0, 0, out a3_145);
			struct Eq_577958 * a4_66 = g_ptr4200E6EC;
			int32 a5_68 = a0_57 - a4_66;
			if (a5_68 > 0x0F)
			{
				int32 a3_71 = g_dw4200ED00;
				a4_66->dw0004 = a5_68 | 1;
				g_t4201F924 = a0_57 - a3_71;
			}
		}
	}
	__malloc_unlock();
}

// 230A6F7C: void _free_r(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      __swsetup_r
//      __sflush_r
//      __sfvwrite_r
//      _malloc_r
//      _realloc_r
//      fclose
void _free_r(Eq_2 a0, Eq_2 a1)
{
	if (a1 == 0x00)
		return;
	__malloc_lock();
	int32 a1_14 = *((word32) a1 - 4);
	struct Eq_577958 * a2_19 = (word32) a1 - 8 + (a1_14 & -2);
	struct Eq_577958 * a4_15 = (word32) a1 - 8;
	Eq_578061 a5_117 = a1_14 & -2;
	int32 a3_20 = a2_19->dw0004;
	if (g_ptr4200E6EC != a2_19)
	{
		a2_19->dw0004 = a3_20 & -4;
		struct Eq_578083 * a6_58 = a2_19 + (a3_20 & -4) / 16;
		if ((a1_14 & 1) == 0x00)
		{
			int32 t1_68 = *((word32) a1 - 8);
			a4_15 = (word32) a1 - 8 - t1_68;
			int32 a1_69 = a6_58->dw0004;
			struct Eq_577958 * a6_73 = a4_15->ptr0008;
			a5_117 = (a1_14 & -2) + t1_68;
			if (a6_73 == &g_ptr4200E6EC)
			{
				if ((a1_69 & 1) == 0x00)
				{
					struct Eq_577958 * a1_79 = a2_19->ptr0008;
					struct Eq_577958 * a2_80 = a2_19->ptr000C;
					a1_79->ptr000C = a2_80;
					a2_80->ptr0008 = a1_79;
					int32 a5_81 = (word32) a5_117 + (a3_20 & -4);
					a4_15->dw0004 = a5_81 | 1;
					a4_15[a5_81 / 16] = (struct Eq_577958) a5_81;
				}
				else
				{
					a4_15->dw0004 = a5_117 | 1;
					a2_19->a0000[0] = a5_117;
				}
				goto l230A7060;
			}
			struct Eq_577958 * t1_88 = a4_15->ptr000C;
			a6_73->ptr000C = t1_88;
			t1_88->ptr0008 = a6_73;
			if ((a1_69 & 1) != 0x00)
			{
				a4_15->dw0004 = a5_117 | 1;
				a2_19->a0000[0] = a5_117;
				goto l230A7014;
			}
			a5_117 = (word32) a5_117 + (a3_20 & -4);
		}
		else
		{
			if ((a6_58->dw0004 & 1) != 0x00)
			{
				*((word32) a1 + 0x0FFC) = a1_14 & -2 | 1;
				a2_19->a0000[0] = a1_14 & -2;
				if ((a1_14 & -2) <= 511)
				{
l230A701C:
					Eq_578149 a5_207 = a5_117 >> 0x03;
					struct Eq_577958 ** a0_213 = 0x4200E6E4 + ((word32) a5_207 + 1 << 0x03);
					struct Eq_577958 * a2_214 = *a0_213;
					Eq_450439 a5_218 = 1 << (a5_207 >> 0x02) | g_t4200E6E8;
					a4_15->ptr000C = (struct Eq_577958 *) ((char *) a0_213 - 8);
					a4_15->ptr0008 = a2_214;
					g_t4200E6E8 = a5_218;
					*a0_213 = (struct Eq_577958 **) a4_15;
					a2_214->ptr000C = a4_15;
					goto l230A7060;
				}
l230A70D0:
				Eq_578142 a2_123;
				int32 a1_124;
				Eq_578144 a3_119 = a5_117 >> 0x09;
				if (a3_119 <= 4)
				{
					uint32 a3_142 = a5_117 >> 0x06;
					a2_123 = a3_142 + 56;
					a1_124 = a3_142 + 57 << 0x03;
				}
				else if (a3_119 > 20)
				{
					if (a3_119 <= 84)
					{
						uint32 a3_138 = a5_117 >> 0x0C;
						a2_123 = a3_138 + 110;
						a1_124 = a3_138 + 111 << 0x03;
					}
					else if (a3_119 <= 340)
					{
						uint32 a3_134 = a5_117 >> 0x0F;
						a2_123 = a3_134 + 0x0077;
						a1_124 = a3_134 + 0x0078 << 0x03;
					}
					else if (a3_119 <= 0x0554)
					{
						uint32 a3_130 = a5_117 >> 0x12;
						a2_123 = a3_130 + 0x007C;
						a1_124 = a3_130 + 0x007D << 0x03;
					}
					else
					{
						a1_124 = 1016;
						a2_123.u0 = 0x007E;
					}
				}
				else
				{
					a2_123 = (word32) a3_119.u1 + 91;
					a1_124 = (word32) a3_119.u1 + 92 << 0x03;
				}
				struct Eq_577958 ** a1_151 = 0x4200E6E4 + a1_124;
				struct Eq_577958 * a3_155 = *a1_151;
				struct Eq_577958 * a1_156 = (char *) a1_151 - 8;
				if ((char *) a1_151 - 8 != a3_155)
				{
					while (a5_117 < (a3_155->dw0004 & -4))
					{
						a3_155 = a3_155->ptr0008;
						if ((char *) a1_151 - 8 == a3_155)
							break;
					}
					a1_156 = a3_155->ptr000C;
				}
				else
					g_t4200E6E8 = 1 << (a2_123 >> 0x02) | g_t4200E6E8;
				a4_15->ptr000C = a1_156;
				a4_15->ptr0008 = a3_155;
				a1_156->ptr0008 = a4_15;
				a3_155->ptr000C = a4_15;
				__malloc_unlock();
				return;
			}
			a5_117 = (a1_14 & -2) + (a3_20 & -4);
		}
		struct Eq_577958 * a3_94 = a2_19->ptr0008;
		int32 a6_96 = a5_117 | 1;
		word32 a1_98 = a4_15 + a5_117;
		if (a3_94 != &g_ptr4200E6EC)
		{
			struct Eq_577958 * a2_108 = a2_19->ptr000C;
			a3_94->ptr000C = a2_108;
			a2_108->ptr0008 = a3_94;
			a4_15->dw0004 = a6_96;
			*a1_98 = (union Eq_578061 *) a5_117;
l230A7014:
			if (a5_117 <= 511)
				goto l230A701C;
			goto l230A70D0;
		}
		g_ptr4200E6F8 = a4_15;
		g_ptr4200E6F4 = a4_15;
		a4_15->ptr000C = (struct Eq_577958 *) &g_ptr4200E6EC;
		a4_15->ptr0008 = (struct Eq_577958 *) &g_ptr4200E6EC;
		a4_15->dw0004 = a6_96;
		*a1_98 = (union Eq_578061 *) a5_117;
	}
	else
	{
		Eq_578070 a5_24 = (a1_14 & -2) + (a3_20 & -4);
		if ((a1_14 & 1) == 0x00)
		{
			int32 a1_25 = *((word32) a1 - 8);
			a4_15 = (word32) a1 - 8 - a1_25;
			struct Eq_577958 * a3_27 = a4_15->ptr000C;
			struct Eq_577958 * a2_28 = a4_15->ptr0008;
			a2_28->ptr000C = a3_27;
			a3_27->ptr0008 = a2_28;
			a5_24 = (word32) a5_24.u1 + a1_25;
		}
		Eq_578070 a3_37 = g_t4200ED04;
		a4_15->dw0004 = a5_24 | 1;
		g_ptr4200E6EC = a4_15;
		if (a5_24 >= a3_37)
			_malloc_trim_r(a0, g_t4200F730);
	}
l230A7060:
	__malloc_unlock();
}

// 230A729C: Register Eq_2 __sfvwrite_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_575874) a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s7, Register Eq_467152 s8, Register int32 s9, Register Eq_2 s10, Register out ptr32 a3Out)
// Called from:
//      __sprint_r.part.0
Eq_2 __sfvwrite_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_575874 * a2, Eq_2 s2, Eq_2 s3, Eq_2 s7, Eq_467152 s8, int32 s9, Eq_2 s10, ptr32 & a3Out)
{
	if (a2->t0008 == 0x00)
	{
		a3Out = a3;
		return 0;
	}
	struct Eq_575910 * s1_203;
	Eq_2 a0_50;
	ptr32 a3_163;
	int32 a5_461;
	ui32 a5_310 = (word32) *((word32) a1 + 0x0C);
	Eq_2 s0_115 = a1;
	Eq_2 s5_146 = a0;
	struct Eq_575874 * s4_196 = a2;
	if ((a5_310 & 8) != 0x00 && *((word32) a1 + 16) != 0x00)
	{
		s1_203 = a2->ptr0000;
		if ((a5_310 & 2) != 0x00)
			goto l230A7304;
	}
	else
	{
		if (__swsetup_r(ra, a0, a1, out a3_163) != 0x00)
		{
			a0_50.u0 = -1;
			goto l230A7570;
		}
		a5_310 = (word32) *((word32) a1 + 0x0C);
		s1_203 = a2->ptr0000;
		if ((a5_310 & 2) != 0x00)
		{
l230A7304:
			<anonymous> * a4_573 = *((word32) a1 + 36);
			int32 a5_574 = *((word32) a1 + 28);
			int32 s3_576 = 0;
			Eq_578476 s2_577 = 0;
			Eq_578476 s6_578 = 0x7FFFFC00;
			while (true)
			{
				int32 a2_580 = s3_576;
				int32 a1_582 = a5_574;
				Eq_2 a0_584 = s5_146;
				while (s2_577 != 0x00)
				{
					word32 s2_631;
					word32 s3_632;
					word32 a4_638;
					int32 a0_639;
					word32 a6_641;
					word32 a7_642;
					word32 t1_643;
					word32 t0_644;
					word32 t3_645;
					word32 t4_646;
					word32 t5_647;
					word32 t6_648;
					a4_573();
					if (a0_639 <= 0x00)
						goto l230A75D0;
					Eq_2 a0_662 = s4_196->t0008 - a0_639;
					s4_196->t0008 = a0_662;
					s3_576 = s3_632 + a0_639;
					s2_577 = s2_631 - a0_639;
					if (a0_662 == 0x00)
						goto l230A756C;
					a5_574 = (int32) *((word32) s0_115 + 28);
					a4_573 = (<anonymous> *) *((word32) s0_115 + 36);
					a2_580 = s3_576;
					a1_582 = a5_574;
					a0_584 = s5_146;
				}
				s3_576 = s1_203->dw0000;
				s2_577.u0 = s1_203->dw0004;
				++s1_203;
			}
		}
	}
	if ((a5_310 & 1) == 0x00)
	{
		Eq_2 s9_302 = *((word32) a1 + 8);
		Eq_2 a0_303 = *a1;
		Eq_2 s8_305 = 0x7FFFFFFE;
		Eq_2 s6_306 = 0;
		Eq_2 s2_307 = 0;
		Eq_2 s7_308 = 0x7FFFFFFF;
		while (true)
		{
			while (s2_307 != 0x00)
			{
				Eq_2 s3_320;
				if ((a5_310 & 0x0200) != 0x00)
				{
					s10 = s9_302;
					if (s2_307 >= s9_302)
					{
						if ((a5_310 & 1152) != 0x00)
						{
							Eq_2 a3_425 = *((word32) s0_115 + 20);
							Eq_2 a1_426 = *((word32) s0_115 + 16);
							Eq_578610 s3_432 = (a3_425 * 0x03 >> 0x1F) + a3_425 * 0x03;
							Eq_2 s9_431 = a0_303 - a1_426;
							Eq_2 s3_433 = s3_432 >> 0x01;
							Eq_2 a4_434 = (word32) s9_431 + ((byte) s2_307.u0 + 1);
							Eq_2 a2_435 = s3_432 >> 0x01;
							if (s3_432 >> 0x01 < a4_434)
							{
								s3_433 = a4_434;
								a2_435 = a4_434;
							}
							Eq_2 s10_453;
							if ((a5_310 & 0x0400) != 0x00)
							{
								Eq_2 a0_464 = _malloc_r(s5_146, a2_435, out a3_163);
								s10_453 = a0_464;
								if (a0_464 == 0x00)
								{
									*s5_146 = 0x0C;
									a5_461 = (int32) *((word32) s0_115 + 0x0C);
									goto l230A75D4;
								}
								word32 a4_1502;
								word32 a7_1505;
								word32 a1_1499;
								word32 a2_1500;
								word32 a6_1504;
								word32 a5_1503;
								word32 a3_1501;
								memcpy(a0_464, *((word32) s0_115 + 16), s9_431, out a1_1499, out a2_1500, out a3_1501, out a4_1502, out a5_1503, out a6_1504, out a7_1505);
								*((word32) s0_115 + 0x0C) = (word16) ((word32) *((word32) s0_115 + 0x0C) & -1153 | 0x0080);
							}
							else
							{
								Eq_2 a0_444 = _realloc_r(s5_146, a1_426, a2_435, out a3_163);
								s10_453 = a0_444;
								if (a0_444 == 0x00)
								{
									_free_r(s5_146, *((word32) s0_115 + 16));
									int32 a5_458 = (int32) *((word32) s0_115 + 0x0C);
									*s5_146 = 0x0C;
									a5_461 = a5_458 & -0x0081;
									goto l230A75D4;
								}
							}
							*((word32) s0_115 + 16) = s10_453;
							a0_303 = s10_453 + s9_431;
							*s0_115 = a0_303;
							*((word32) s0_115 + 20) = s3_433;
							*((word32) s0_115 + 8) = s3_433 - s9_431;
							s9_302 = s2_307;
							s10 = s2_307;
						}
					}
					else
					{
						s9_302 = s2_307;
						s10 = s2_307;
					}
					word32 a5_1496;
					word32 a4_1495;
					memmove(a0_303, s6_306, s10, out a3_163, out a4_1495, out a5_1496);
					word32 a2_531 = Mem524[s0_115 + 0x00:int32] + s10;
					*((word32) s0_115 + 8) -= s9_302;
					*s0_115 = a2_531;
					s3_320 = s2_307;
					s2_307.u0 = 0;
					goto l230A749C;
				}
				if (*((word32) s0_115 + 16) >= a0_303)
				{
					Eq_2 a5_316 = *((word32) s0_115 + 20);
					if (s2_307 < a5_316)
						goto l230A766C;
					Eq_2 a3_363 = s2_307;
					if (s8_305 < s2_307)
						a3_363 = s7_308;
					word32 a4_410;
					Eq_2 a0_411;
					word32 a6_413;
					word32 a7_414;
					word32 t1_415;
					word32 t0_416;
					word32 t6_834;
					word32 t4_832;
					word32 t5_833;
					word32 t3_831;
					(*((word32) s0_115 + 36))();
					if (a0_411 <= 0x00)
						goto l230A75D0;
					s3_320 = a0_411;
					goto l230A7664;
				}
l230A766C:
				s3_320 = s9_302;
				if (s2_307 < s9_302)
					s3_320 = s2_307;
				word32 a5_1512;
				word32 a4_1511;
				memmove(a0_303, s6_306, s3_320, out a3_163, out a4_1511, out a5_1512);
				Eq_2 a5_341 = *((word32) s0_115 + 8) - s3_320;
				word32 a4_342 = Mem313[s0_115 + 0x00:int32] + s3_320;
				*((word32) s0_115 + 8) = a5_341;
				*s0_115 = a4_342;
				if (a5_341 == 0x00)
				{
					if (_fflush_r(ra, s5_146, s0_115, s2_307, out a3_163) != 0x00)
						goto l230A75D0;
					s2_307 -= s3_320;
				}
				else
				{
l230A7664:
					s2_307 -= s3_320;
				}
l230A749C:
				s3 = s4_196->t0008 - s3_320;
				s4_196->t0008 = s3;
				s6_306 += s3_320;
				if (s3 == 0x00)
					goto l230A756C;
				s9_302 = *((word32) s0_115 + 8);
				a0_303 = *s0_115;
				a5_310 = (word32) *((word32) s0_115 + 0x0C);
			}
			s6_306 = s1_203->dw0000;
			s2_307 = s1_203->dw0004;
			++s1_203;
		}
	}
	Eq_2 s6_100 = 0;
	int32 a0_272 = 0;
	Eq_2 s7_132 = 0;
	Eq_2 s3_103 = 0;
	do
	{
		Eq_2 a5_102;
		struct Eq_324930 * a0_81;
		if (s3_103 != 0x00)
		{
			if (a0_272 != 0x00)
				goto l230A74FC;
			word32 a5_1498;
			word32 a3_1497;
			a0_81 = memchr(s7_132, 0x0A, s3_103, out a3_1497, out a5_1498);
			if (a0_81 == null)
				goto l230A7618;
			goto l230A74F4;
		}
		do
		{
			s3_103 = s1_203->dw0004;
			s7_132 = s1_203->dw0000;
			++s1_203;
		} while (s3_103 == 0x00);
		word32 a5_1514;
		word32 a3_1513;
		a0_81 = memchr(s7_132, 0x0A, s3_103, out a3_1513, out a5_1514);
		if (a0_81 != null)
		{
l230A74F4:
			s6_100 = &a0_81->b0001 - s7_132;
l230A74FC:
			a5_102 = s6_100;
		}
		else
		{
l230A7618:
			a5_102 = (word32) s3_103 + 1;
			s6_100 = a5_102;
		}
		Eq_2 s8_109 = s3_103;
		if (a5_102 < s3_103)
			s8_109 = a5_102;
		Eq_2 a0_125 = *s0_115;
		Eq_2 a3_127 = *((word32) s0_115 + 20);
		if (*((word32) s0_115 + 16) < a0_125)
		{
			s2 = a3_127 + Mem122[s0_115 + 8:int32];
			if (s2 >= s8_109)
				goto l230A7528;
			word32 a4_1507;
			word32 a5_1508;
			word32 a3_1506;
			memmove(a0_125, s7_132, s2, out a3_1506, out a4_1507, out a5_1508);
			Mem152[s0_115 + 0x00:word32] = Mem122[s0_115 + 0x00:int32] + s2;
			if (_fflush_r(ra, s5_146, s0_115, s2, out a3_163) != 0x00)
				goto l230A75D0;
			goto l230A7548;
		}
l230A7528:
		if (s8_109 >= a3_127)
		{
			word32 a4_261;
			Eq_2 a0_262;
			word32 a6_264;
			word32 a7_265;
			word32 t1_266;
			word32 t0_267;
			word32 t5_829;
			word32 t6_830;
			word32 t3_827;
			word32 t4_828;
			(*((word32) s0_115 + 36))();
			s2 = a0_262;
			if (a0_262 > 0x00)
				goto l230A7548;
l230A75D0:
			a5_461 = (int32) *((word32) s0_115 + 0x0C);
l230A75D4:
			*((word32) s0_115 + 0x0C) = (word16) (a5_461 | 64);
			a0_50.u0 = -1;
			goto l230A7570;
		}
		word32 a5_1510;
		word32 a4_1509;
		memmove(a0_125, s7_132, s8_109, out a3_163, out a4_1509, out a5_1510);
		word32 s8_184 = Mem122[s0_115 + 0x00:int32] + s8_109;
		*((word32) s0_115 + 8) -= s8_109;
		*s0_115 = s8_184;
		s2 = s8_109;
l230A7548:
		s6_100 -= s2;
		a0_272 = 1;
		if (s6_100 == 0x00)
		{
			a0_272 = _fflush_r(ra, s5_146, s0_115, s2, out a3_163);
			if (a0_272 != 0x00)
				goto l230A75D0;
		}
		s2 = s4_196->t0008 - s2;
		s4_196->t0008 = s2;
		s7_132 += s2;
		s3_103 -= s2;
	} while (s2 != 0x00);
l230A756C:
	a0_50.u0 = 0;
l230A7570:
	a3Out = a3_163;
	return a0_50;
}

// 230A774C: void _fwalk(Register word32 ra, Register Eq_2 a0, Register (ptr32 code) a1)
// Called from:
//      __fp_lock_all
//      __fp_unlock_all
void _fwalk(word32 ra, Eq_2 a0, <anonymous> * a1)
{
	struct Eq_578955 * s5_21 = (word32) a0 + 736;
	if (a0 != 0x02E0)
	{
		<anonymous> * s6_24 = a1;
		int32 s4_25 = 0;
		Eq_578963 s3_26 = 1;
		int32 s2_27 = -1;
		do
		{
			int32 s1_30 = s5_21->dw0004;
			struct Eq_578975 * s0_31 = s5_21->ptr0008;
			int32 s1_32 = s1_30 + -1;
			if (s1_30 >= ~0x00)
			{
				do
				{
					s1_32 += -1;
					if (s3_26 < (word32) s0_31->w000C && (int32) s0_31->w000E != s2_27)
					{
						ui32 s4_55;
						ui32 a0_57;
						word32 a5_59;
						s6_24();
						s4_25 = s4_55 | a0_57;
					}
					++s0_31;
				} while (s1_32 != s2_27);
			}
			s5_21 = s5_21->ptr0000;
		} while (s5_21 != null);
	}
}

// 230A77FC: void _fwalk_reent(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 code) a1)
// Called from:
//      fflush
//      _cleanup_r
//      _cleanup
void _fwalk_reent(Eq_2 ra, Eq_2 a0, <anonymous> * a1)
{
	struct Eq_579004 * s5_23 = (word32) a0 + 736;
	if (a0 != 0x02E0)
	{
		<anonymous> * s7_103 = a1;
		Eq_2 s6_100 = a0;
		int32 s4_28 = 0;
		Eq_579013 s3_29 = 1;
		int32 s2_101 = -1;
		do
		{
			int32 s1_33 = s5_23->dw0004;
			struct Eq_579025 * s0_34 = s5_23->ptr0008;
			int32 s1_35 = s1_33 + -1;
			if (s1_33 >= ~0x00)
			{
				do
				{
					s1_35 += -1;
					if (s3_29 < (word32) s0_34->w000C && (int32) s0_34->w000E != s2_101)
					{
						ui32 s4_59;
						ui32 a0_62;
						word32 a5_64;
						s7_103();
						s4_28 = s4_59 | a0_62;
					}
					++s0_34;
				} while (s1_35 != s2_101);
			}
			s5_23 = s5_23->ptr0000;
		} while (s5_23 != null);
	}
}

// 230A78BC: void __localeconv_l()
void __localeconv_l()
{
}

// 230A78C4: void _localeconv_r()
void _localeconv_r()
{
}

// 230A78D0: void localeconv()
void localeconv()
{
}

// 230A78DC: void _setlocale_r(Register Eq_2 a2)
// Called from:
//      setlocale
void _setlocale_r(Eq_2 a2)
{
	if (a2 == 0x00)
		return;
	word32 a1_100;
	word32 a2_101;
	word32 a3_102;
	word32 a4_103;
	word32 a5_104;
	if (strcmp(a2, 588036200, out a1_100, out a2_101, out a3_102, out a4_103, out a5_104) == 0x00)
		return;
	word32 a1_105;
	word32 a2_106;
	word32 a3_107;
	word32 a4_108;
	word32 a5_109;
	if (strcmp(a2, 588027256, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109) == 0x00)
		return;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	if (strcmp(a2, 588017084, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114) == 0x00)
		;
}

// 230A7958: void __locale_mb_cur_max()
// Called from:
//      fputwc
void __locale_mb_cur_max()
{
}

// 230A7964: void setlocale(Register Eq_2 a1)
void setlocale(Eq_2 a1)
{
	_setlocale_r(a1);
}

// 230A797C: Register Eq_2 __swhatbuf_r(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 int32) a2, Register (ptr32 word32) a3)
// Called from:
//      __smakebuf_r
Eq_2 __swhatbuf_r(Eq_2 a0, Eq_2 a1, int32 * a2, word32 * a3)
{
	int32 a1_8 = (int32) *((word32) a1 + 0x0E);
	if (a1_8 < 0x00 || _fstat_r(a0, a1_8, fp + -0x0068) < 0x00)
	{
		ui32 a5_38 = (word32) *((word32) a1 + 0x0C);
		*a3 = 0x00;
		if ((a5_38 & 0x0080) == 0x00)
		{
			*a2 = 0x0400;
			return 0;
		}
		else
		{
			*a2 = 64;
			return 0;
		}
	}
	else
	{
		*a3 = (word32) ((dwLoc64 & 0xF000) < ~0x2000);
		*a2 = 0x0400;
		return 0x0800;
	}
}

// 230A7A4C: void __smakebuf_r(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      __swsetup_r
void __smakebuf_r(Eq_2 a0, Eq_2 a1)
{
	if (((word32) *((word32) a1 + 0x0C) & 2) == 0x00)
	{
		ui32 a0_21 = __swhatbuf_r(a0, a1, fp + -24, fp + -20);
		word32 a3_189;
		Eq_2 a0_39 = _malloc_r(a0, dwLoc18, out a3_189);
		int32 a5_48 = (int32) *((word32) a1 + 0x0C);
		if (a0_39 == 0x00)
		{
			if ((a5_48 & 0x0200) == 0x00)
			{
				*((word32) a1 + 0x0C) = (word16) (a5_48 & -4 | 2);
				*a1 = (word32) a1 + 67;
				*((word32) a1 + 16) = (word32) a1 + 67;
				((word32) a1 + 20)->u0 = 1;
			}
		}
		else
		{
			*((word32) a0 + 60) = 587884780;
			*((word32) a1 + 0x0C) = (word16) (a5_48 | 0x0080);
			*a1 = a0_39;
			*((word32) a1 + 16) = a0_39;
			*((word32) a1 + 20) = dwLoc18;
			int32 a5_63 = a5_48 | 0x0080;
			if (dwLoc14 != 0x00)
			{
				if (_isatty_r(a0, (int32) *((word32) a1 + 0x0E)) == 0x00)
					a5_63 = (int32) *((word32) a1 + 0x0C);
				else
					a5_63 = (int32) (word16) ((word32) *((word32) a1 + 0x0C) & -4 | 1);
			}
			*((word32) a1 + 0x0C) = (word16) (a5_63 | a0_21);
		}
	}
	else
	{
		*a1 = (word32) a1 + 67;
		*((word32) a1 + 16) = (word32) a1 + 67;
		((word32) a1 + 20)->u0 = 1;
	}
}

