pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A7B6C: Register Eq_2 _malloc_r(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_450439 a3Out)
// Called from:
//      _init_signal_r.part.0
//      __sfmoreglue
//      __sfvwrite_r
//      __smakebuf_r
//      _realloc_r
Eq_2 _malloc_r(Eq_2 a0, Eq_2 a1, union Eq_450439 & a3Out)
{
	Eq_2 a0_106;
	Eq_579288 a2_119;
	struct Eq_464692 * a2_665;
	int32 a5_666;
	Eq_450439 s0_115;
	Eq_2 s1_107;
	Eq_450439 a4_205;
	struct Eq_577958 * s0_120;
	Eq_579295 a2_109;
	Eq_579296 a5_108;
	if (a1 <= -11)
	{
		if (a1 <= 16)
		{
			__malloc_lock();
			s1_107.u0 = 16;
			a5_108.u0 = 24;
			a2_109.u0 = 2;
			goto l230A7BC4;
		}
	}
	else
	{
		s1_107 = (word32) a1 + 11 & -8;
		if (s1_107 >= 0x00 && s1_107 >= a1)
		{
			__malloc_lock();
			if (s1_107 > 503)
			{
				Eq_579288 a0_38;
				int32 a3_36;
				if (s1_107 >> 0x09 != 0x00)
				{
					if (s1_107 >> 0x09 <= 4)
					{
						a2_119 = (s1_107 >> 0x06) + 57;
						a0_38 = (s1_107 >> 0x06) + 56;
						a3_36 = a2_119 << 0x03;
					}
					else if (s1_107 >> 0x09 > 20)
					{
						if (s1_107 >> 0x09 <= 84)
						{
							a2_119 = (s1_107 >> 0x0C) + 111;
							a0_38 = (s1_107 >> 0x0C) + 110;
							a3_36 = a2_119 << 0x03;
						}
						else if (s1_107 >> 0x09 <= 340)
						{
							a2_119 = (s1_107 >> 0x0F) + 0x0078;
							a0_38 = (s1_107 >> 0x0F) + 0x0077;
							a3_36 = a2_119 << 0x03;
						}
						else if (s1_107 >> 0x09 <= 0x0554)
						{
							a2_119 = (s1_107 >> 0x12) + 0x007D;
							a0_38 = (s1_107 >> 0x12) + 0x007C;
							a3_36 = a2_119 << 0x03;
						}
						else
						{
							a3_36 = 1016;
							a2_119.u0 = 0x007F;
							a0_38.u0 = 0x007E;
						}
					}
					else
					{
						a2_119 = (s1_107 >> 0x09) + 92;
						a0_38 = (s1_107 >> 0x09) + 91;
						a3_36 = a2_119 << 0x03;
					}
				}
				else
				{
					a3_36 = 0x0200;
					a2_119.u0 = 64;
					a0_38.u0 = 63;
				}
				struct Eq_579395 * a3_69 = 0x4200E6E4 + a3_36;
				s0_115 = a3_69->t0004;
				a3 = (char *) a3_69 - 8;
				if ((char *) a3_69 - 8 != s0_115)
				{
					int32 a5_73 = *((word32) s0_115 + 4);
					a5_666 = a5_73 & -4;
					int32 a4_77 = (a5_73 & -4) - s1_107;
					while (a4_77 <= 0x0F)
					{
						if (a4_77 >= 0x00)
						{
							a3 = *((word32) s0_115 + 0x0C);
							a2_665 = (struct Eq_464692 *) *((word32) s0_115 + 8);
							goto l230A7BEC;
						}
						s0_115 = *((word32) s0_115 + 0x0C);
						if ((char *) a3_69 - 8 == s0_115)
							goto l230A7C98;
						int32 a5_85 = *((word32) s0_115 + 4);
						a5_666 = a5_85 & -4;
						a4_77 = (a5_85 & -4) - s1_107;
					}
					a2_119 = a0_38;
				}
l230A7C98:
				s0_120 = g_ptr4200E6F4;
				if (s0_120 == &g_ptr4200E6EC)
					goto l230A7E54;
				goto l230A7CA8;
			}
			a2_109 = s1_107 >> 0x03;
			a5_108 = (byte) s1_107.u0 + 8;
l230A7BC4:
			Eq_450439 a5_113 = (word32) a5_108 + 0x4200E6E4;
			s0_115 = *((word32) a5_113 + 4);
			if (s0_115 != (word32) a5_113 - 8)
			{
l230A7BDC:
				a3 = *((word32) s0_115 + 0x0C);
				a2_665 = (struct Eq_464692 *) *((word32) s0_115 + 8);
				a5_666 = *((word32) s0_115 + 4) & -4;
l230A7BEC:
				struct Eq_579409 * a5_670 = (word32) s0_115 + a5_666;
				int32 a4_672 = a5_670->dw0004;
				a2_665->t000C = a3;
				*((word32) a3 + 8) = a2_665;
				a5_670->dw0004 = a4_672 | 1;
				__malloc_unlock();
				a0_106 = (word32) s0_115 + 8;
l230A7DF4:
				a3Out = a3;
				return a0_106;
			}
			s0_115 = *((word32) a5_113 + 0x0C);
			a2_119 = (word32) a2_109.u0 + 2;
			if (a5_113 != s0_115)
				goto l230A7BDC;
			s0_120 = g_ptr4200E6F4;
			if (s0_120 == &g_ptr4200E6EC)
			{
l230A7E54:
				a4_205 = g_t4200E6E8;
				a3 = 1 << (a2_119 >> 0x02);
				if (a4_205 < a3)
					goto l230A7E68;
				goto l230A7D2C;
			}
l230A7CA8:
			int32 a1_125 = s0_120->dw0004;
			int32 a5_132 = (a1_125 & -4) - s1_107;
			if (a5_132 > 0x0F)
			{
				s0_120->dw0004 = s1_107 | 1;
				word32 s1_135 = s0_120 + s1_107;
				g_ptr4200E6F8 = s1_135;
				g_ptr4200E6F4 = s1_135;
				s1_135->ptr000C = (struct Eq_577958 *) &g_ptr4200E6EC;
				s1_135->ptr0008 = (struct Eq_577958 *) &g_ptr4200E6EC;
				s1_135->dw0004 = a5_132 | 1;
				s0_120[(a1_125 & -4) / 16] = (struct Eq_577958) a5_132;
				__malloc_unlock();
				a0_106 = &s0_120->ptr0008;
				goto l230A7DF4;
			}
			g_ptr4200F6F8 = (struct Eq_472819 *) &g_ptr4200E6EC;
			g_ptr4200F6F4 = (struct Eq_472819 *) &g_ptr4200E6EC;
			if (a5_132 >= 0x00)
			{
				struct Eq_579486 * a1_159 = s0_120 + (a1_125 & -4) / 16;
				a1_159->dw0004 |= 1;
				__malloc_unlock();
				a0_106 = &s0_120->ptr0008;
				goto l230A7DF4;
			}
			if ((a1_125 & -4) <= 511)
			{
				Eq_579512 a1_231 = (a1_125 & -4) >> 0x03;
				struct Eq_577958 ** a5_235 = 0x4200E6E4 + ((word32) a1_231 + 1 << 0x03);
				struct Eq_577958 * a3_236 = *a5_235;
				a4_205 = 1 << (a1_231 >> 0x02) | g_t4200E6E8;
				s0_120->ptr000C = (struct Eq_577958 *) ((char *) a5_235 - 8);
				s0_120->ptr0008 = a3_236;
				g_t4200F6E8 = a4_205;
				*a5_235 = (struct Eq_577958 **) s0_120;
				a3_236->ptr000C = s0_120;
			}
			else
			{
				Eq_579504 a4_170;
				int32 a3_171;
				Eq_579506 a5_166 = (a1_125 & -4) >> 0x09;
				if (a5_166 > 4)
				{
					if (a5_166 <= 20)
					{
						a4_170 = (word32) a5_166.u1 + 91;
						a3_171 = (word32) a5_166.u1 + 92 << 0x03;
					}
					else if (a5_166 <= 84)
					{
						uint32 a5_186 = (a1_125 & -4) >> 0x0C;
						a4_170 = a5_186 + 110;
						a3_171 = a5_186 + 111 << 0x03;
					}
					else if (a5_166 <= 340)
					{
						uint32 a5_182 = (a1_125 & -4) >> 0x0F;
						a4_170 = a5_182 + 0x0077;
						a3_171 = a5_182 + 0x0078 << 0x03;
					}
					else if (a5_166 <= 0x0554)
					{
						uint32 a5_178 = (a1_125 & -4) >> 0x12;
						a4_170 = a5_178 + 0x007C;
						a3_171 = a5_178 + 0x007D << 0x03;
					}
					else
					{
						a3_171 = 1016;
						a4_170.u0 = 0x007E;
					}
				}
				else
				{
					uint32 a5_168 = (a1_125 & -4) >> 0x06;
					a4_170 = a5_168 + 56;
					a3_171 = a5_168 + 57 << 0x03;
				}
				struct Eq_577958 ** a3_196 = 0x4200E6E4 + a3_171;
				struct Eq_577958 * a5_198 = *a3_196;
				struct Eq_577958 * a3_199 = (char *) a3_196 - 8;
				if ((char *) a3_196 - 8 != a5_198)
				{
					while ((a1_125 & -4) < (a5_198->dw0004 & -4))
					{
						a5_198 = a5_198->ptr0008;
						if ((char *) a3_196 - 8 == a5_198)
							break;
					}
					a3_199 = a5_198->ptr000C;
					a4_205 = g_t4200E6E8;
				}
				else
				{
					a4_205 = 1 << (a4_170 >> 0x02) | g_t4200E6E8;
					g_t4200E6E8 = a4_205;
				}
				s0_120->ptr000C = a3_199;
				s0_120->ptr0008 = a5_198;
				a3_199->ptr0008 = s0_120;
				a5_198->ptr000C = s0_120;
			}
			a3 = 1 << (a2_119 >> 0x02);
			if (a4_205 < a3)
			{
l230A7E68:
				int32 a5_404;
				struct Eq_577958 * s0_384 = g_ptr4200E6EC;
				int32 s5_385 = s0_384->dw0004;
				if ((s5_385 & -4) >= s1_107)
				{
					a5_404 = (s5_385 & -4) - s1_107;
					if (a5_404 > 0x0F)
						goto l230A7FF8;
				}
				Eq_577983 s5_419;
				struct Eq_577958 * s4_416 = s0_384 + (s5_385 & -4) / 16;
				word32 s5_418 = s1_107 + Mem381[0x4200F730<p32>:int32];
				if (g_dw4200ED00 != -1)
					s5_419 = (word32) s5_418 + 4111 & ~0x0FFF;
				else
					s5_419 = (word32) s5_418 + 16;
				int32 s5_472;
				struct Eq_577958 * a0_447 = _sbrk_r(a0, s5_419, out a3);
				struct Eq_577958 * s6_457 = a0_447;
				if (a0_447 != (struct Eq_577958 *) -1)
				{
					Eq_578015 a5_476;
					Eq_578015 a4_466;
					if (a0_447 >= s4_416)
					{
						a5_476 = s5_419 + Mem381[0x4201E924<p32>:int32];
						g_t4201F924 = a5_476;
						a4_466 = a5_476;
						if (s4_416 == a0_447)
						{
							a3 = s4_416 << 0x14;
							if (s4_416 << 0x14 == 0x00)
							{
								ui32 s5_483 = (word32) s5_419 + (s5_385 & -4);
								s0_384 = g_ptr4200E6EC;
								s0_384->dw0004 = s5_483 | 1;
								s5_472 = s5_483 | 1;
								goto l230A7FC4;
							}
						}
						goto l230A7EFC;
					}
					if (s0_384 == &g_t4200E6E4)
					{
						a4_466 = s5_419 + Mem381[0x4201E924<p32>:int32];
						g_t4201E924 = a4_466;
l230A7EFC:
						if (g_dw4200ED00 != -1)
							g_t4201F924 = (word32) a4_466 + (a0_447 - s4_416);
						else
							g_ptr4200FD00 = a0_447;
						int32 s4_509;
						struct Eq_577958 * a0_514;
						if ((a0_447 & 7) != 0x00)
						{
							up32 s6_525 = a0_447 - (a0_447 & 7);
							uint32 s5_529 = (word32) s5_419 + (s6_525 + 8);
							ui32 a5_533 = 0x1008 - (a0_447 & 7) - (s5_529 & 0x0FFF);
							s6_457 = s6_525 + 8;
							s4_509 = a5_533 & 0x0FFF;
							a0_514 = _sbrk_r(a0, a5_533 & 0x0FFF, out a3);
							if (a0_514 == (struct Eq_577958 *) -1)
							{
								s5_419 = s5_529 + ((a0_447 & 7) + -8) - (s6_525 + 8);
								s4_509 = 0;
								goto l230A7F64;
							}
						}
						else
						{
							word32 a5_508 = 0x1000 - (a0_447 + s5_419 & 0x0FFF);
							s4_509 = a5_508 & 0x0FFF;
							a0_514 = _sbrk_r(a0, a5_508 & 0x0FFF, out a3);
							if (a0_514 == (struct Eq_577958 *) -1)
							{
								s4_509 = 0;
l230A7F64:
								Eq_578015 a5_563 = g_t4201E924;
								g_ptr4200E6EC = s6_457;
								a5_476 = (word32) a5_563.u0 + s4_509;
								g_t4201F924 = a5_476;
								s5_472 = s5_419 | 1;
								s6_457->dw0004 = s5_472;
								if (s0_384 != &g_t4200E6E4)
								{
									if ((s5_385 & -4) <= 0x0F)
									{
										s6_457->dw0004 = 1;
										goto l230A819C;
									}
									ui32 a4_591 = (s5_385 & -4) + -0x0C;
									s0_384->dw0004 = s0_384->dw0004 & 1 | a4_591 & -8;
									a3 = s0_384 + (a4_591 & -8) / 16;
									*((word32) a3 + 4) = 5;
									*((word32) a3 + 8) = (struct Eq_464692 *) 5;
									if ((a4_591 & -8) <= 0x0F)
									{
										s5_472 = s6_457->dw0004;
										s0_384 = s6_457;
									}
									else
									{
										_free_r(a0, &s0_384->ptr0008);
										s0_384 = g_ptr4200E6EC;
										a5_476 = g_t4201E924;
										s5_472 = s0_384->dw0004;
									}
								}
								else
									s0_384 = s6_457;
l230A7FC4:
								if (g_t4200F72C < a5_476)
									g_t4200F72C = a5_476;
								if (g_t4200F728 < a5_476)
									g_t4200F728 = a5_476;
l230A8188:
								Eq_2 s5_626 = s5_472 & -4;
								a5_404 = s5_626 - s1_107;
								if (s5_626 >= s1_107 && a5_404 > 0x0F)
								{
l230A7FF8:
									s0_384->dw0004 = s1_107 | 1;
									word32 s1_645 = s0_384 + s1_107;
									g_ptr4200E6EC = s1_645;
									s1_645->dw0004 = a5_404 | 1;
									__malloc_unlock();
									a0_106 = &s0_384->ptr0008;
									goto l230A7DF4;
								}
l230A819C:
								__malloc_unlock();
								a0_106.u0 = 0;
								goto l230A7DF4;
							}
						}
						s5_419 = a0_514 - s6_457 + s4_509;
						goto l230A7F64;
					}
				}
				s0_384 = g_ptr4200E6EC;
				s5_472 = s0_384->dw0004;
				goto l230A8188;
			}
l230A7D2C:
			if ((a3 & a4_205) == 0x00)
			{
				a3 <<= 0x01;
				a2_119 = (a2_119 & -4) + 4;
				while ((a3 & a4_205) == 0x00)
				{
					a3 <<= 0x01;
					a2_119 = (word32) a2_119.u0 + 4;
				}
			}
			while (true)
			{
				Eq_450439 a7_287 = 0x4200E6E4 + (a2_119 << 0x03);
				Eq_450439 a1_288 = a7_287;
				Eq_579288 t1_289 = a2_119;
				do
				{
					Eq_450439 s0_292 = *((word32) a1_288 + 0x0C);
					while (a1_288 != s0_292)
					{
						int32 a5_295 = *((word32) s0_292 + 4);
						int32 a4_298 = (a5_295 & -4) - s1_107;
						if (a4_298 > 0x0F)
						{
							Eq_450439 a3_313 = *((word32) s0_292 + 0x0C);
							struct Eq_464692 * a2_314 = *((word32) s0_292 + 8);
							*((word32) s0_292 + 4) = s1_107 | 1;
							a2_314->t000C = a3_313;
							*((word32) a3_313 + 8) = a2_314;
							word32 s1_319 = s0_292 + s1_107;
							g_ptr4200F6F8 = s1_319;
							g_ptr4200F6F4 = s1_319;
							s1_319->ptr000C = 0x4200E6EC;
							s1_319->ptr0008 = 0x4200E6EC;
							s1_319->dw0004 = a4_298 | 1;
							*((word32) s0_292 + (a5_295 & -4)) = a4_298;
							__malloc_unlock();
							a3 = a4_298 | 1;
							a0_106 = (word32) s0_292 + 8;
							goto l230A7DF4;
						}
						if (a4_298 >= 0x00)
						{
							struct Eq_579732 * a5_300 = (word32) s0_292 + (a5_295 & -4);
							a3 = *((word32) s0_292 + 0x0C);
							struct Eq_464692 * a2_303 = *((word32) s0_292 + 8);
							a5_300->dw0004 |= 1;
							a2_303->t000C = a3;
							*((word32) a3 + 8) = a2_303;
							__malloc_unlock();
							a0_106 = (word32) s0_292 + 8;
							goto l230A7DF4;
						}
						s0_292 = *((word32) s0_292 + 0x0C);
					}
					t1_289 = (word32) t1_289 + 1;
					a1_288 = (word32) a1_288 + 8;
				} while ((t1_289 & 3) != 0x00);
				do
				{
					Eq_450439 a5_352;
					a7_287 = (word32) a7_287 - 8;
					if ((a2_119 & 3) == 0x00)
					{
						a5_352 = ~a3 & g_t4200E6E8;
						g_t4200E6E8 = a5_352;
						goto l230A81E8;
					}
					a2_119 = (word32) a2_119 - 1;
				} while (*((word32) a7_287 + 8) == a7_287);
				a5_352 = g_t4200E6E8;
l230A81E8:
				a3 <<= 0x01;
				if (a5_352 < a3 || a3 == 0x00)
					break;
				while ((a3 & a5_352) == 0x00)
				{
					a3 <<= 0x01;
					t1_289 = (word32) t1_289 + 4;
				}
				a2_119 = t1_289;
			}
			goto l230A7E68;
		}
	}
	*a0 = 0x0C;
	a0_106.u0 = 0;
	goto l230A7DF4;
}

