pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A83A8: void _mbtowc_r()
void _mbtowc_r()
{
	g_ptr4200E65C();
}

// 230A83B8: void __ascii_mbtowc(Register (ptr32 word32) a1, Register (ptr32 byte) a2, Register word32 a3)
void __ascii_mbtowc(word32 * a1, byte * a2, word32 a3)
{
	if (a1 == null)
		return;
	if (a2 == null)
		return;
	if (a3 == 0x00)
		return;
	*a1 = (word32) *a2;
}

// 230A8420: void __malloc_lock()
// Called from:
//      _malloc_trim_r
//      _free_r
//      _malloc_r
//      _realloc_r
void __malloc_lock()
{
}

// 230A8424: void __malloc_unlock()
// Called from:
//      _malloc_trim_r
//      _free_r
//      _malloc_r
//      _realloc_r
void __malloc_unlock()
{
}

// 230A8428: Register Eq_2 _realloc_r(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_450439 a3Out)
// Called from:
//      __sfvwrite_r
Eq_2 _realloc_r(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_450439 & a3Out)
{
	if (a1 == 0x00)
	{
		Eq_450439 a3_46;
		Eq_2 a0_40 = _malloc_r(a0, a2, out a3_46);
		a3Out = a3_46;
		return a0_40;
	}
	Eq_2 s3_102;
	Eq_2 s0_53;
	Eq_2 a4_54;
	__malloc_lock();
	Eq_2 s6_124 = a1;
	if (a2 > -11)
	{
		s0_53 = (word32) a2 + 11 & -8;
		a4_54 = s0_53;
		if (s0_53 >= 0x00 && s0_53 >= a2)
		{
l230A8484:
			int32 a5_63 = *((word32) a1 - 4);
			struct Eq_580188 * s2_226 = (word32) a1 - 8;
			Eq_2 s1_172 = a5_63 & -4;
			struct Eq_577958 * s4_173 = (word32) a1 - 8 + (a5_63 & -4);
			if ((a5_63 & -4) >= a4_54)
			{
l230A863C:
				int32 a2_332 = s2_226->dw0004;
				Eq_580204 a5_340 = s1_172 - s0_53;
				if (a5_340 <= 0x0F)
				{
					s2_226->dw0004 = s1_172 | a2_332 & 1;
					s4_173->dw0004 |= 1;
				}
				else
				{
					s2_226->dw0004 = a2_332 & 1 | s0_53;
					word32 a1_345 = s2_226 + s0_53;
					a1_345->dw0004 = a5_340 | 1;
					s4_173->dw0004 |= 1;
					_free_r(a0, &a1_345->dw0004 + 1);
				}
				__malloc_unlock();
				s3_102 = s6_124;
				goto l230A8584;
			}
			struct Eq_580188 * s8_165;
			Eq_2 s7_182;
			Eq_2 a2_185;
			Eq_2 s3_191;
			ui32 a5_167;
			int32 a3_71 = s4_173->dw0004;
			if (g_ptr4200E6EC != s4_173)
			{
				if (((s4_173 + (a3_71 & -2) / 16)->dw0004 & 1) == 0x00)
				{
					a3 = a3_71 & -4;
					Eq_2 a2_169 = (a5_63 & -4) + (a3_71 & -4);
					if (a2_169 >= a4_54)
					{
						struct Eq_577958 * a5_170 = s4_173->ptr000C;
						struct Eq_577958 * a4_171 = s4_173->ptr0008;
						a4_171->ptr000C = a5_170;
						a5_170->ptr0008 = a4_171;
						s1_172 = a2_169;
						s4_173 = (word32) a2_169 + ((word32) a1 - 8);
						goto l230A863C;
					}
					if ((a5_63 & 1) == 0x00)
					{
						s8_165 = (word32) a1 - 8 - *((word32) a1 - 8);
						int32 a5_179 = s8_165->dw0004;
						a5_167 = a5_179 & -4;
						s7_182 = (a5_179 & -4) + (a3_71 & -4) + (a5_63 & -4);
						if (s7_182 >= a4_54)
						{
							struct Eq_577958 * a5_183 = s4_173->ptr000C;
							struct Eq_577958 * a4_184 = s4_173->ptr0008;
							a4_184->ptr000C = a5_183;
							a5_183->ptr0008 = a4_184;
							struct Eq_464692 * a4_189 = s8_165->ptr0008;
							Eq_450439 a5_190 = s8_165->t000C;
							a4_189->t000C = a5_190;
							*((word32) a5_190 + 8) = a4_189;
							a2_185 = (a5_63 & -4) + -4;
							s3_191 = &s8_165->ptr0008;
							s4_173 = s8_165 + s7_182;
							if (a2_185 <= 36)
							{
								&a3.u0->t0000 = 19;
								struct Eq_464692 * a4_196 = *a1;
								struct Eq_580584 * a5_197 = &s8_165->ptr0008;
								if (a2_185 > 19)
								{
									s8_165->ptr0008 = a4_196;
									s8_165->t000C = *((word32) a1 + 4);
									a4_196 = (struct Eq_464692 *) *((word32) a1 + 8);
									if (a2_185 <= 27)
									{
										a5_197 = (struct Eq_580584 *) &s8_165->ptr0010;
										s6_124 = (word32) a1 + 8;
									}
									else
									{
										s8_165->ptr0010 = a4_196;
										s8_165->dw0014 = (int32) *((word32) a1 + 0x0C);
										a4_196 = (struct Eq_464692 *) *((word32) a1 + 16);
										if (a2_185 != 36)
										{
											a5_197 = (struct Eq_580584 *) &s8_165->ptr0018;
											s6_124 = (word32) a1 + 16;
										}
										else
										{
											s8_165->ptr0018 = a4_196;
											s8_165->dw001C = (int32) *((word32) a1 + 20);
											a5_197 = (struct Eq_580584 *) (&s8_165->dw001C + 1);
											s6_124 = (word32) a1 + 24;
											a4_196 = (struct Eq_464692 *) *((word32) a1 + 24);
										}
									}
								}
								a5_197->ptr0000 = (struct Eq_583641 *) a4_196;
								a5_197->t0004 = *((word32) s6_124 + 4);
								a5_197->dw0008 = (int32) *((word32) s6_124 + 8);
								s1_172 = s7_182;
								s2_226 = s8_165;
								s6_124 = &s8_165->ptr0008;
								goto l230A863C;
							}
							goto l230A88D0;
						}
						goto l230A84F0;
					}
l230A84F8:
					Eq_2 a0_306 = _malloc_r(a0, a2, out a3);
					s3_102 = a0_306;
					if (a0_306 == 0x00)
					{
l230A8560:
						__malloc_unlock();
						goto l230A8584;
					}
					if ((word32) a1 - 8 + (*((word32) a1 - 4) & -2) != (word32) a0_306 - 8)
					{
						Eq_2 a2_371 = (a5_63 & -4) + -4;
						if (a2_371 <= 36)
						{
							Eq_2 a4_389;
							Eq_2 a5_390;
							struct Eq_464692 * a3_379 = *a1;
							if (a2_371 <= 19)
							{
								a5_390 = a0_306;
								a4_389 = a1;
							}
							else
							{
								*a0_306 = a3_379;
								*((word32) a0_306 + 4) = *((word32) a1 + 4);
								if (a2_371 <= 27)
								{
									a4_389 = (word32) a1 + 8;
									a5_390 = (word32) a0_306 + 8;
									a3_379 = (struct Eq_464692 *) *((word32) a1 + 8);
								}
								else
								{
									*((word32) a0_306 + 8) = *((word32) a1 + 8);
									*((word32) a0_306 + 0x0C) = *((word32) a1 + 0x0C);
									if (a2_371 != 36)
									{
										a4_389 = (word32) a1 + 16;
										a5_390 = (word32) a0_306 + 16;
										a3_379 = (struct Eq_464692 *) *((word32) a1 + 16);
									}
									else
									{
										*((word32) a0_306 + 16) = *((word32) a1 + 16);
										*((word32) a0_306 + 20) = *((word32) a1 + 20);
										a4_389 = (word32) a1 + 24;
										a5_390 = (word32) a0_306 + 24;
										a3_379 = (struct Eq_464692 *) *((word32) a1 + 24);
									}
								}
							}
							*a5_390 = a3_379;
							a3 = *((word32) a4_389 + 4);
							*((word32) a5_390 + 4) = a3;
							*((word32) a5_390 + 8) = *((word32) a4_389 + 8);
						}
						else
						{
							word32 a5_719;
							word32 a4_718;
							memmove(a0_306, a1, a2_371, out a3, out a4_718, out a5_719);
						}
						_free_r(a0, a1);
						goto l230A8560;
					}
					s1_172 = (a5_63 & -4) + (*((word32) a0_306 - 4) & -4);
					s4_173 = (word32) s1_172 + ((word32) a1 - 8);
					goto l230A863C;
				}
				if ((a5_63 & 1) != 0x00)
					goto l230A84F8;
				s8_165 = (word32) a1 - 8 - *((word32) a1 - 8);
				a5_167 = s8_165->dw0004 & -4;
			}
			else
			{
				a3 = a3_71 & -4;
				Eq_580223 a2_73 = (a5_63 & -4) + (a3_71 & -4);
				Eq_580223 a1_75 = (byte) s0_53.u0 + 16;
				if (a2_73 >= a1_75)
				{
					Eq_2 s2_76 = (byte) s0_53.u0 + ((word32) a1 - 8);
					g_t4200F6EC = s2_76;
					*((word32) s2_76 + 4) = a2_73 - s0_53 | 1;
					*((word32) a1 + 0x0FFC) = *((word32) a1 - 4) & 1 | s0_53;
					__malloc_unlock();
					s3_102 = a1;
					goto l230A8584;
				}
				if ((a5_63 & 1) != 0x00)
					goto l230A84F8;
				s8_165 = (word32) a1 - 8 - *((word32) a1 - 8);
				int32 a5_92 = s8_165->dw0004;
				a5_167 = a5_92 & -4;
				Eq_580223 s4_95 = (a5_92 & -4) + (a3_71 & -4) + (a5_63 & -4);
				if (s4_95 >= a1_75)
				{
					Eq_450439 a5_96 = s8_165->t000C;
					struct Eq_464692 * a4_97 = s8_165->ptr0008;
					a4_97->t000C = a5_96;
					*((word32) a5_96 + 8) = a4_97;
					Eq_2 a2_98 = (a5_63 & -4) + -4;
					s3_102 = &s8_165->ptr0008;
					if (a2_98 <= 36)
					{
						struct Eq_464692 * a4_110 = *a1;
						struct Eq_580769 * a5_111 = &s8_165->ptr0008;
						if (a2_98 > 19)
						{
							s8_165->ptr0008 = a4_110;
							s8_165->t000C = *((word32) a1 + 4);
							if (a2_98 <= 27)
							{
								a4_110 = (struct Eq_464692 *) *((word32) a1 + 8);
								a5_111 = (struct Eq_580769 *) &s8_165->ptr0010;
								s6_124 = (word32) a1 + 8;
							}
							else
							{
								s8_165->ptr0010 = (struct Eq_464692 *) *((word32) a1 + 8);
								s8_165->dw0014 = (int32) *((word32) a1 + 0x0C);
								a4_110 = (struct Eq_464692 *) *((word32) a1 + 16);
								if (a2_98 != 36)
								{
									a5_111 = (struct Eq_580769 *) &s8_165->ptr0018;
									s6_124 = (word32) a1 + 16;
								}
								else
								{
									s8_165->ptr0018 = a4_110;
									s8_165->dw001C = (int32) *((word32) a1 + 20);
									a5_111 = (struct Eq_580769 *) (&s8_165->dw001C + 1);
									s6_124 = (word32) a1 + 24;
									a4_110 = (struct Eq_464692 *) *((word32) a1 + 24);
								}
							}
						}
						a5_111->ptr0000 = (struct Eq_583642 *) a4_110;
						a5_111->t0004 = *((word32) s6_124 + 4);
						a5_111->dw0008 = (int32) *((word32) s6_124 + 8);
					}
					else
					{
						word32 a5_724;
						word32 a3_722;
						word32 a4_723;
						memmove(&s8_165->ptr0008, a1, a2_98, out a3_722, out a4_723, out a5_724);
					}
					word32 a4_144 = s8_165 + s0_53;
					g_t4200F6EC = a4_144;
					*((word32) a4_144 + 4) = s4_95 - s0_53 | 1;
					s8_165->dw0004 = s8_165->dw0004 & 1 | s0_53;
					__malloc_unlock();
					&a3.u0->t0000 = 0x4200E794;
l230A8584:
					a3Out = a3;
					return s3_102;
				}
			}
l230A84F0:
			s7_182 = (a5_63 & -4) + a5_167;
			if (s7_182 < a4_54)
				goto l230A84F8;
			Eq_450439 a4_238 = s8_165->t000C;
			struct Eq_464692 * a3_239 = s8_165->ptr0008;
			a3_239->t000C = a4_238;
			*((word32) a4_238 + 8) = a3_239;
			a2_185 = (a5_63 & -4) + -4;
			s3_191 = &s8_165->ptr0008;
			s4_173 = s8_165 + s7_182;
			if (a2_185 <= 36)
			{
				struct Eq_464692 * a3_262 = *a1;
				Eq_2 a4_263 = s3_191;
				if (a2_185 > 19)
				{
					s8_165->ptr0008 = a3_262;
					s8_165->t000C = *((word32) a1 + 4);
					if (a2_185 <= 27)
					{
						a3_262 = (struct Eq_464692 *) *((word32) a1 + 8);
						a4_263 = &s8_165->ptr0010;
						s6_124 = (word32) a1 + 8;
					}
					else
					{
						s8_165->ptr0010 = (struct Eq_464692 *) *((word32) a1 + 8);
						s8_165->dw0014 = (int32) *((word32) a1 + 0x0C);
						if (a2_185 != 36)
						{
							a3_262 = (struct Eq_464692 *) *((word32) a1 + 16);
							a4_263 = &s8_165->ptr0018;
							s6_124 = (word32) a1 + 16;
						}
						else
						{
							s8_165->ptr0018 = (struct Eq_464692 *) *((word32) a1 + 16);
							s8_165->dw001C = (int32) *((word32) a1 + 20);
							a4_263 = &s8_165->dw001C + 1;
							s6_124 = (word32) a1 + 24;
							a3_262 = (struct Eq_464692 *) *((word32) a1 + 24);
						}
					}
				}
				*a4_263 = a3_262;
				a3 = *((word32) s6_124 + 4);
				*((word32) a4_263 + 4) = a3;
				*((word32) a4_263 + 8) = *((word32) s6_124 + 8);
				s1_172 = s7_182;
				s2_226 = s8_165;
				s6_124 = s3_191;
				goto l230A863C;
			}
l230A88D0:
			word32 a5_721;
			word32 a4_720;
			memmove(s3_191, a1, a2_185, out a3, out a4_720, out a5_721);
			s6_124 = s3_191;
			s1_172 = s7_182;
			s2_226 = s8_165;
			goto l230A863C;
		}
	}
	else
	{
		s0_53.u0 = 16;
		a4_54.u0 = 16;
		if (a2 <= 16)
			goto l230A8484;
	}
	*a0 = 0x0C;
	s3_102.u0 = 0;
	goto l230A8584;
}

