pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A8A04: Register Eq_2 _sbrk_r(Register Eq_2 a0, Register Eq_577983 a1, Register out (ptr32 Eq_577984) a3Out)
// Called from:
//      _malloc_trim_r
//      _malloc_r
Eq_2 _sbrk_r(Eq_2 a0, Eq_577983 a1, struct Eq_577984 & a3Out)
{
	g_dw420277A8 = 0x00;
	word32 a3_17;
	if (_sbrk(a1, out a3_17) != -1)
		return;
	Eq_385116 a5_26 = g_t420267A8;
	if (a5_26 == 0x00)
		return;
	*a0 = a5_26;
	return;
}

// 230A8A60: void _stat_r(Register Eq_2 a0, Register int32 a1, Register (ptr32 Eq_575861) a2)
// Called from:
//      stat
void _stat_r(Eq_2 a0, int32 a1, struct Eq_575861 * a2)
{
	g_dw420277A8 = 0x00;
	if (_stat(a1, a2) != -1)
		return;
	Eq_385116 a5_35 = g_t420267A8;
	if (a5_35 == 0x00)
		return;
	*a0 = a5_35;
}

// 230A8AC4: void __sread(Register (ptr32 Eq_385116) a0, Register (ptr32 Eq_580903) a1)
void __sread(union Eq_385116 * a0, struct Eq_580903 * a1)
{
	int32 a0_12 = _read_r(a0, (int32) a1->w000E);
	if (a0_12 < 0x00)
		a1->w000C = (word16) ((word32) a1->w000C & ~0x1000);
	else
		a1->dw0050 += a0_12;
}

// 230A8B20: void __seofread()
void __seofread()
{
}

// 230A8B28: void __swrite(Register (ptr32 Eq_385116) a0, Register (ptr32 Eq_580934) a1)
void __swrite(union Eq_385116 * a0, struct Eq_580934 * a1)
{
	int32 a5_35 = (int32) a1->w000C;
	int32 a1_25 = (int32) a1->w000E;
	if ((a5_35 & 0x0100) != 0x00)
	{
		_lseek_r(a0, a1_25);
		a5_35 = (int32) a1->w000C;
		a1_25 = (int32) a1->w000E;
	}
	a1->w000C = (word16) (a5_35 & ~0x1000);
	_write_r(a0, a1_25);
}

// 230A8BB0: void __sseek(Register (ptr32 Eq_385116) a0, Register (ptr32 Eq_580974) a1)
void __sseek(union Eq_385116 * a0, struct Eq_580974 * a1)
{
	int32 a0_12 = _lseek_r(a0, (int32) a1->w000E);
	if (a0_12 == -1)
		a1->w000C = (word16) ((word32) a1->w000C & ~0x1000);
	else
	{
		ui32 a5_28 = (word32) a1->w000C;
		a1->dw0050 = a0_12;
		a1->w000C = (word16) (a5_28 | 0x1000);
	}
}

// 230A8C18: void __sclose(Register (ptr32 Eq_385116) a0, Register (ptr32 Eq_581009) a1)
void __sclose(union Eq_385116 * a0, struct Eq_581009 * a1)
{
	int32 a1_5 = (int32) a1->w000E;
	_close_r(a0, a1_5);
}

// 230A8C20: void __swbuf_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      fputwc
//      __swbuf
void __swbuf_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2)
{
	if (a0 != 0x00 && *((word32) a0 + 56) == 0x00)
	{
		word32 a3_273;
		__sinit(ra, a0, out a3_273);
	}
	Eq_581027 a5_125;
	byte * a4_117;
	int32 a5_37;
	int32 a4_31 = (int32) *((word32) a2 + 0x0C);
	*((word32) a2 + 8) = *((word32) a2 + 24);
	ui32 a3_34 = (word32) (word16) a4_31;
	if ((a3_34 & 8) != 0x00)
	{
		a5_37 = (int32) *((word32) a2 + 16);
		if (a5_37 != 0x00)
		{
			if (a3_34 << 0x12 < 0x00)
				goto l230A8C84;
			goto l230A8D1C;
		}
	}
	word32 a3_272;
	if (__swsetup_r(ra, a0, a2, out a3_272) != 0x00)
		return;
	a4_31 = (int32) *((word32) a2 + 0x0C);
	a5_37 = (int32) *((word32) a2 + 16);
	if ((word32) (word16) a4_31 << 0x12 < 0x00)
	{
l230A8C84:
		a4_117 = (byte *) *a2;
		a5_125 = a4_117 - a5_37;
		if (a5_125 < *((word32) a2 + 20))
			goto l230A8C94;
		goto l230A8D4C;
	}
l230A8D1C:
	int32 a3_65 = *((word32) a2 + 100);
	*((word32) a2 + 0x0C) = (word16) (a4_31 | 0x2000);
	a4_117 = (byte *) *a2;
	*((word32) a2 + 100) = a3_65 & ~0x2000;
	a5_125 = a4_117 - a5_37;
	if (a5_125 < *((word32) a2 + 20))
	{
l230A8C94:
		int32 a3_116 = *((word32) a2 + 8);
		*a2 = a4_117 + 1;
		*((word32) a2 + 8) = a3_116 + -1;
		*a4_117 = (byte) (a1 & 0x00FF);
		if (*((word32) a2 + 20) == (word32) a5_125 + 1)
			goto l230A8D84;
		goto l230A8CB8;
	}
l230A8D4C:
	word32 a3_271;
	if (_fflush_r(ra, a0, a2, a0, out a3_271) != 0x00)
		return;
	byte * a4_102 = *a2;
	int32 a3_103 = *((word32) a2 + 8);
	*a2 = a4_102 + 1;
	*((word32) a2 + 8) = a3_103 + -1;
	*a4_102 = (byte) (a1 & 0x00FF);
	if (*((word32) a2 + 20) == 1)
	{
l230A8D84:
		word32 a3_270;
		if (_fflush_r(ra, a0, a2, a0, out a3_270) == 0x00)
			return;
		return;
	}
l230A8CB8:
	if (((word32) *((word32) a2 + 0x0C) & 1) == 0x00 || (a1 & 0x00FF) != 0x0A)
		return;
	goto l230A8D84;
}

// 230A8DA4: void __swbuf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1)
void __swbuf(Eq_2 ra, Eq_2 a0, Eq_2 a1)
{
	Eq_2 a0_10 = g_t4200ECFC;
	__swbuf_r(ra, a0_10, a0, a1);
}

// 230A8DBC: void _wcrtomb_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a3)
// Called from:
//      fputwc
void _wcrtomb_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a3)
{
	int32 * s0_21;
	word32 * s1_22;
	<anonymous> * a5_16 = g_ptr4200E658;
	if (a1 != 0x00)
	{
		int32 a0_35;
		a5_16();
		if (a0_35 != -1)
			return;
	}
	else
	{
		int32 a0_25;
		a5_16();
		if (a0_25 != -1)
			return;
	}
	*s1_22 = 0x00;
	*s0_21 = 0x008A;
}

// 230A8E38: void wcrtomb(Register word32 ra, Register word32 a0, Register word32 a1, Register word32 a2)
void wcrtomb(word32 ra, word32 a0, word32 a1, word32 a2)
{
	int32 * s0_25;
	word32 * s1_26;
	Eq_2 s0_10 = g_t4200ECFC;
	<anonymous> * a5_17 = g_ptr4200E658;
	if (a0 != 0x00)
	{
		int32 a0_44;
		a5_17();
		if (a0_44 != -1)
			return;
	}
	else
	{
		int32 a0_30;
		a5_17();
		if (a0_30 != -1)
			return;
	}
	*s1_26 = 0x00;
	*s0_25 = 0x008A;
}

// 230A8ED0: void _wctomb_r()
void _wctomb_r()
{
	g_ptr4200E658();
}

// 230A8EE0: void __ascii_wctomb(Register (ptr32 int32) a0, Register (ptr32 byte) a1, Register Eq_581250 a2)
void __ascii_wctomb(int32 * a0, byte * a1, Eq_581250 a2)
{
	if (a1 == null)
		return;
	if (a2 > 0x00FF)
		*a0 = 0x008A;
	else
		*a1 = (byte) a2;
}

// 230A8F10: void _write_r(Register (ptr32 Eq_385116) a0, Register int32 a1)
// Called from:
//      __swrite
void _write_r(union Eq_385116 * a0, int32 a1)
{
	g_dw420277A8 = 0x00;
	if (_write(a1) != -1)
		return;
	Eq_385116 a5_27 = g_t420267A8;
	if (a5_27 == 0x00)
		return;
	*a0 = (union Eq_385116 *) a5_27;
}

// 230A8F78: void _close_r(Register (ptr32 Eq_385116) a0, Register int32 a1)
// Called from:
//      __sclose
void _close_r(union Eq_385116 * a0, int32 a1)
{
	g_dw420277A8 = 0x00;
	if (_close(a1) != -1)
		return;
	Eq_385116 a5_24 = g_t420267A8;
	if (a5_24 == 0x00)
		return;
	*a0 = (union Eq_385116 *) a5_24;
}

// 230A8FD4: void _fclose_r(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2)
// Called from:
//      fclose
void _fclose_r(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2)
{
	if (a1 == 0x00)
		return;
	Eq_2 s1_14 = a0;
	Eq_2 s0_15 = a1;
	if (a0 != 0x00 && *((word32) a0 + 56) == 0x00)
	{
		word32 a3_232;
		__sinit(ra, a0, out a3_232);
		if ((int32) *((word32) a1 + 0x0C) == 0x00)
			return;
	}
	else if ((int32) *((word32) a1 + 0x0C) == 0x00)
		return;
	word32 a3_231;
	Eq_2 a0_38 = __sflush_r(ra, a0, a1, s2, out a3_231);
	<anonymous> * a5_45 = *((word32) a1 + 44);
	if (a5_45 != null)
	{
		int32 a0_57;
		word32 a5_58;
		word32 a2_59;
		word32 a3_60;
		word32 a4_61;
		word32 t0_62;
		word32 t1_63;
		a5_45();
		if (a0_57 < 0x00)
		{
			if (((word32) *((word32) s0_15 + 0x0C) & 0x0080) == 0x00)
			{
l230A905C:
				Eq_2 a1_79 = *((word32) s0_15 + 48);
				if (a1_79 != 0x00)
				{
					if (a1_79 != (word32) s0_15 + 64)
						_free_r(s1_14, a1_79);
					((word32) s0_15 + 48)->u0 = 0x00;
				}
				Eq_2 a1_87 = *((word32) s0_15 + 0x0044);
				if (a1_87 != 0x00)
				{
					_free_r(s1_14, a1_87);
					((word32) s0_15 + 0x0044)->u0 = 0x00;
				}
				__sfp_lock_acquire();
				((word32) s0_15 + 0x0C)->u2 = 0x00;
				__sfp_lock_release();
				return;
			}
l230A90D4:
			_free_r(s1_14, *((word32) s0_15 + 16));
			goto l230A905C;
		}
	}
	if (((word32) *((word32) s0_15 + 0x0C) & 0x0080) == 0x00)
		goto l230A905C;
	goto l230A90D4;
}

