pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_000A.c
// 230A90E4: void fclose(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2)
void fclose(Eq_2 ra, Eq_2 a0, Eq_2 s2)
{
	Eq_2 a0_8 = g_t4200ECFC;
	_fclose_r(ra, a0_8, a0, s2);
}

// 230A90F8: Register Eq_2 _fstat_r(Register Eq_2 a0, Register int32 a1, Register (ptr32 Eq_575861) a2)
// Called from:
//      __swhatbuf_r
Eq_2 _fstat_r(Eq_2 a0, int32 a1, struct Eq_575861 * a2)
{
	g_t420267A8.u0 = 0x00;
	if (_fstat(a1, a2) != -1)
		return;
	Eq_385116 a5_35 = g_t420267A8;
	if (a5_35 == 0x00)
		return;
	*a0 = a5_35;
	return;
}

// 230A915C: Register Eq_2 _isatty_r(Register Eq_2 a0, Register int32 a1)
// Called from:
//      __smakebuf_r
Eq_2 _isatty_r(Eq_2 a0, int32 a1)
{
	g_t420267A8.u0 = 0x00;
	if (_isatty(a1) != -1)
		return;
	Eq_385116 a5_32 = g_t420267A8;
	if (a5_32 == 0x00)
		return;
	*a0 = a5_32;
	return;
}

// 230A91B8: Register (ptr32 Eq_385116) _lseek_r(Register (ptr32 Eq_385116) a0, Register int32 a1)
// Called from:
//      __swrite
//      __sseek
union Eq_385116 * _lseek_r(union Eq_385116 * a0, int32 a1)
{
	g_t420267A8.u0 = 0x00;
	if (_lseek(a1) != -1)
		return;
	Eq_385116 a5_27 = g_t420267A8;
	if (a5_27 == 0x00)
		return;
	*a0 = (union Eq_385116 *) a5_27;
	return;
}

// 230A9220: Register (ptr32 Eq_385116) _read_r(Register (ptr32 Eq_385116) a0, Register int32 a1)
// Called from:
//      __sread
union Eq_385116 * _read_r(union Eq_385116 * a0, int32 a1)
{
	g_t420267A8.u0 = 0x00;
	if (_read(a1) != -1)
		return;
	Eq_385116 a5_27 = g_t420267A8;
	if (a5_27 == 0x00)
		return;
	*a0 = (union Eq_385116 *) a5_27;
	return;
}

// 230A9288: Register int32 _close(Register int32 a0)
// Called from:
//      _close_r
int32 _close(int32 a0)
{
	__syscall();
	int32 s0_15 = a0;
	if (a0 < 0x00)
	{
		word32 a5_38;
		*__errno(out a5_38) = 0x00 - a0;
		s0_15 = -1;
	}
	return s0_15;
}

// 230A92E0: void _exit(Register int32 a0)
// Called from:
//      abort
void _exit(int32 a0)
{
	__syscall();
	if (a0 < 0x00)
	{
		word32 a5_22;
		*__errno(out a5_22) = 0x00 - a0;
		while (true)
			;
	}
	else
	{
		while (true)
			;
	}
}

// 230A9324: Register int32 _fstat(Register int32 a0, Register (ptr32 Eq_575861) a1)
// Called from:
//      _fstat_r
//      _isatty
int32 _fstat(int32 a0, struct Eq_575861 * a1)
{
	__syscall();
	int32 s0_19 = a0;
	if (a0 < 0x00)
	{
		word32 a5_55;
		*__errno(out a5_55) = 0x00 - a0;
		s0_19 = -1;
	}
	_conv_stat(a1, fp + -144);
	return s0_19;
}

// 230A9394: void _getpid()
// Called from:
//      _getpid_r
void _getpid()
{
}

// 230A939C: Register int32 _isatty(Register int32 a0)
// Called from:
//      _isatty_r
int32 _isatty(int32 a0)
{
	if (_fstat(a0, fp + -0x0068) == -1)
		return 0;
	return dwLoc64 >> 0x0D & 1;
}

// 230A93DC: Register int32 _kill()
// Called from:
//      _kill_r
int32 _kill()
{
	word32 a5_14;
	*__errno(out a5_14) = 22;
	return -1;
}

// 230A9400: Register int32 _lseek(Register int32 a0)
// Called from:
//      _lseek_r
int32 _lseek(int32 a0)
{
	__syscall();
	int32 s0_13 = a0;
	if (a0 < 0x00)
	{
		word32 a5_34;
		*__errno(out a5_34) = 0x00 - a0;
		s0_13 = -1;
	}
	return s0_13;
}

// 230A9450: Register int32 _read(Register int32 a0)
// Called from:
//      _read_r
int32 _read(int32 a0)
{
	__syscall();
	int32 s0_13 = a0;
	if (a0 < 0x00)
	{
		word32 a5_34;
		*__errno(out a5_34) = 0x00 - a0;
		s0_13 = -1;
	}
	return s0_13;
}

// 230A94A0: Register Eq_577983 _sbrk(Register Eq_577983 a0, Register out Eq_2 a3Out)
// Called from:
//      _sbrk_r
Eq_577983 _sbrk(Eq_577983 a0, union Eq_2 & a3Out)
{
	Eq_577983 a5_19 = g_t4200F734;
	if (a5_19 == 0x00)
	{
		__syscall();
		if (false)
		{
l230A9530:
			word32 a5_71;
			*__errno(out a5_71) = 0x0C;
			a3Out.u0 = <invalid>;
			return -1;
		}
		g_t4200F734.u0 = 0;
		a5_19.u0 = 0;
	}
	__syscall();
	Eq_577983 a5_32 = g_t4200F734;
	word32 a0_24 = a0 + a5_19;
	if (a0_24 == a0 + a5_32)
	{
		g_t4200F734 = a0_24;
		a3Out.u0 = <invalid>;
		return a5_32;
	}
	goto l230A9530;
}

// 230A954C: Register int32 _stat(Register int32 a0, Register (ptr32 Eq_575861) a1)
// Called from:
//      _stat_r
int32 _stat(int32 a0, struct Eq_575861 * a1)
{
	__syscall();
	int32 s0_19 = a0;
	if (a0 < 0x00)
	{
		word32 a5_55;
		*__errno(out a5_55) = 0x00 - a0;
		s0_19 = -1;
	}
	_conv_stat(a1, fp + -144);
	return s0_19;
}

// 230A95BC: Register int32 _write(Register int32 a0)
// Called from:
//      _write_r
int32 _write(int32 a0)
{
	__syscall();
	int32 s0_13 = a0;
	if (a0 < 0x00)
	{
		word32 a5_34;
		*__errno(out a5_34) = 0x00 - a0;
		s0_13 = -1;
	}
	return s0_13;
}

// 230A960C: void _conv_stat(Register (ptr32 Eq_575861) a0, Register (ptr32 Eq_581530) a1)
// Called from:
//      _fstat
//      _stat
void _conv_stat(struct Eq_575861 * a0, struct Eq_581530 * a1)
{
	int32 t2_6 = a1->dw0014;
	int32 t0_7 = a1->dw0018;
	int32 t6_8 = a1->dw001C;
	int32 t5_9 = a1->dw0020;
	int32 t4_10 = a1->dw0030;
	int32 t3_11 = a1->dw0040;
	int32 t1_12 = a1->dw0038;
	int32 a6_13 = a1->dw0048;
	int32 a7_14 = a1->dw004C;
	int32 a2_15 = a1->dw0058;
	int32 s0_20 = a1->dw0010;
	int32 s1_21 = a1->dw0008;
	int32 a3_25 = a1->dw005C;
	int32 a4_26 = a1->dw0068;
	int32 a5_27 = a1->dw006C;
	a0->w0000 = a1->w0000;
	a0->w0002 = (word16) s1_21;
	a0->dw0004 = s0_20;
	a0->w0008 = (word16) t2_6;
	a0->w000A = (word16) t0_7;
	a0->w000C = (word16) t6_8;
	a0->w000E = (word16) t5_9;
	a0->dw0010 = t4_10;
	a0->dw0048 = t3_11;
	a0->dw0044 = t1_12;
	a0->dw0018 = a6_13;
	a0->dw001C = a7_14;
	a0->dw0028 = a2_15;
	a0->dw002C = a3_25;
	a0->dw0038 = a4_26;
	a0->dw003C = a5_27;
}

